{
   "01.024.07": "Oben, im Bodenlosen, festigt König Varuna, der heilige, Des waldigen Baumes Gipfel, Dessen Zweige niederwärts stehen, während ihre Basis oberhalb ist. Mögen in unserm Innern die Lebensgeister eingefügt (und wohl behütet sein).",
   "01.024.08": "Hat König Varuna doch auch der Sonne Zu ihrem Lauf den Weg breit gemacht, Hat an ihr, der fußlosen, Füße geschaffen, die sie (auf die Bahn fest) aufsetzen kann. So wird er auch (von uns den bösen Feind, den) Herz-durchbohrer hinwegbannen.",
   "01.024.09": "Hundert Ärzte sind dir ja, o König, ja tausend. So möge breit und tief dein Wohlmeinen (gegen uns) sein, Weit hinweg vertreibe das Unheil, Löse von uns die begangenen Sünden.",
   "01.024.10": "Jene Sterne, da oben (von dir) hingesetzt, die nachts sichtbar waren, Sind (Varuna's Ordnung folgend) tags irgendwo hingegangen. (Denn) unverbrüchlich sind Varuna's Festsetzungen. Selbst der Mond, nachts (so gewaltig) scheinend, muß bei Tage davon.",
   "01.024.11": "Um dieses (eine) gehe ich dich an, mit meinem Psalme dich verehrend, Dies (eine) fleht (von dir) der Opferer mit seinen Darbringungen, Merke darauf, in Gnade gesonnen: „Nimm nicht das Leben von uns, o Weitgebietender.\"",
   "01.024.12": "Das sagen mir ja tags, das sagen mir nachts (die Wissenden), Das kündet mir (meines eigenen) Herzens Hoffen: „Er, den einst der Shunahshepa in seinen Banden anrief, Der muß auch uns jetzt losmachen, – der König Varuna.\"",
   "01.024.13": "Shunahshepa, in Bande geschlagen und an drei Blöcke gebunden, Rief ja den Heilvollen an, Rief, daß König Varuna ihn losmache. So soll auch von uns die Stricke lösen Er, der Wissende, der Untrügliche.",
   "01.024.14": "Hinweg flehen wir deinen Zorn, o Varuna, mit Niederfallen, Hinweg mit unsern Opfern, unsern Darbringungen. O Asura, o Weiser! Löse von uns, o König, Die begangenen Sünden. Du (allein) hast ja die Macht dazu.",
   "01.024.15": "Auf löse, Varuna, den oberen Strick. Ab löse den unteren. Den mittleren löse heraus. Dann wollen wir, o Heilvoller, in deinem Gesetz (treu) sein, Schuldfrei geworden wollen wir dann zum Heile sein.",
   "05.064.01": "Ihr beiden Schützer des Rechtes! Den Wagen habt ihr bestiegen im höchsten Himmel, O ihr, deren Gesetze wahrhaftig sind. Wen ihr, o Mitra-Varuna, hier begnadet, Dem quillt der Regen, des Himmels Süßigkeit.",
   "05.064.02": "Als Ahnherrn herrscht ihr über diese Welt, o Mitra-Varuna, In Weisheit, mit der Sonne (als euerm Auge) schauend. Den Regen, euere Gabe, als Mittel zum Leben erbitten wir. – Donner fahren daher über Himmel und Erde hin.",
   "05.064.03": "Eilends folgt ihr ihrem Gerolle auf dem Fuße mit bunten Wolken, O ihr Allherrscher, gewaltige Stiere, Herrn des Himmels, Mitra-Varuna, Um den Himmel strömen zu lassen durch eure göttliche Wundermacht.",
   "05.064.04": "Ja, eure Wundermacht reicht bis zum Himmel, o Mitra-Varuna. Schon legt die Sonne, sonst so licht, (seltsam) bunte Rüstung an. Ihr verhüllt sie mit der Regenwolke. Schon brechen die (ersten) Regentropfen hervor, o Parjanya.",
   "05.064.05": "Die Stürme schirren ihren Wagen an, den glückhaften, Wie ein Held zum Rinder-beutezuge (seinen Streitwagen anschirrt). Vielfache Donner durchfahren die Finsternisse. Mit Himmelsnaß beträuft uns, o Allherrscher.",
   "05.064.06": "Nun redet Parjanya seine Rede Bald erquickend, bald lautrauschend, bald schreckhaft. Die Stürme haben sich (inzwischen) durch ihre Wundermacht in die Wolken gehüllt. Ihr beide aber laßt nun den Himmel, der (inzwischen) fahlgelb und farblos geworden, weiter strömen.",
   "05.064.07": "Mit festem Halte, Mitra, Varuna, schützt ihr, o Weise, Die Satzungen, mit göttlicher Wundermacht. Mit dem Rechte herrscht ihr über die ganze Welt (Mit dem Rechte) setzet ihr die Sonne, (euern) Wagen, wieder farbenprächtig an den Himmel.",
   "05.066.01": "An das Götterpaar hoher Weisheit voll, an das machtvolle, (Richte dein Lied) o Sterblicher, wenn du verständig bist. Möge es dem Varuna, dem mit dem Rechte geschmückten, Zu hoher Lust bestellt sein.",
   "05.066.02": "Denn diese beiden (allein) haben erlangt das kosmische Reich, Das unentreißbare, das vollkommen göttliche, Und darnach ward (von ihnen auch) das menschliche (Reich) In Form fester Gesetze herrlich hergestellt.",
   "05.066.04": "Auch umfaßt ihr mit dem festen Gehege euerer Geistesmacht (alle) Seherkünste, o Unaussprechliche. Durch den Geist der Menschen Laßt ihr euch wahrnehmen, o die ihr reinen Geistes seid.",
   "05.066.05": "Sein hohes Gesetz, o Erde, (will ioh preisen). Im Liederkampfe der Sänger. (Solche Loblieder) werden in den Wettkämpfen Die beiden (andern, konkurrierenden) Wettläufer geziemender Weise Mit breitem Abstande überholen.",
   "05.066.06": "Daß wir und unsere Wohltäter doch O Mitra (-Varuna), o ihr, die ihr euer Auge weithin wandern laßt, Vereinigt werden möchten In dem euch gehörigen, weitest umfassenden, viel Schutz gewährenden Königreiche.",
   "05.085.01": "Wohlan! Auf den Allkönig singe hehren Weihegesang und tiefen – lieb dem Varuna, dem hochgerühmten, der die Erde wie einen Teppich an der Sonne ausrollte, wie der Schlächter das Fell (an der Sonne zum Trocknen ausbreitet).",
   "05.085.02": "Auf den Wäldern spannte er den Luftraum aus. (Er formte) in Kühen Milch, die Schnelle in den Rossen. In Herzen setzte Varuna Verstand, in Wässer Feuer, die Sonne an den Himmel, auf den Fels den Soma.",
   "05.085.03": "Den Spund nach unten ließ den (Regen) schlauch er fließen auf die bei den Sfären und den Luftraum. Damit durchtränkt der König aller Welt den Boden, wie der Regen Korngefilde (durchtränkt).",
   "05.085.04": "Den (ganzen) Boden, Erd und Himmel tränkt er. – Wenn Varuna so Milch zu spenden trachtet, dann hüllen schnell die Berge sich in dichtes Wolkendunkel und die Starken lassen voll Ungestüm (ihren Sturmrossen die Zügel) schießen.",
   "05.085.05": "Und weiter will ich künden dieses große Wunderwerk des ganz göttlichen, hochgerühmten Varuna: Er maß die Erde mit der Sonne aus wie mit einem Meß-stabe, selbst dabei in den Lüften stehend.",
   "05.085.06": "Auch folgend großes maya-werk des Gottes, des allerweisesten (kavitama), hat keiner noch verhindern können: (nämlich) daß die Ströme, obschon doch schnell wie Hirsche sich in den einen See ergießend, mit all ihrem Wasserschwalle ihn nicht füllen (und zum Überlaufen bringen können).",
   "05.085.07": "Wenn wir beim Spiel betrogen, wie Spieler (tun), (die Sünde), die uns gewiß ist, und auch wovon wir nicht wissen. All dieses löse auf, o Gott, wie man Verschlingung (entknotet). Und dann (wenn du uns gelöst hast), o Varuna, laß uns dir wieder lieb sein. –",
   "07.062.01": "Emporgereckt hat Surya seine Strahlen Weithin über alle Menschengeschlecht er insgesamt. Strahlend gleich dem Himmelsglanze ist er erschienen. Mit Weisheit geschaffen, wohlgeschaffen von den Schöpfern ward er (heute wieder neu).",
   "07.062.02": "Aufs neue bist du, Surya, wieder vor uns aufgegangen, (Hergezogen) von diesen Preisliedern wie durch schnelle Rosse. Möchtest du dem Mitra, dem Varuna uns melden Als schuldlose, und dem Aryaman, und dem Agni.",
   "07.062.03": "Mögen uns tausend Stärkungen verleihen Mitra, Varuna und Agni, die Gerechten. Mögen sie, die Glänzenden, (selber) uns das beste Lied eingeben und (damit) gepriesen uns dann unsern Wunsch erfüllen.",
   "07.062.04": "Himmel-Erde, Aditi, schützet uns, (Schützen mögen uns auch) die  Urschöpfer, die auch euch, o Hohe, geschaffen haben. Möchten wir nicht in Varuna's und Vayu's Ungnade sein Oder in Mitra's, des liebsten der „Männer\".",
   "07.062.05": "Strecket ihr beiden euere Arme aus, uns zum Leben, Laßt unsere Rindertriften triefen von Butter. Gebt uns Ruhm unter den Leuten, ihr Jugendlichen, Erhört, o Mitra-Varuna, diese meine Anrufungen.",
   "07.062.06": "Aufs neue sollen Mitra, Varuna, Agni uns selber und unserer Nachkommenschaft Freiheit (von allem Übel) schaffen. Wohlgangbar seien uns alle Wege, guten Pfades. – Behütet uns immerdar mit euern Segnungen.",
   "07.086.01": "Weise werden wir Geschöpfe doch erst durch die Majestät dessen, der auseinander-stützte die beiden weiten Sfären, die (Himmels-) kuppe hoch hinaufstieß, zwiefach die Sonne anstieß und die Erde weithin dehnte.",
   "07.086.02": "Da (nämlich: durch solche Majestät weise geworden), red ich mit mir selber also: „Wann könnte ich doch selber Varuna nahe sein! „Ob er sich meines Opfers wohl ohne Groll erfreuen wird? „Wann werd ich frohen Herzens, Erbarmen erfahren?\"",
   "07.086.03": "Begierig, das Übel (nämlich den Grund von Varuna's Fremdsein) zu erkennen, frage ich mich selbst und gehe, die hierin Kundigen darüber auszuforschen. Da sagen mir die kavi's übereinstimmend: „Er dort, Varuna, er zürnt dir.\"",
   "07.086.04": "(So frage ich denn dich selbst): „Was war denn, Varuna, die so große Sünde, für die du deinen Psalmsänger (stotaram), deinen Treuen schlagen willst? Das sage mir, Unbetrüglicher, Selbstgesetzlicher! Eilend möchte ich (wieder) zu dir kommen durch diese meine Beugung (vor Dir).",
   "07.086.05": "Löse von uns die Erbschuld von den Völkern her, löse uns auch von der Schuld, die wir selbst begangen. Mach los, o König, den Vasischtha, gebunden wie ein Dieb, der Vieh stahl, wie das Kalb vom Bande.",
   "07.086.06": "Was mich sündigen machte, war ja nicht mein eigener Wille, o Varuna, es ist Trunkenheit, Jähzorn, Würfelspiel, Gedankenlosiigkeit, es ist, weil der ältere (durch übles Vorbild) dem jüngeren zur Verirrung gereicht. Selbst der Schlaf macht uns ja nicht sicher vor dem Unrechten.",
   "07.086.07": "(Wenn er mir verzeiht), so werde ich ihm dienen wie ein Knecht Seinem Brotherrn, dem eifernden Gotte, nachdem ich der Schuld ledig geworden bin. Den Toren gibt er Einsicht, der treue Gott. Den (endlich) klug gewordenen wird er, der klügste (kavitara), nun zum Heile leiten. (Abgesang)",
   "07.086.08": "Möge dir, o Varuna, dieses Preislied ins Herz gedrungen sein, o deiner eigenen Satzung getreuer. Heil sei uns im Ruhn, Heil sei uns im Tun. Ihr aber (Ihr aditya's) hütet uns mit euern Segenskräften immerdar.",
   "07.087.01": "Wie er der Sonne ihre Pfade vorzeichnet, So läßt Varuna mit fester Satzung Der Ströme wasserreiche Fluten laufen, wie ein losgelassenes Wettrennen von Stuten. So setzte er auch den Tagen ihre (nach dem rita festgesetzten) großen Bahnen.",
   "07.087.02": "Wie ein feuriges Roß auf der Weide, so rast Dein Atem durch den Luftraum als Sturm, ausgegangen auf Sieg. Alle die zwischen Himmel und Erde sind, Sie sind alle deine ergebenen Gefolgsmannen, o Varuna.",
   "07.087.03": "In seinem Auftrage überschauen seine Späher Die beiden Sfären, die festgegründeten, (Und schauen aus nach) den kavi's die rechtbeflissen, opferkundig, Weise ihr Gebet emporsenden.",
   "07.087.04": "Mir als Eingeweihtem verkündete Varuna: „Dreimal sieben (geheime) Namen trägt die (Erd-)Kuh. Wer kundig ist der Spur (dieser Kuh), soll davon nur im Geheimen reden, Wenn er als Seher-sänger (von Fach) dem späteren Geschlecht zum Wohle förderlich sein will.",
   "07.087.05": "(Aber auch) die Himmel sind in ihm niedergesetzt, Darunter die drei Erden: im Ganzen sechs Abteilungen (des Weltbaues. Als geschickter (Meister) hat König Varuna am Himmel Sich diese Schaukel da (die Sonne) zur Lust geschaffen.",
   "07.087.06": "Hinab ist Varuna gestiegen in die (himmlische) Flut, als Glutender, In weißen Tropfens Gestalt, der starke Stier. Über die Tiefe (gleichfalls) gebietend, den Lufttraum (siegreich) durchmessend, Ein König über dieses ganze Seiende, führt er sein Königreich gegen allen Widerstand zum Siege.",
   "07.087.07": "Möchten wir schuldlos sein vor Varuna, Der ja auch dem, der Schuld begangen hat, verzeiht. (Möchten wir) Erfüller der Gesetze Aditi's s ein. – Ihr aber schützet uns mit euren Segnungen immerdar.",
   "07.088.01": "Auf, Vasischtha, bringe dem Varuna, dem huldreichen, ein feines Lied, Ein ihm besonders liebes, Daß er ihn, den Yajatra, den tausendfach spendenden, befruchtenden großen, herbeikommen lasse.",
   "07.088.02": "(Der Seher singt): „Damals, als ich zu seiner (inneren) Schau gekommen bin, Da ist des Feuers Antlitz mir erschienen wie das des Varuna. Da führte er mir Glanz, der auf der Felswand erschien, Und Dunkel als der Schauspiel-leiter auf zu wunderbarem Schauspiel.",
   "07.088.03": "Wenn wir (wieder wie damals), ich und Varuna zusammen, das Schiff besteigen, Wenn wir dann mitten ins Meer hinausfahren, Hei, da wollen wir uns (wieder) in der Schaukel schaukeln zur Lust.",
   "07.088.04": "Ins Schiff hatte (damals) Varuna (selbst) den Vasischtha gesetzt, Zum Seher hat er, der Künstler, ihn mit seinen Großtaten gemacht, Zum Sänger, er, der selbst der Seher-sänger ist, Am glücklichsten der Tage für solange, wie die Himmel dauern, solange, wie die Morgenröten dauern werden.",
   "07.088.05": "Aber wo sind nun diese Freundeserweisungen geblieben? Durfte ich doch, als wir früher in Freundschaft verkehrten, (Sogar) zu deinem hohen Wohnsitze, o Varuna, o du dir selbst getreuer, In dein tausendtoriges Haus kommen!",
   "07.088.06": "Er, der, obschon dein Vasall auf immer und dir lieb, dennoch wider dich Sünden beging, Gilt dir (durch dein Verzeihen) gleichwohl als Freund. (So hoffen wir, daß) auch wir, ob schon wir dir sündigten, nicht (deinen Zorn) erfahren mögen, o Wunderreicher. Schenke du, der du selber Seher-sänger bist, dem Sänger deinen Schutz.",
   "07.088.07": "In diesen (fortan durch göttlichen Schutz) gesicherten Wohnsitzen wohnend – Möge Varuna (hinfort) von uns lösen seine Schlinge – (Auf daß wir) Lust erlangen aus Aditi's Schoße. Schützet ihr uns mit Segnungen immerdar.",
   "08.041.01": "Ihm, dem sehr gewaltigen Varuna, singe wohl, den Marut's (auch), den sehr weisen, der der Menschen Gedanken bewacht, (wie ein Hirte) die weidenden Kühe. Zerbersten sollen die Fremden zumal!",
   "08.041.02": "Ihn (preise ich) sowohl mit eigenem Liede wie mit meiner Väter Gesängen, (nämlich) mit Nabhaka's (meines Ahnherrn) Preisliedern. Ihn, der am Ursprunge der (Regen-)ströme weilt (preise ich) zusammen mit seinen sieben Schwestern: er (als die Hauptperson) in ihrer Mitte. – Zerbersten sollen die Fremden zumal!",
   "08.041.03": "Er hat umfaßt die Finsternisse, hat hingesetzt mit seiner Wundermacht die Tageshellen, herrlich zu schauen (in seiner Wundermacht) um alles her. Nach seinem Gesetz ließen die Chariten die drei Morgenröten entsprießen. – Zerbersten sollen die Fremden zumal!",
   "08.041.04": "Er, der die Bergeshöhen auf der Erde fest hingesetzt hat, herrlich zu schauen, der ist (selber auch) der Baumeister jener uralten Stätte (an der er selber thront), (Er – nämlich) jene Siebenheit des Varuna. Er ist (als solch siebenfältiger) wie ein mächtiger Hüter. Zerbersten sollen die Fremden zumal!",
   "08.041.05": "Er, der Festhalter der Welten, der die Namen der Morgenröten, die verborgenen, geheimen, kennt, er, der (Geheimes wissende) kavi, läßt seine (kavi-)künste erblühen in Vielgestalt, wie der Himmel (die vielgestaltigen Himmelsfarben (erblühen läßt). – Zerbersten sollen die Fremden zumal!",
   "08.041.06": "Ihm, in welchem alle (kavi-)künste so enthalten sind, wie die Nabe im Rade. Ihn, diesen trita verehrt mit Eifer. Wie die Kühe im Stalle (in ihm) vereint,  haben sie ihre Rosse zur Fahrt angeschirrt. – Zerbersten sollen die Fremden zumal!",
   "08.041.07": "Er, der wie ein Mantel sich auf diese (unteren Räume) legt (und so schützend) alle Lebewesen und deren Wohnstätten umfängt – nach seinem Gesetze tun alle Götter (ihren Dienst), vor Varuna, in seinem Haushalte. – Zerbersten sollen die Fremden zumal!",
   "08.041.08": "Ins Geheim steigt dieser, voran stürmend, mit seinen Fluten zum Himmel empor. Dadurch, daß er in diesen (unteren Räumen) das Opferwerk eingerichtet hat, stieß er mit seinem Flammenfuße alles (feindliche) Zauberwerk nieder, die (Himmels-)kuppe hinaufsteigend. – Zerbersten sollen die Fremden zumal!",
   "08.041.09": "Er, dessen glänzendes, weitschauendes Augenpaar die drei (unteren Sfären) beherrscht, und auch über die drei höheren Sfären, den festen (Wohn-)sitz Varuna's, reicht, Er, der Herrscher der Sieben (dies siebenfältigen Aditya-kreises) ist das. – Zerbersten sollen die Fremden zumal!",
   "08.041.10": "Er, der nach fester Ordnung sich angetan hat sowohl mit den glänzenden wie auch mit den dunklen Prachtgewändern, Er, der (in der Vorzeit) die uralte Wohnstätte (der asurischen Siebenheit) erbaut hat, der trennte auch mit fester Stützung die beiden Sfären auseinander und festigte den Himmel – er, als der Ungewordene. Zerbersten sollen die Fremden zumal!",
   "10.063.01": "Wer dir, o Zorn, der du den Schlachtkeil als Wurfgeschoß trägst, huldigte, der gedeiht völlig in lauter Sieg und Macht. Mit dir im Bunde wollen wir besiegen Barbar wie Arier mit der (durch deine) Macht geschaffenen mächtigen Macht.",
   "10.063.02": "Zorn ward zum Indra, Zorn nur ward zu jedem Gott, Zorn ist der Priester, ist Varuna, ist Agni. Zorn preisen die Menschenstämme. Zorn, mit Hitze (tapas) gerüstet, schütze uns.",
   "10.063.03": "Greife an, Zorn, stärker als der Starke. Mit Hitze vereint zerschlage die Feinde. Neider-schlagender, Unhold-schlagender, die „bösen Feinde\"-schlagender, alle ihre Güte bringe uns her.",
   "10.063.04": "Zorn, als der durch sich selbst seiende, hat Macht zum Überwinden. Als Grimm bist du des Nachstellers mächtig. Gott über alle Stämme, sieggewohnt, sieggewaltig gib in uns Kraft in den Schlachten.",
   "10.063.05": "Als es mir übel ging, hatte ich mich mit meinem Geiste abgewandt von dir, dem mächtigen, o Weiser; dich, diesen (Weisen), hatte ich Tor erzürnt. Komme doch (trotzdem) zur Kraftverleihung für mich, in deinem eigensten Selbst.",
   "10.063.06": "Ich bin dein. So komme her zu mir als zugekehrter, o sieghafter, als erquickender. O Zorn, du Schlachtkeil-träger, kehre dich zu mir. Laß uns zusammen die bösen Feinde schlagen, aber deines Freundes gedenke (in Gnade).",
   "10.063.07": "Geh an (im Kampf), sei mir zur Rechten. Dann wollen wir die Feinde in Menge schlagen. Dann opfere ich dir den besten Becher Methes. Zusammen trinken wir beide dann, als die ersten (in der Reihe der Festgenossen), den Soma.",
   "10.082.02": "Wie Feuer bist du, Zorn, wenn du aufgeregt bist. Siege als unser Heerführer, o Sieghafter. Komme, nachdem dir geopfert ward. Wenn du die Feinde zerschlagen hast, verteile (uns) ihr Gut, Deine Macht an ihnen messend stoße die Hasser fort.",
   "10.082.04": "Als Einziger der vielen bist du (allein), o Zorn, der (in Wahrheit) angerufene. Entflamme du im Kampfe Stamm auf Stamm."
}