{
   "01.014.01": "Viens, é Agni, vers un don—d’hommage (consistant en) paroles, (viens) avec tous les dieux que voici,] afin de boire le soma, (viens) et dis—la-yajya! —",
   "01.014.02": "Les Kanva viennent de t’appeîer ici : ils chantent, ô (dieu) inspiré, les poèmes (émanant) de toi.] Avec (tous) les dieux, ô Agni, arrive !",
   "01.014.03": "(J ’invoque) Indre—Väyu, Brhaspati, (Varuna—)Mitra, Agni, Püsan, Bhaga,/ les Âditya, la cohorte mârutienne.",
   "01.014.04": "Les jus (de soma) vous sont présentés (en cet instant), enivrants, facteurs d’ivresse,/ les gouttes de miel qui siègent dans la cuve.",
   "01.014.05": "T’invoquent les Kanva, qui sepirent à l’aide (divine), qui rabattent la jonchée (rituelle),/ qui, portant i’0ffrande, mettent en forme (les éléments du rite).",
   "01.014.06": "(Les dieux) qui, le beurre—fendu (ruisselant) sur le des, la pensée attelée, te véhiculent, eux les vecteurs,/ (ces) dieux, (je les amène) ici pour boire le soma.",
   "01.014.07": "Ces (dieux) voués au sacrifice, invigurés par l’Ordre, fais (ensorte), ô Agni, (qu’ils viennent) avec les Epuuses (divines) !] Fais—les boire du miel, 6 (dieu) à la bonne langue ! °",
   "01.014.08": "Eux qui sont voués au sacrif‌ice, digne d’être invoquée, que ce soient eux (, non d’autres,) qui boivent par ta langue, Agni, de (ce) miel, en énonçant (le cri rituel) vasat!",
   "01.014.09": "Que du domaine—lumineux du soleil, quel qu’il soit, l’oblateur inspiré véhicule ici] tous les dieux, eux qui s’éveillent à l’aurore !",
   "01.014.10": "Avec tous (les dieux), ô Agni, (bois) le miel consistant en soma, (spécialement) avec Indre, avec Väyu,/ bois(-le) avec les institutions de (Varuna—)Mitra !",
   "01.014.11": "En qualité d’Oblateur institué par l’Homme, é Agni, tu sièges dans les sacrif‌ices] Tel (étant donc), exécute pour nous le cursus—rituel que voici !",
   "01.014.12": "A savoir, attelle au char les (juments) fauves, les alezanes, ô dieu, les rouges ! / Avec elles véhicule ici les dieux!",
   "01.048.01": "Avec (toute) chose agréable, luis pour nous au loin, Aurore, Fille du ciel! Avec le haut prestige, ô irradiante, avec la richesse, ô déesse, toi qui détiens les dons!",
   "01.048.02": "(Les Aurores) qui possèdent des chevaux, des vaches, qui procurent aisément tout (bien), s'activent multiplement pour luire. Suscite à mon encontre les libéralités, Aurore, stimule la faculté de donner des (patrons) généreux !",
   "01.048.03": "L'Aurore a lui (de tout temps) et elle luira encore, déesse animatrice des chars. — Ceux qui, à ses approches, se tiennent prêts, tels des gens avides de renom (qui s'apprêtent pour un voyage) en mer, ...",
   "01.048.04": "ceux, Aurore, qui attellent leur pensée à donner lors de tes marches, eux les patrons, — de ces héros ici même Kaṇva, le Kaṇva par excellence, chante le nom.",
   "01.048.05": "Voici qu'arrive l'Aurore, comme une belle jeune femme, offrant ses joies. Elle marche, éveillant la gent munie de pieds, elle fait s'envoler (les animaux) ailés.",
   "01.048.06": "Celle qui donne libre cours aux rendez-vous, à ceux qui s'affairent, elle va comme sur la trace (du mâle, elle la) lubrique. Jamais les oiseaux ne s'arrêtent quand ils ont pris leur vol durant ton éclairement, ó porteuse des prix de victoire.",
   "01.048.07": "Elle a attelé (ses chevaux) d'un séjour lointain, du lieu où le soleil se lève. Avec ses cent chars, cette Aurore bienheureuse s'élance dans la direction des humains.",
   "01.048.08": "Toute chose animée s'est courbée à sa vue. Elle fait la lumière, la belle (jeune femme). Que la généreuse Fille du ciel écarte en luisant l'hostilité, que l'Aurore écarte les fautes!",
   "01.048.09": "Aurore, rayonne de tes rayons dorés, Fille du ciel, en amenant vers nous l'abondance, en irradiant la bonne chance pour les sacrifices du jour!",
   "01.048.10": "Oui, le fait que tout (être) respire, qu'il vive, (réside) en toi quand tu luis au loin, ó belle (jeune femme). Sur ton haut char, ô irradiante, écoute notre appel, toi qui te signales par tes bienfaits!",
   "01.048.11": "Aurore, gagne donc un prix de victoire qui se signale dans la génération humaine! Amène avec lui (les dieux) vers les cérémonies de l'homme pieux, des guides (du sacrifice) qui le chantent!",
   "01.048.12": "Amène tous les dieux pour boire le soma, (amène-les), toi Aurore, de l'espace aérien! Assure-nous ainsi la possession de vaches, de chevaux, d'hommes utiles, le prix digne de l'hymne, Aurore!",
   "01.048.13": "Celle dont les flammes rutilantes se sont montrées à notre encontre, que l'Aurore nous donne la richesse comportant toutes choses désirables, pleine d'ornements, facile d'accès!",
   "01.048.14": "Les Voyants antiques qui t'appelèrent à leur aide, pour que tu les favorises, — ó grande, agrée donc (aujourd'hui à nouveau) nos louanges par ta volonté de donner, Aurore, par ton éclatant éclat!",
   "01.048.15": "Aurore, s'il est vrai qu'aujourd'hui tu ouvres par tes rayons les portes du ciel, confère-nous ensuite une large protection contre le loup, con(fère), ó déesse, les jouissances consistant en vaches!",
   "01.048.16": "Mets-nous en contact avec la haute richesse ayant tous les ornements, avec les objets d'offrande, avec le prestige surpassant tout, ó grande Aurore, avec les prix de victoire, ô porteuse des prix!",
   "01.049.01": "Aurore, arrive avec tes (biens) heureux, du haut de l'espace lumineux du ciel! Que t'amènent (les chevaux) roses, vers la maison du détenteur de soma!",
   "01.049.02": "Riche en ornements, facile est le char sur lequel tu as pris place, Aurore. Favorises-en aujourd'hui l'homme de bon renom, ô Fille du ciel!",
   "01.049.03": "Bipèdes, quadrupèdes, jusqu'aux oiseaux ailés, ô blanche, ô Aurore, ils se sont mis en marche selon tes temps fixés, (venant) des confins du ciel.",
   "01.049.04": "Car en luisant au loin, tu as de tes rayons éclairé tout l'espace lumineux. Ainsi, Aurore, les Kaṇva qui aspirent aux richesses t'ont invoquée de leurs chants.",
   "01.089.01": "Qu’ils viennent à nous (avec leurs) énergies bénéf‌iques, de toutes parts, (ces dieux) impossibles à tromper, à circonvenir, (ces dieux) irrupteurs,] les dieux, en sorte qu’ils soient toujours (utiles) à notre croissance, gardiens sans défaillance, jour après jour!",
   "01.089.02": "La faveur bénéf‌ique des dieux est pour ceux qui vont droit : que le don des dieux se détourne (pour aller) dans notre direction ! ] Nous (autres) avons obtenu-on—I’assiégeant l’alliance des dieux. Que les dieux étendent notre durée—de—vie en sorte que nous vivions (plus au loin)!",
   "01.089.03": "Ces(dieux), nous (autres) les appelons par une litanie traditionnelle : Bhaga, Mitra, Aditi, la Force—active immanquable,] Aryaman, Varuna, Soma, les Aévin. Qu(’eux tous, que) Sarasvatî la bénéfique, nous procure(nt) le confort!",
   "01.089.04": "Qu’ainsi le Vent vente pour nous le remède réconfortant, qu’ainsi la Terre mère, le Ciel pére (nous l’apportent) !] Ainsi, les pierres qui pressent le soma, les réconfortantes ! Ainsi, ô Asvin’s, (divinités) prepres à (susciter) l’inspiration, écoutez (moi), vous!",
   "01.089.05": "Ce (dieu Püsan) régisseur du monde—mobile, du monde— immobile, (ce dieu qui en est) le maître, animateur de la pensée (poétique), nous (autres) l’appelons pour qu’il nous favorise] Que Püsan nous soit (utile) pour accroître (nos) acquisitions, lui le gardien, le protecteur impossible à tromper! (Et cela) pour (notre) bien—étre!",
   "01.089.06": "A bien—étre nous soit Indra, de qui le renom a grandi; à bien—étre nous soit Püsan (qui préside à) toutes acquisitions !] A bien-étre nous soit Tärksya dont la jante est infrangible ! Que Brhaspati nous confère le bien—être! '",
   "01.089.07": "(Ces dieux) aux chevaux mouchetée, les Marut, dont la mère est Préni, qui vont (leur marche) de prestige, qui se pressent aux répartitions (de butin),] (et aussi) tous les dieux qui ont Agni pour langue, le soleil pour œil, (qui sont en même temps) des humains : qu’ils arrivent ici pour nous aider !",
   "01.089.08": "Puissions-nous entendre de nos oreilles (une parole) bénéf‌ique, dieux, voir de nos yeux (un spectacle) bénéf‌ique, €) vous qui étes voués au sacrifieel] Puissions—nous, (vous) ayant loués, atteindre avec des membres solides, des corps (intacte), la durée—demie qui a été instituée par les dieux !",
   "01.089.09": "Oui, cent automnes sont devant (nous), Ô dieux : (telle est la durée) en laquelle vous avec fixé l’âge de nos corps,] en laquelle les f‌ils deviennent des pères. Ne lésez pas notre durée—dc—vic au milieu de son cours!",
   "01.089.10": "Aditi est le Ciel, Aditi l’espace—médian, Aditi la mère ; elle est le pére, elle est (aussi) le f‌ils.] Tous les dieux sont Aditi, les cinq (cepéccs) d’hommes sont Aditi ; Aditi est ce qui est né, ce qui est à naître.",
   "01.090.01": "D’une conduite toute droite nous conduise(nt) Varuna, Mitra,lui qui sait (= eux deux qui savent),] (de méme) Aryaman, de concert avec les dieux!",
   "01.090.02": "Ils sont en effet (tous trois) les riches—possesseurs de richesse, ces (dieux) impossibles à dominer—par—violence en raison de leurs pouvoirs.] Ils observent les vœux (divins) en tous points.",
   "01.090.03": "Qu’enx (trois) nous procurent le refuge, à nous mortels, eux immortels, ] refoulant loin (de nous) les hostilités !",
   "01.090.04": "Que dégagent pour nous les chemins, en vue d’une-bonne marche, Indre, les Marut,] Pf‌isan, Bhsga, (tous dieux) dignes d’être célébrée !",
   "01.090.05": "En outre : nos pensées (poétiques), ô Püean, e Vienu qui vas d’un pas (rapide), rendez—lee] propres à culminer en (un don de) vaches, (rendez) nous porteurs de bien—être !",
   "01.090.06": "Les vents (ventent) du miel pour (l’homme) f‌idèle à l’Ordre, (pour lui) les fleuves coulent du miel.] Que les plantes soient pour nous riches en miel ! —",
   "01.090.07": "Miel dans la nuit ainsi qu’à l’aurore! Que l’espace terrestre (devienne pour nous) porteur de miel !] Miel soit pour nous le Ciel pére !",
   "01.090.08": "Que l’arbre de la forêt soit pour nous porteur de miel, le soleil soit porteur de miel !] Que les vaches soient riches en miel pour nous! —",
   "01.090.09": "Hour nous soit Mitra, beur Varuna, beur nous soit Aryaman ! ] Hour nous soit Indre, Brhaspati, beur nous soit Visnu à la vaste enjambée !",
   "01.092.01": "Voici que ces Aurores ont placé leur signal lumineux; sur le côté oriental de l'espace sombre elles se décorent de leur rayon. Fourbissant leurs armes comme des braves, les vaches rougeâtres, les mères, reviennent.",
   "01.092.02": "Les rayons roses ont pris librement leur envol. (Les Aurores) ont attelé les vaches rougeâtres, aisées à atteler. Les Aurores ont mis les marques distinctives selon le mode antique. Rougeâtres, elles ont fixé le rayon rutilant.",
   "01.092.03": "Elles chantent, comme des femmes œuvrant, au cours des travaux; (venues) en un seul et même voyage d'un domaine lointain, véhiculant la jouissance pour l'homme pieux, riche en dons, jour après jour, pour le sacrificateur qui presse (le soma).",
   "01.092.04": "Elle met sur elle des ornements comme une danseuse; elle découvre sa poitrine comme une vache sa mamelle. En faisant la lumière pour l'univers entier, l'Aurore a ouvert les ténèbres comme les vaches (voient s'ouvrir leur) enclos.",
   "01.092.05": "Sa flamme rutilante s'est fait voir à nouveau. Elle s'étend, refoule l'informité noire. Comme (on fixe) le poteau pour les rites, le décorant (d') ornements, la Fille du ciel a fixé son rayon éclatant.",
   "01.092.06": "Nous avons franchi l'autre rive de ces ténèbres. L'Aurore en luisant fait les marques distinctives. Comme un qui veut plaire, elle sourit pour être belle, la brillante au beau visage; elle a incité (les hommes) à une pensée heureuse.",
   "01.092.07": "Conductrice lumineuse des libéralités, la Fille du ciel est louée par les Gotama. Assigne-nous, Aurore, des prix de victoire consistant en enfants, en hommes qualifiés, s'achevant en chevaux, commençant en vaches!",
   "01.092.08": "Aurore, puissé-je atteindre la richesse qui porte distinction, qui consiste en hommes utiles, commençant en esclaves, s'achevant en chevaux! Toi qui brilles d'un renom fait de réussite, ô bienheureuse, toi qui est mue par les prix de victoire, ... (cette) haute (richesse)!",
   "01.092.09": "En dominant du regard toutes les créations, la déesse brille au loin, faisant face à (tout) regard. Éveillant à marcher tout ce qui vit, elle a agréé la parole de tout être inspiré.",
   "01.092.10": "La (déesse) antique, sans cesse renaissante, parée d'une seule et même couleur, qui amenuise - comme un vainqueur habile(amenuise) l'enjeu (adverse) — la durée de vie du mortel en le faisant vieillir...",
   "01.092.11": "En découvrant les bornes du ciel elle s'est éveillée. Elle repousse sa sœur à l'écart. Amenuisant les générations humaines, la jeune femme resplendit par le regard de l'amant.",
   "01.092.12": "Étendant (ses rayons) comme (on étend) le bétail (au pâturage), éclatante, bienheureuse, elle a brillé au loin comme le fleuve (en son) remous. Elle qui n'enfreint pas les ordonnances divines, elle se signale, apparaissant avec les rayons du soleil.",
   "01.092.13": "Aurore, apporte-nous ce (don) éclatant, ô toi qui détiens les prix de victoire! par quoi nous puissions fonder progéniture et descendance.",
   "01.092.14": "Aurore, riche en vaches, en chevaux, resplendissante, fais luire aujourd'hui ici pour nous la richesse, toi qui portes les libéralités!",
   "01.092.15": "Attelle donc, Aurore qui détiens les prix de victoire, tes chevaux roses aujourd'hui! Et charrie vers nous toutes les bonnes chances!",
   "01.106.01": "Indre, Mitra, Varuna, Agni, la troupe mârutienne, Aditi, nous les appelons pour qu’ils (nous) favorisent. ] Comme un char (sortant) d’un mauvais passage, é Vaeu’s riches en dons, faites—nous passer outre à toute étroitesse ( ]détresse) !",
   "01.106.02": "Vous qui étes les Âditya, venez ici pour (nous assurer) l’intégrité, é dieux! Soyez bénéf‌iques pour (nous assurer) le triomphe sur les ennemis !] Comme (etc.).",
   "01.106.03": "Que nous favorisent les Péree, eux qu’on a profit à aœlamer, et aussi les deux déesses (Ciel—féminin et Terre) dont les fils sb‘ilt des dieux, (déesses) invigorées par l’Ordre !] Comme (etc.).",
   "01.106.04": "Narasamsa porteur des prix (de victoire), nous l’impler0ns par des (demandes de) faveurs, l’animant ici même (par nos chants), (ainsi que) Püsan (et Rudra) qui possède des hommes-utiles.] Comme (etc.).",
   "01.106.05": "O Brhaspati, faismoue toujours un heureux passage, pour (notre) beur et prof‌it! C’est ce qui fut institué par l’Homme que nous te demandons. ] Comme (etc.)",
   "01.106.06": "Kutsa le Sage, comprimé dans sa fosse, appelait au secours Indre Destructeur des Résistances, maître des pouvoirs (;ainsi ferai—je). Comme (etc.).",
   "01.106.07": "Qu’Aditi la déesse nous protege avec les dieux! Que le dieu Sauveur (nous) sauve sans défaillance !] Qu’ainsi Mitre,.Varune se montrent—magnifiques pour nous, (ainsi qu’) Aditi, le Fleuve, la Terre et aussi le Ciel!",
   "01.107.01": "Le sacrifice va àla rencontre dela faveur des dieux. O Âditye’s, soyez compatieeants !] Que votre faveur se tourne vers notre bord, celle qui, (pour nous sortant) même de l’étroit, serait le mieux en mesure de (nous) procurer le large !",
   "01.107.02": "Que les dieux approchent de nous par (un acte) de faveur, (puisqu’en ce moment même) ils sont louée par les mélodies (rituelles) des Angiras’ !] Qu’lndra avec les appartenancee—d’lndra, que les Marut avec les (appartenances des) Marut, qu’Aditi avec les Âditya nous accorde(nt) un refuge !",
   "01.107.03": "Qu’ainsi Indre, ainsi Varuna, ainsi Agni, ainsi Aryaman, ainsi Savit1; nous crée(nt) satisfaction !] Qu’ainsi (etc.).",
   "01.113.01": "Voici qu'est arrivée la plus belle, la lumière des lumières; le signal éclatant est né, se diffusant. Comme la Nuit avait été mise en branle pour (répondre) à l'impulsion de Savitr̥, elle a de même cédé la place à l'Aurore.",
   "01.113.02": "Rutilante avec son veau rutilant, radieuse, elle est arrivée. La Noire a cédé ses séjours. De même parenté, immortelles, se faisant suite, les deux (moitiés du) jour procèdent, effaçant (l'une l'autre) leur couleur.",
   "01.113.03": "Commun est le trajet des deux sœurs, illimité: elles le parcourent l'une après l'autre, avisées par le dieu. Elles ne se heurtent ni ne s'arrêtent, elles sont bien fixées, Nuit et Aurore de même cœur, (bien que) de forme diverse.",
   "01.113.04": "Guide lumineux des libéralités, elle s'est montrée: éclatante, elle nous a ouvert les portes. Après avoir poussé en avant le monde animé, elle nous a révélé les richesses: l'Aurore a éveillé toutes les créatures.",
   "01.113.05": "Celui qui couchait en travers, la généreuse (l'incite) à marcher, tel autre à querir la nourriture ou l'argent; à ceux qui ont faible vue, l'Aurore (fait) voir au loin: elle a éveillé toutes les créatures.",
   "01.113.06": "Tel à querir la domination, tel la gloire, tel la grandeur, tel autre à vaquer à ses affaires. Afin qu'ils considèrent les (modes d') existence divers, l'Aurore a éveillé toutes les créatures.",
   "01.113.07": "Cette Fille du ciel s'est fait voir, luisant au loin, jeune femme au blanc vêtement. Toi qui règnes sur tout le bien terrestre, Aurore bienheureuse, luis au loin pour nous aujourd'hui!",
   "01.113.08": "Elle suit le troupeau des (Aurores) passées, elle est la première de celles qui viennent en succession continue, l'Aurore luisant au loin qui anime ce qui vit, (mais) ne réveille jamais celui qui est mort.",
   "01.113.09": "Aurore, que tu aies fait s'allumer le feu, que tu aies lui au loin par le regard du soleil, que tu aies éveillé les humains qui doivent sacrifier: c'est là un beau mérite que tu t'es acquis parmi les dieux.",
   "01.113.10": "A quelle distance est (le point où) elle se trouvera à mi-chemin de celles qui ont lui et de celles qui luiront dorénavant? Elle se conforme, elle mugissante, aux premières; (mais) elle va complaisamment avec les autres, elle prévoyante.",
   "01.113.11": "Ils s'en sont allés les mortels qui virent la toute première Aurore qui luisait. C'est de nous à présent qu'elle se laisse contempler. Et voici qu'arrivent ceux qui la verront dans les temps à venir.",
   "01.113.12": "Refoulant l'hostilité, gardant l'Ordre, née dans l'Ordre, riche de faveurs, suscitant les libéralités, bonne en présages, portant l'invite aux dieux: ici même aujourd'hui, Aurore, luis au loin, toi qui es la plus belle de toutes.",
   "01.113.13": "Sans cesse dans le passé l'Aurore divine a lui au loin; aujourd'hui encore la généreuse a lui au loin, et elle luira au loin le long des jours à venir. Sans vieillir, sans mourir, elle procède selon ses lois propres.",
   "01.113.14": "Avec ses parures elle a brillé dans les portiques du ciel; elle a écarté en luisant le noir vêtement, la déesse. Réveillant (les êtres), l'Aurore arrive avec ses chevaux roses, sur son char aisé à atteler.",
   "01.113.15": "Apportant les prospérités souhaitables, elle place le signal éclatant, elle qui se signale au loin. Dernière des (Aurores) passées, première de celles qui resplendissent en succession continue, l'Aurore a brillé.",
   "01.113.16": "Dressez-vous! L'esprit de vie est venu à nous, les ténèbres s'en sont allées au loin, la lumière arrive. Elle a cédé le chemin pour que le soleil avance. Nous sommes venus au point où (les hommes) prolongent leur durée de vie.",
   "01.113.17": "Par les rênes du discours le guide (des rites), en louant, le chantre suscite les Aurores resplendissantes. Luis donc aujourd'hui pour celui qui chante, ô généreuse! Fais rayonner sur nous une durée de vie riche d'enfants!",
   "01.113.18": "Ces Aurores qui luisent au loin, détentrices de vaches, de tous hommes utiles, donneuses de chevaux pour le mortel adorateur, puisse les atteindre le presseur de soma, quand surgissent leurs libéralités, comme (celles) de Vāyu!",
   "01.113.19": "Mère des dieux, visage d'Aditi, signal du sacrifice, resplendis toi qui est haute! Faisant renommée à notre prière, luis au loin, engendre-nous dans la race (humaine), ô toi qui possèdes toutes choses désirables!",
   "01.113.20": "Le mérite éclatant qu'apportent les Aurores, le beau (mérite) à qui sacrifie et prend de la peine, veuillent Varuṇa et Mitra nous l'assurer, et Aditi et le Fleuve et le Ciel et la Terre!",
   "01.122.01": "O vous rapides en zèle-pieux, présentez votre\" breuvage, le jus (de soma, en guise de) sacrifice a Rudre le Généraux !] Je (l’) ai loué (en cet instant mémo) avec les hommes—d’élite de l’Asuru du ciel, (j’ai loué) les Marut comme (si je voulais) revendiquer (l’empire sur) les Deux Mondes.",
   "01.122.02": "Je veux, pour l’appel matinal, magnifier l’Aurore et la Nuit, pareilles à deux épouses, (déesses) connues au loin :] (l’une) pareille :! une (femme) stérile, vêtue d’un manteau serti (d’étoiles), (l’autre) belle a voir avec ses ore, (c’est—à—dire) avec la beauté du soleil.",
   "01.122.03": "Que nous suivre (le dieu) qui circule autour (du monde), qui frappe de grand matin, (nous) suivre le Vont, (fils) des eaux, (char) pourvu d’étalons !] Aiguisez-nous (par vos dons), ô vous lndre—Parvata! Qu’ainsi tous les dieux nous fassent largesee!",
   "01.122.04": "Et encore : je veux appeler à moi ces deux (divinités) glorieuses, (en sorte qu’) elles invitent (à boire, qu’) elles boivent (elles…mëmee) — moi, fils d’Uéij —, afin (qu’elles signalent) le blanchissement (de la nuit)) Mettez le Fils des eaux en tête de votre (hommage), (mettez) en tête les deux mères du fougueux Âyu!",
   "01.122.05": "Je veux appeler à moi pour vous, moi, fils d’Uëij, le bruyant (thaspati), le Los (incarné), semblable à une rumeur (de guerre), tandis que je reeevrai Arjuna./ (Mettez) en tête de votre (louange) Püsan, af‌in qu’il donne! Je voudrais attirer—par-ma—parole la qualité de vosu (qui est le propre) d’Agni.",
   "01.122.06": "Entendez ces appels de moi, ô Varuna—Mitra, oui, entendez—les de toutes parts au siège (du sacrifice) !] Nous entends celui qui (octroie) la faveur d’être entendu, qui se plaît à entendre, le Fleuve au beau terroir avec (ses) eaux !",
   "01.122.07": "Elle est à louer, cette faveur (venant) de vous deux, ô Varuna, ô Mitra. Aprés avoir reçu (en don) des centaines de vaches chez les Prksayäma,/ chez Pajra, chez Êrutaratha, chez Priyaratha, (les donataires) s’en sont allés aussitôt, mettant—dans—l’enclos (ces vaches, image de leur) prospérité.",
   "01.122.08": "Il est à louer, le bienfait de ce (patron) trés généreux. Puissions-nous gagner ensemble (le butin) de Nabus, (devenant ainsi) riches en hommes—d’élite l/ L’lwmme—du—commun, (tout comme) le patron possesseur de grands prix, m’(ont donné) de la part des Pajra (des attelages) laits de chevaux, faits de chars.",
   "01.122.09": "L’homme aux intentions nocives, ô Varuna-Mitra, qui pressé-le-soma pour vous (, un soma aussi clair) que de l’eau, (l’homme) .aux lourbes nocivités,/ il dépose de lui—même la consumption en son cœur, ————- alors que l’homme possédant l’Ordre a (d’emblée) atteint (son objet) avec les ablutions.",
   "01.122.10": "Celui—là est plus valeureux que le violent Nahus, ayant été mil (comme) par miracle ; sa gloire est chantée par les seigneurs] Il va répandant ses dons, pressant la marche. En tous combats il est toujours un héros.",
   "01.122.11": "Eh bien, vous deux qui venez à l’appel de Naima, (notre) patron, é rois enivrants du principe—demie, entendez] en quoi (consiste) le bienfait de Nabbojü, de Nirava, afin que (moi, le) possesseur du ebar, (le) célèbre avec force!",
   "01.122.12": "En recevant Dasataya, (les donataires) ont dit : voici le patron dont nous voudrions former la cohorte (pareille a celle des Marut) !] Que ceux chez qui se sont complus les prestiges (du pouvoir et) la qualité de veau, que tous (ceux—là) gagnent le prix lors des mises en jeu!",
   "01.122.13": "Nous voulons nous enivrer au breuvage de Datataya, quand les deux fois cinq (doigts de l’officiant) vont apportant les nourritures] Est—ee qu’Istarasmi (et) ces possesseurs de force——triomphante (ne voudront pas) s’elTorcer (de récompenser) les hommes—qualifiés (= les chantres) ?",
   "01.122.14": "(Voici que déf‌ile) la masse-mouvante (du bétail) aux oreilles (chargées) d’or, au cou (chargé) de diamants : que tous les dieux nous en fassent largesse !] Que les êurores, arrivant ici d’un cou;3 pour (répondre) aux paroles de l’Etranger, trouvent plaisir aux deux groupes d’entre nous (patrons et chantres)!",
   "01.122.15": "Les quatre poulains de Masarsära, les trois d’Âyavasa, roi victorieux, m’(ont été offerts en don)] (ainsi que) votre char e Varuna—Mitra, (ce char) au long avant-corps, aux mains (faites) de rênes (/ au brancard fait de rayons), (qui) a resplendi comme le soleil.",
   "01.123.01": "Le vaste char des Honoraires rituels est attelé. Les dieux immortels l'ont monté. Du noir (domaine) a surgi, immense, la noble (dame):  elle qui prend souci pour l'établissement humain.",
   "01.123.02": "Antérieure à toute création, elle s'est éveillée victorieuse, haute, gagnant le prix. (Située tout) en haut, elle a regardé, la jeune femme qui renaît. L'Aurore est arrivée la première à l'appel matinal.",
   "01.123.03": "Si aujourd'hui tu répartis parmi les mortels leur part pour les hommes qualifiés, Aurore divine, ô bien-née, le dieu Savitr̥, maître de la maison, nous proclamera de ce fait exempts de péché à la face du soleil.",
   "01.123.04": "De maison en maison elle va, lascive; de jour en jour, portant ses noms (distinctifs). Cherchant à gagner, la radieuse est venue sans cesse; elle a en partage chaque meilleure (part) des richesses.",
   "01.123.05": "Sœur de Bhaga, jumelle de Varuṇa, Aurore libérale, éveille-toi la première! Que demeure en arrière l'instituteur du mal! Nous voulons le vaincre avec les Honoraires pour char!",
   "01.123.06": "Que les libéralités se dressent, se (dressent) les plénitudes! Les feux se sont levés, flamboyants. Les biens désirables, qui étaient cachés par les ténèbres, — les Aurores resplendissantes les mettent au grand jour.",
   "01.123.07": "L'une (des deux moitiés du jour) s'en va, l'autre arrive; les deux moitiés du jour aux formes adverses circulent ensemble. L'une a fait se cacher les ténèbres des deux domaines environnants. L'Aurore a brillé avec son char flamboyant.",
   "01.123.08": "Les mêmes aujourd'hui, les mêmes aussi demain, elles suivent la longue institution de Varuṇa. Exemptes de blâme, elles achèvent en un jour les trente (durées d') attelage; l'une après l'autre (elles réalisent) le dessein (divin).",
   "01.123.09": "Elle qui connaît le nom du premier jour, la blanche, la blanchissante, est née du noir (domaine). La jeune femme n'enfreint pas l'institution de l'Ordre, quand elle va au rendez-vous jour après jour.",
   "01.123.10": "Comme une fille qui s'enorgueillit de son corps, tu vas, déesse, vers le dieu qui cherche à t'obtenir. Jeune femme pleine de sourires, tu mets à découvert (pour lui) tes seins quand tu resplendis à l'orient.",
   "01.123.11": "Belle d'apparence, comme une jeune femme ornée par sa mère, tu mets ton corps à découvert pour qu'on le voie. Aurore bienheureuse, luis au loin, plus au loin! Les autres Aurores n'atteindront pas ceci de toi.",
   "01.123.12": "Elles qui possèdent chevaux, vaches, toutes choses souhaitables, qui marchent en rang avec les rayons du soleil, elles s'en vont el reviennent, les Aurores qui portent des noms bienheureux.",
   "01.123.13": "Toi qui suis à la trace le rayon de l'Ordre, place en nous un dessein toujours plus heureux! Aurore aisée à invoquer, luis au loin pour nous aujourd'hui! Et qu'à nos patrons soient (en partage) les richesses!",
   "01.124.01": "L'Aurore en luisant, tandis que le feu s'allume, le soleil qui se lève, ont fixé leur lumière au loin. Voici donc que le dieu Savitr̥ a incité notre (gent) bipède et quadrupède à aller (chacun) vers ses affaires.",
   "01.124.02": "Elle qui n'enfreint pas les ordonnances divines, qui amenuise les générations humaines, l'Aurore a brillé au loin, la plus proche parmi celles qui ont passé se succédant continûment, la première parmi celles qui viennent.",
   "01.124.03": "Voici la Fille du ciel. Elle s'est fait voir, revêtue de lumière, (toujours) la même, à l'orient. Elle suit régulièrement le chemin de l'Ordre; comme une qui sait, elle n'enfreint pas les directions de l'espace.",
   "01.124.04": "Sa poitrine se laisse voir comme celle de la courtisane; comme Nodhas elle a découvert ses (appas) aimés; comme une mouche, éveillant ceux qui dorment, elle est arrivée la première de celles qui en succession indéfinie sont revenues.",
   "01.124.05": "Sur le côté oriental de l'espace sombre, hors de portée, la Génitrice des vaches a placé son signal lumineux. Elle s'étend au loin, plus au loin, plus au large, emplissant le giron de ses parents.",
   "01.124.06": "Ainsi se laisse-t-elle voir, la première entre beaucoup. Elle n'évite ni l'étranger, ni l'affine. S'enorgueillissant de son corps immaculé, elle ne fuit ni devant le petit ni devant le grand, la resplendissante.",
   "01.124.07": "Comme (une fille) sans frère, elle va à l'encontre des mâles. Elle est comme celle qui monte sur le tréteau pour gagner de l'argent. Elle est comme la femme consentante pour l'époux; l'Aurore, bien vêtue, fait glisser sa poitrine comme une femme légère.",
   "01.124.08": "La sœur a cédé la place à la sœur aînée; elle s'écarte de celle-ci comme une qu'on doit revoir. Luisant au loin avec les rayons du soleil, elle s'enduit de fard comme les femmes allant au rendez-vous.",
   "01.124.09": "De ces sœurs précédentes, au cours des jours elle, la plus proche, rejoint par derrière la précédente. Puissent ces Aurores plus nouvelles nous donner désormais en luisant, comme autrefois, la richesse, les belles journées!",
   "01.124.10": "Éveille, Aurore généreuse, les donateurs! Que les avares s'endorment pour ne plus se réveiller! Donne en luisant la richesse aux généreux, toi-même généreuse, la richesse au laudateur, toi libérale qui éveilles (les humains)!",
   "01.124.11": "Cette jeune femme a brillé vers (la terre), à l'orient; elle attelle la lignée des vaches roses. Qu'elle luise au loin désormais, que son signal lumineux soit en évidence! Que le feu soit disposé de maison en maison!",
   "01.124.12": "Les oiseaux eux-mêmes se sont envolés de leur nid à ton éclairement, ainsi que les hommes qui ont part à la nourriture. A celui qui reste à la maison tu apportes un bienfait abondant, divine Aurore, au mortel qui t'adore.",
   "01.124.13": "Vous avez été louées (par moi), vous dignes de louange, vous avez été invigorées par mon hymne, Aurores consentantes: avec votre assistance, ô déesses, puissions-nous gagner un prix de victoire qui consiste en mille et en cent!",
   "01.139.01": "Soit! Qu'on écoute! Je place Agni en tête (de  mon hommage) grâce  à  (mon)  inspiration.  Oui,  nous  voulons-par-faveur  cette cohorte  céleste  (des  Marut),  nous  voulons-par-faveur  Indra-Vayu./ Depuis  qu'une  (inspiration)  toute  nouvelle  a  été  activement  connectée  à  Vivasvant,  (comme)  par  som nombril / alors, que s'avancent  nos  pensées,  comme  en  direction  des  dieux, vers (eux, nos)  pensées !",
   "01.139.02": "Depuis,  ô  Varuna-Mitra,  que  vous  avez  placé  ainsi  le  Désordre  hors  de  l'Ordre,  grâce  au  zèle  propre  de  l'Efficace,  grâce  à (son)  zèle  propre,/  dorénavant  nous  avons  vu  da.ns  vos  à tous  deux  (le  trône)  d'or,/  (nous  ne  l'avons  vu  il  est  vrai)  en intuition,  en  pensée,  grâce  aux  propres  yeux  de  Soma,  grace  à (ses)  propres yeux.",
   "01.139.03": "Les  Âyu  qui  vous  adorent  par  les  louanges,  ô  Asvin's,  qui font  entendre,  dirait-on,  le  cri-rituel,  (ils  vous  invitent)  pour  les oblations  eux les  Ayu./  En vous  deux  (résident)  toutes  gloires  et (toutes)  forces-comblantes,  ô  (dieux  jumelés)  qui  avez  toute connaissance. / Les jantes dégouttent (de  miel)  sur votre char doré, ô  (dieux)  miraculeux,  (sur votre  char)  doré.",
   "01.139.04": "(L'aurore)  s'est  montrée,  ô  (dieux) miraculeux. Vous  [duel] ouvrez la voûte-céleste. (Les chevaux) attelés à votre char s'attellent pour  les  rites  du  jour,  (ces  ani1naux)  dénués  de  soullure pour  les rites  du  jour./  Votre  place-debout  est  dans  le  caisson,  o  (dieux) miraculeux  sur le  char doré,/ vous  qm,  tels  deux  (hommes)  allant sur la  route, indiquez  l'espace tout au  long,  indiquez l'espace  tout droit.",
   "01.139.05": "Gratifiez-nous [duel] de pouvoirs jour et nuit, Ô vous riches en pouvoirs!/ Que votre faveur ne tarisse jamais à mon égard, (votre) faveur jamais !",
   "01.139.06": "O taureau Indra, ces gouttes que voici (qui sont elles-mêmes) un breuvage de taureau, - puissent—elles, une fois pressées, pressées entre les pierres, irruptives, pressées pouri toi, irruptives,/ t’enivrer, elles, en sorte que tu donnes un grand, un éclatant bienfait! / Toi que véhiculent les paroles, une fois loué par (nos) paroles arrive ici, en (dieu) compatissant, arrive à nous !",
   "01.139.07": "Entends—neus donc, ô Agni ! Une fois invoqué tu pourras dire aux dieux dignes du sacrifice, aux rois dignes du sacrifice :/ depuis que vous avez donné cette vache—laitière, o dieux, aux Angiras’,/ Aryaman (ainsi que) l’officiant (et autres) l’ont traite-à—fond : ce (dieu) sait qu’elle est avec moi.",
   "01.139.08": "Puissent ces actes—mâles ne pas devenir périmés de notre fait, ces exploits—prestigieux qui sont vôtres, puissent-ils ne pas vieillir par notre carence, ne nas vieillir !] (La parole) éclatante, qui résonne pour vous d’âge en âge, (la paroîe toujours) nouvelle, immorteile] et impossible à vaincre, (mettez-) la en nous, conserves (—la nous), ô Marut, (cette parole qui est) aussi impossible à vaincre ?",
   "01.139.09": "Dadhyañc, le plus ancien Añgiras’, Priyamedhà, Kanva, Atri, Manu, ceux—là savent ma naissance; eux les plus anciens, Manu (et autres,) savent ma (naissance). ] il y a une continuité entre eux (et) les dieux ; il y a des pamntés—ombilioales entre nous (et) eux.] Grâce au point-d’appui (que j’ai) en eux, je courbe à moi, puissamment, Indra-Agni avec (Ina) parole, je les courbe avec (ma) parole.",
   "01.139.10": "Que l’oblateur dise la yâjycî:‘ Que ceux qui veulent gagner gagnent ce qu’ils souhaitent! Brhaspati, le Voyant, dit la ydjycî avec les (prêtres—)taureaux pleins de faveurs, avec les taureaux. ] Nous avons perçu le cri dont l’avertissement (porte) au loin, (celui) de la pierre-presseusc, (nous l’avons perçu) de nous—mêmes.](Le dieu) au bon conseil a institué les (...), les nombreux séjours, (ce dieu) au bon conseil.",
   "01.186.01": "Vienne à nous pour la séance-sacrificielle, (suscité) par les invocations, par l'culogic, Je dieu Savitr possédant toutes forcesvitales !/ (Qu'il vienne) vers le monde entier, quand (tombe) le soir, avec }'Inspiration, en sorte que vous vous réjouissiez pournous, ô jeunes (divinités)",
   "01.186.02": "Qu'arrivent à nous tous les dieux agrégés, (particulièrement) Mitra, Aryamai;i, Varui;ia de concert,/ en sorte que tous soient facteurs-de-croissance pour nous, rendent (toutes choses) faciles à vaincre comme une force vacillante !",
   "01.186.03": "Je vais chanter par des récitabons votre hôte le plus aimé, Agni, en l'associant, (à d'autres dieux), moi qui vise à l'emporter (sur mes concurrents),/ en sorte que la bonne louange soit pour nous (comme) Varui;ia; et qu' (Ag·ni), patron célébré par !'Étranger, mette le comble à nos jouissances !",
   "01.186.04": "Je m'approche de vous avec hommage en (mon) désir de vaincre. Aurore et Nuit (qui êtes) pareilles à une vache-laitière facile à traire,/ moi qui en un même jour mesure le chant (en strophes rythmées ; chant semblable à ce) lait de forme distincte (que donnent ces divinités jumelées) en une même mamelle.",
   "01.186.05": "Et encore : qu 'Ahi abyssal nous fasse confort ! Le Fleuve agrée (notre louange) comme (la vache) aux mamelles-g·onflées (agrée) son petit,/ en sorto que (par cette louange) nous mettions en branle le Fils des eaux, celui que véhiculent les taureaux mùs par la pensée.",
   "01.186.06": "Et encore : qu'arrive vers nous Tvastr avec les patrons, de concert (avec les dieux), quand (tombe) le soir!/ Puisse arriver vers nous ici même Indra, Destructeur des Résistances, combleur des populations, le plus valeureux des seigneurs !",
   "01.186.07": "Et encore : nos pensées-poétiques dont l'attelage (est fait de) chevaux (lèchent Indra), telles des vaches (qui) lèchent leur petit en bas âge./ Les mélodies, telles des femmes (qui seraient) des épouses, s'approcl1ent-amoureusement de lui, le plus agréable à embrasser d'e11tre les seigneurs.",
   "01.186.08": "Et encore : que les Marut à l'armée puissante prennent place avec Rodasl, (qu'ils soient) de même coeur,/ eux aux chevaux mouchetés, (de qui) les chars sont pareils à des rivières, eux qui veillent sur !'Étranger, tels les dieux [les Aditya] liés par contrat.",
   "01.186.09": "(Je les place) en tête (de ma louange) lorsqu'ils se montrent avec leur puissance ; en avant ils attellent l'avant-train, (incités qu')ils (sont) par l'eulogie,/ alors que leurs flèches (/ averses) arrosent toute cavité, (eux surgissant soudain) telle la foudre en un ciel clair.",
   "01.186.10": "Mettez en tête (de la louange) les Asvin afin qu'ils (nous) favorisent, en tête Pü~ai;t, car (ces divinités) sont fortes par ellesmêmes,/ Vi~i;tu qui exclut l'inimitié, Vata, l}bhuk~ai;t : puissé-je tourner à moi les dieux pour (qu'ils me confèrent) leur bienveillance !",
   "01.186.11": "Que ce poème-ci vous (incite) et à nous combler, (dieux) dignes du sacrifice, et à nous faire siéger (parmi vous),/ (ce poème) qui prend rang (dans la compétition) pour (nous permettre d'obtenir la faveur des) dieux, qui vise à la richesse ! - Puissions-nous atteindre la prospérité, (sous la forme d') un cercle (d'admirateurs) aux dons vivaces !",
   "02.029.01": "O Âditya's qui portez les voeux (cosmiques), (dieux) fertiles, faites que le péché soit loin de moi comme (est loin de son petit la femme) qui accouche en secret!/ Vous qui entendez, ô Varui;ta, ô Mitra (et autres) dieux, je vous appelle pour (obtenir votre) faveur, moi qui sais cc qui est bénéfique.",
   "02.029.02": "Vous êtes, dieux, la pré1no11ition, vous êtes la force-redoutable; vous, écartez loin (de moi) les choses hostiles!/ Vous les indulgents, et ayez indulgence (en général) et aujourd'hui même prenez pitié de nous ainsi qu'à l'avenir !",
   "02.029.03": "Que pourrio11s-nous faire d'une amitié future avec vous, ô Vasu's, (d'une a1nitié) ancienne (, si vous ne nous aidez pas aujourd'hui)?/ Vous, ô Varu,ia-Mitra, et toi, ô Adili, ô Indra) Vlarut's, conférez-nous le bien-être !",
   "02.029.04": "Allons, dieux, vous qui êtes vraiment des amis, ayez pitié de moi qui souffre ! / Que (notre) char tirant avec un nombre moyen (de bêtes d'attelage) ne soit pas privé de vous! Ne nous lassons pas quand (nous avons) des amis tels que vous !",
   "02.029.05": "C'est moi seul qui vous ai abusés (par) un péché multiple,  (en conséquence) de quoi vous m'avez châtié comme le père (châtie   son fils) joueur./ Au loin (demeurent vos) entraves, au loin les    malheurs, dieux! Ne me saisissez pas en (la personne de mon) fils, comme (on saisit) un oiseau (en s'emparant de ses petits)!",
   "02.029.06": "Soyez aujourd'hui tournés vers moi, (dieux) dignes du sacrifice ! Puissé-je me cacher en votre coeur, moi qul ai peur !/ Dieux, sauvez-nous du loup, d'être dévorés (par lui), sauvez(-nous) de la fosse, de tomber (dans elle), vous dignes du sacrifice!",
   "02.029.07": "Puissé-je moi-mê1ne, ô Varul).a, ne pas trouver l'absence d'un donateur aimé, d'un ami aux présents abondants l/ Puissé-je, ô roi, ne pas être en retrait de la richesse heureuse à régir! Puissions-nous parler haut, lors de la répartition (sacrificielle), (avec) les hommesd'élite  (dont nous disposons)!",
   "02.031.01": "Favorisez notre char, ô Varui:ia-Mitra, vous concertant avec les Àditya, les Rudra, les Vasu,/ quand (les guerriers/ chantres) s'élancent comme (volent) les oiseaux hors du nid, avides de renom, excités (à la compétition), siégeant dans le bois r = dans le char/ dans le cuveau de soma].",
   "02.031.02": "Ainsi donc, distinguez-par-votre-faveur notre char, dieux qui (agissez) de concert, (en sorte qu'il) obtienne le prix par-dessus les tribus,/ quand (les chevaux) véloces, traversant l'étendue avec leurs arrière-trains, frappent-à-coups-redoublés sur le dos de la terre avec leurs sabots(-d'avant-train) !",
   "02.031.03": "Et encore : que cc-célèbre Indra (qui règne) sur toutes les populations, (le dieu) au bon conseil, avec la cohorte mârutienne du ciel,/ se tienne au flanc de (notre) char avec ses aides abolisseurs d'ennemis, en sorte que (nous gagnions) le grand gain, le gain du prix-de-victoire !",
   "02.031.04": "Et encore : que cc-célèbre dieu farceur de l'univers, Tva~~r, de concert avec les femmes (divines), incite-à-la-vitesse (notre) char!/ (Que fassent de même) Ija, Bhaga, Brhaddiva et aussi les Deux Mondes, Pi'i~a1,1, Puraiμdhi, les Asvin (qui sont) vraiment les deux époux (de Si'irya) !",
   "02.031.05": "Et encore : ces deux-célèbres déesses bienl1eureuses qui se montrent alternativement, Aurore et Nuit, incitatrices des êtres mobiles, (je les loue),/ alors même que je vous loue vous deux, Terre (et Ciel), par une parole toute nouvelle et que (je tâche) d'étendre sous (moi) la vigueur tri-vigorante de l'être-immobile.",
   "02.031.06": "Et encore : vous voulons pour vous une récitation comme (font) les Usij : Ahi abyssal et aussi Aja Unipède,/ Trita, l~bhuk9ai;i, Savitr, le Fils des eaux entraineur de coursiers, onL été satisfaits de (notre) acLe-poétirjllC, de (notre) effort-rituel.",
   "02.031.07": "(Les chances énoncées par) ces (paroles ici) présentées, je veux qu'elles vous (adviennent, dieux) dignes du sacrifice. Les Ayn ont façonné ensemble (ces paroles) pour (en faire) un nouveau (poème)./ Eux avides de renom, eux qui aspirent à un prix, (puissent-ils accéder au prix du) poème, comme accède (au but) l'attelage du char!",
   "03.054.01": "Cet hymne (que voici, les poètes) l'ont présenté au grand (Agni, dieu) aITecté aux répartitions-rituelles, digne d'être invoqué sans cesse./ Qu'il nous cnLcndei a\\rec ses visages domestiques, Agni (nous) entende avec (ses visages) célestes, (ce dieu) inépuisable!",
   "03.054.02": "Je veux chanter un grand (hymne) au grand Ciel, à la (grande) Terre. Mon désir va cherchant, prévoyant :/ c'est en effet dans la louange de ces deux (divinités) que les dieux pleins de respect se réjouissent lors des répartitions, en compagnie d'elles deux.",
   "03.054.03": "Que votre ordre, ô Deux Mondes, devienne réalité ! Prenez les devants afin (d'obtenir) pour nous un grand, un heureux passage !/ Tel est l'hommage que je rends au Ciel, à la Terre, ô Agni. Par la satisfaction (que représente mon offrande), j'implore (d'eux) un trésor.",
   "03.054.04": "Et encore : (les chantres) d'autrefois, à la parole véridique, trouvèrent audience près de vous, ô Deux lVIondcs possédant !'Ordre./ Les seigneurs eux-mêmes vous ont célébrées dans la mêlée, dans (la lutte des) héros pour le gain, ô Terre (et vous, Ciel féminin), trouvant audience (près de vous).",
   "03.054.05": "Qui sait en vérité, qui pourrait révéler ici-bas quel chemin concourt en direction des dieux?/ On (ne) voit d'eux (que) les séjours les plus bas, (non) ceux qui sont dans (le domaine) où règnent) les ·voeux lointains, cachés.",
   "03.054.06": "Le poète (habitué à) voir les seigneurs a aperçu ces (deux divinités féminines) jouissant au siège de !'Ordre, (siège) écarté./ Elles ont fait leur résidence de façon distincte, comme l'oiseau, (tout) en s'accordant par une pensée-force commune.",
   "03.054.07": "Séparées (l'une de l'autre) d'un cours-égal, loin (l'une de l'autre) par les extrémités, elles se tiennent-pour-toujours, vigilantes, sur des assises solides./ Bien qu'étant deux jeunes soeurs, elles n'en sont pas moins appelées (par) des noms sexués.",
   "03.054.08": "Ces deux ( di\\rinités) embrassent tous les engendrements ; (tout) en portant les grands dieux, elles ne vacillent pas./ (Mais) une-seule chose gouverne ce qui se meut {et) ce qui est immobile, tout (ce qui existe, aussi bien) cc qui marche (sur terre et) ce qui vole, (cc qui naît) divers (et) ce qui se diversifie une fois né.",
   "03.054.09": "De longue date j'ai accès à (cette chose Une,) antique, (venue) de loin : (elle exprime) la parenté-consanguine de nous avec Je père le gTand géniteur,/ quand les dieux laudateurs (de la chose Une), scion leur comportement (naturel), se tenaient sur le vaste chemin séparé, dans l'intervalle (entre la chose Une et le monde humain).",
   "03.054.10": "Telle est la louange que je profère, ô Deux Mondes. Que l'entendent (les dieux) au coeur tendre, qui ont Agni pour langue,/ Mitra, Varm.ia (et autres) souverains jeunes, Âditya's (qui sont) des poètes (dont Je renom) s'étend au loin.",
   "03.054.11": "Savitr à la main d'or, à la belle langue, qui trois fois par jour règne sur le sacrifice, -/ ô Savitr, s'il est vrai que tu as dressé (ton) signal-auditif pour (appeler) les dieux, alors suscite pour nous l'intégrité (des biens) !",
   "03.054.12": "Le dieu aux bons actes, à la bonne main, bien secourable, possédant !'Ordre, (à savoir) Tva~tr, qu'il nous confère ces (biens) pour faveur!/ 0 J.î.bhu's, réjouissez-vous en compagnie de PuqaI) ! Vous avez façonné l'aire-sacrificielle (en mettant) les pierrcspresscuses bien droites.",
   "03.054.13": "Les Marut aux chars (faits) d'éclairs, pourvus de lances, les cadets du ciel, nés de !'Ordre, infatigables,/ (ainsi que) Sarasvatl (et autres dieux,) qu'ils entendent (notre prière, eux qui sont) dignes du sacrifice ! Conférez(-nous) la richesse comportant des hommes-d'élite, (dieux) vigoureux!",
   "03.054.14": "Vers Viëi;iu le très merveilleux sont venus les chants, les récitations, comme (s'ils se rendaient) à la marche de Bhaga le victorieux,/ (Vië1.iu, ce) géant à la vaste enjambée, dont maintes femmes (forment l'escorte) : (ces) jeunes femmes (en effet), (ces) génitrices ne (le) laissent pas en plan.",
   "03.054.15": "Indra qui dispose de toutes les forces-en-hommes-d'élite a empli les Deux Mondes avec puissance,/ lui le briseur de forts, le Destructeur des Résistances aux armées l1ardics - : apporte-nous, les ayant saisies ensemble, mainte (Lête) de bétail!",
   "03.054.16": "Les Nasatya, interrogés sur leur parenté, (se reconnaissent connr1e étant) mes parents : la co1nmunauLé-de-naissance avec les Asvin est un nom plaisant./ Vous deux, n'est-ce pas, êtes donneurs de ricl1esses, (donneurs) des richesses pour nous. Vous conservez (l'habitude du) don sans mesquinerie, ô (Asvin's) impossibles à tromper!",
   "03.054.17": "Grand, ô poètes (l~bhu's), est ce nom plaisant (qui) vous (caractérise, nom consistant en ce) que vous êtes tous en Indra./ T'associant aux ~bhu aimés, ô toi (Indra) tant invoqué - façonnez- nous (tous ensemble) ce poème afin que (nous) gagnions (le prix)!",
   "03.054.18": "Aryamal), Aditi (et autres dieux), dignes du, sacrifice, (empêchez-) nous - : impossibles à tromper sont les (ordonnances) de Varul)a (en forme de) voeux -,/ empêchez-nous d'accéder à la privation de descendance! Que notre cours (de vie) soit riche en progéniture, en bétail !",
   "03.054.19": "Qu'(Agni,) messager des dieux, multiplement sollicité, nous déclare exempts de mal tous tant que nous sommes !/ Que nous entende(nt) la Terre, le Ciel ainsi que les Eaux, le Soleil avec les constellations, le vaste Espace-médian !",
   "03.054.20": "Que nous entendent. les Montagnes (semblables à des) taureaux, aux assises solides, qui s'enivrent de l'offrande-liquide !/ Nous entende Aditi avec les Âditya ! Que les Marut nous accordent un refuge bienl1eureux !",
   "03.054.21": "Que le chemin soit toujours bien praticable, riche en nourriture ! Dieux, mélangez les plantes avec du miel !/ 0 Agni, puisse Bhaga ne pas me faire défaut en alliance ! Puissè-je accéder au siège de la richesse abondante en bétail !",
   "03.054.22": "Goùte les oblations, illumine ensemble les jouissances à notre intention, mesure (-nous) ensemble les renommées!/ Tous ces ennemis, ô Agni, vainc-les dans les batailles ! Illumine pour nous toutes les journées, (te montrant ainsi) bien disposé !",
   "03.055.01": "Quand les premières aurores luisaient, la grande (chose,) le Verbe prit naissance sur le lieu de la Vache./ Corroborant ainsi les voeux des dieux, (je proclame : ) grand est des dieux le pouvoirasurien, l'unique (pouvoir).",
   "03.055.02": "Puissent donc les dieux ne pas se fourvoyer à ce sujet (vis-à vis de) nous, 11011 plus, ô Agni, les premiers Pères, eux qui savent le lieu!/ (Ton) signal (,ô Agni,) est entre les deux séjours des deux (Mondes) antiques. Grand (etc.).",
   "03.055.03": "Mes désirs volent di .. versement, en tous sens. Grâce à l'effortrituel, j'ai eu l'intuition des premières (Institutions)./ Quand Agni s'enfla1nme, c'est alors que nous entendons exprimer l'Ordrc. Grand (etc.).",
   "03.055.04": "(Agni), roi commun (à tous les êtres), diversement réparti en 1naint endroit, repose dans (ses séjours de) repos, s'abandonnant à lui-même le long des bois (de friction)./ Une autre (que sa mère) porte le veau (nouveau-né), la mère (clic-même) réside (immobile). Grand (etc.).",
   "03.055.05": "Résidant (lui-même) dans les (plantes) anciennes, croissant le long des (plantes) futures, (Agni) est d'un coup au dedans des (plantes) nouvclle(-ment) nées./ Enceintes (de lui), elles enfantent sans avoir été fécondées. Grand (etc.).",
   "03.055.06": "(Lui) qui gisait (d'abord) dans le domaine-au-delà, voici maintenant qu'(Agni) aux deux mères, (cc) veau unique, marche sans liens. /Tels sont (les effets visibles des) voeux de Mitra, de Varul)a. Grand (etc.).",
   "03.055.07": "(Agni) aux deux mères, oblateur, (est) souverain dans les sacrifices; (tandis que) l'avant-train se meut le long (des formes), le fondement repose (immobile)./ Les (officiants) aux paroles agréables (lui) présentent des (offrandes) agréables. Grand (etc.).",
   "03.055.08": "On a vu-toujours tout venir à la rencontre (d'Agni), comme (à celle) d'un héros qui combat en corps à corps./ La penséepoétique se meut dans l'intervalle afin d'accomplir (le dessein de) la Vache. Grand (etc.).",
   "03.055.09": "(Agni,) messager grisonnant, fonce sur ces (femelles). Le grand marche avec (sa) lumière au-dedans (d'elles)./ Portant rlr.s formes-prestigieuses, il nous observe. Grand (etc.).",
   "03.055.10": "Visnu le pâtre garde le pâturage suprême, instituant les institutions aimées, immortelles./ Agni con11aît toutes ces essences. Grand (etc.).",
   "03.055.11": "Les jumelles (Aurore et Nuit) se sont lait des couleurs prestigieuses de manière distincte : l'une des deux (couleurs) brille, l'autre est noire./ La (Nuit) sombre et (!'Aurore,) qui est rose, sont deux soeurs. Grand (etc.).",
   "03.055.12": "Là où la mère et la fille [ ~ le Ciel féminin et la Terre], les deux \\Taches miraculeusement bonnes à traire se laissent téter (par leur veau urnque, Agni-Soleil), (agissanL d')un commun accord,/ - elles deux (sont) au sièg·e de !'Ordre : je les invoque dedans (ce lieu même). Grand (eLc.).",
   "03.055.13": "(L'une des deux,) léchant le veau de l'autre, a mugi. A travers quelle existence la vache a-t-elle caché son pis ? /C'est là l'oflrandcliquide (qui) a g'Ol1flé du laiL de !'Ordre (sacré). Grand (etc.).",
   "03.055.14": "(L'Aurore) sise aux pieds (du cosmos) se revêL de multiples couleurs-presLigicuscs; (une fois arrivée) en haut, elle se tient léchant avec force (le veau-Soleil) âgé de trois semestres./ .Je circule, moi qui sais, dans le siège de !'Ordre. Grand (etc.).",
   "03.055.15": "(Aurore et Nuit) sont comme deux traces-de-pas merveilleuses, mises-en-place dedans (le cosmos). L'une de ces (traces) est cachée, l'autre manifeste./ Leur route (converge) vers un but commun, (et pourtant) elle (va) dans des sens distincts. Grand (eLc.).",
   "03.055.16": "Que les (nuages, tels des) vaches-laitières arrivent en bruissant, (vaches) qui, (tout) en étant sans petits, donnent miraculeusement du lait, inépuisables, jamais traites à fond,/ sans cesse nouvelles, elles qui sont (toujours) jeunes! Grand (etc.).",
   "03.055.17": "Pendant que le taureau (Parjanya) mugit-avec-force parmi les unes (vaches), c'est dans un autre troupeau qu'il dépose sa semence./ Car il est le protecteur de la terre, il est (le dieu) Fortune, il est le roi. Grand (etc.).",
   "03.055.18": "La possession de beaux chevaux (est le fait) du héros (Indra) : nons allons donc la proclamer, ô gens ! Les dieux la connaissent./ Attelés de six manières, cinq par cinq, (les chevaux célestes le) conduisent. Grand (etc.).",
   "03.055.19": "Le dieu Tva9tr, (qui n'est autre qu'un) Savitr à toutes formes, a lait fleurir les créatures, il les a eng·endrées multiplemenL./ Et toutes ces essences que voici sont siennes. (Grand (etc.).",
   "03.055.20": "Il a mis en branle les deux grandes (divinités : Ciel et Terre) conjoinLcs, les deux cuves, l'une et l'autre étant bourrées de trésor(s) par lui./ On l'appelle le (sur)hommc, celui qui découvre des trésors. Grand (etc.).",
   "03.055.21": "Et cette Terre nôtre, (Agni ?) y réside, (le dieu) tout-nourricier, tel un roi qui a cdnclu un pacte,/ tels des guerriers installés en avant(-gardc), installés à l'abri. Grand (etc.).",
   "03.055.22": "Sont porteuses d'accomplissements pour toi les plantes ainsi que les eaux. 0 Indra, la terre porte pour Loi la richesse./ (En qualité d')associés, puissions-nous avoir part à tes (dons) gracieux! Grand (etc.).",
   "03.056.01": "Ni les (êtres) artificieux ni les sages ne contrecarrent les voeux des dieux, ces premiers (voeux,) immuables./ Les Deux Mondes inaccessibles au dol (ne peuvent être trompés) par des (faux) savoirs, non plus que les inontagnes qui se tiennent-debout ne sauraient être courbées.",
   "03.056.02": "L'un porte six charges, sans (toutefois) se mouvoir. Les Vacl1es se sont avancées ''ers !'Ordre é1ninent-entre-tous./ Les trois terres se tiennent-toujours au-dessous, les cavales : deux (d'entre clics) ont été déposées en (un lieu) secret, l'une [~la troisième] est visible.",
   "03.056.03": "Le taureau ViSvarUpa a trois ·ventres et encore, trois mamelles1 lui qui possède multiplement une progéniture./ (Avec) ses trois visages, il règne (en prince) majestueux : il est le taureau donneur de sperme pour (les vaches) qui se-succèdent-indéfiniment.",
   "03.056.04": "Tout d'un coup s'est éveillé le (dieu) Frayeur de voie pour ces (eaux). J'ai appelé (au seconrs) ·Je nom plaisant des Âditya./ Les Eaux elles-mêmes, les divines, se sont arrêtées devant lui : marchant séparément, elles lui ont cédé le pas.",
   "03.056.05": "Trois fois trois sont, ô Fleuves, les séjours-com1nuns des poètes, ainsi qu'(Agni, fils) aux trois mères) souverain dans les sacrifices./ Trois sont les jeunes femmes possédant ]'Ordre, (déesses) des eaux, qui trois fois par jour président au sacrifice.",
   "03.056.06": "Trois fois par jour, ô Savitr, suscite-nous des choses dignes de choix, jour après jour trois fois de la journée !/ Triplement suscite(-nous) richesses (et) trésors, ô Répartiteur, ô Sauveur, ô Dhi~ai;ia, emploie-toi afin que (nous) gagnions !",
   "03.056.07": "Trois fois par jour Savitr suscite-avec-force (les êtres et les biens) : Varui;ia-Mitra, mis aux belles mains./ Les Eaux mêmes, même les Deux vastes Mondes implorent de lui, Savitr, un trésor, pour qu'il (le) suscite.",
   "03.056.08": "Trois fois (répartis sont) les domaines-lumineux les plus hauts, difficiles à atteindre. Trois fils-adultes de l'Asura (y) règnent./ Que trois fois par jour les dieux possédant ]'Ordre, efficaces, difficiles à tromper, soient (présents activement) pour le sacrifice !",
   "03.057.01": "Celui qni discerne a découvert mon poème-inspiré, (poème semblable à une) vache-laitière allant (paitre) sans gardien, livrée à elle-même./ C'est cette (vache) qui, d'un seul coup, a donné pour lait une abondance de coulée (poétique). Indra, Agni (et autres dieux) sont pour cela ses laudateurs.",
   "03.057.02": "Indra donc, Pi'iëal), les (dicux-)taureaux aux belles mains, une fois satisfaits, ont donné un lait inépuisable, tel (le JaiL) du ciel./ Quand tous les dieux se complaisent en cette (vache), puissé-je en l'occurrence rencontrer ·votre prédilection, ô Vasu's !",
   "03.057.03": "Les (soenrs) germaines [~les doigts de l'officiant] qui recherchent la force-active du taureau (Agni) reconnaissent en lui le nouveau-né, (lui) rendant hommage./ Vers lui (leur) fils, les vaches-laitières, mugissantes, se dirigent avec force, (vers lui) qui porte des formes-prestigieuses.",
   "03.057.04": "Je m'adresse aux Deux Mondes bien érigés, en attelant pour le cursus-rituel les pierres-presseuses (de soma), d'une penséeinspirée./ Et voici tes (flammes, ô Agni,) riches en faveurs pour l'J-Iomn1c, se dressant belles à voir1 dignes du sacrifice.",
   "03.057.05": "Ta langue qui est riche en miel, en sagesse, ô Agni, qui se fait entendre chez les dieux, (car) elle vise au large,/ avec elle ici-même fais asseoir tous (les dieux) dignes du sacrifice, pour qu'ils (nous) favorisent, et fais leur boire les miels !",
   "03.057.06": "Ta prévoyance, ô Agni, - en sorte qu'elle gonfle intarissable( mcnt) tel le torrent de la montagne, dieu, (ta prévoyance) éclatante,/ donne-nous la, ô Jatavedas, ô Vasu, (sous forme d')une faveur propre à tous les humains !",
   "03.061.01": "Aurore, ô toi qui détiens le prix de victoire par le prix de victoire, toi qui comprends, agrée la louange du chantre, ô généreuse! Antique et (pourtant) jeune, ô déesse, (en qualité de) Plénitude tu procèdes selon l'ordonnance (divine), toi qui as toutes choses désirables.",
   "03.061.02": "Aurore divine, resplendis immortelle! Toi qui as un char brillant, qui suscites les libéralités. Que t'amènent ici les chevaux faciles à guider, dont la masse est large, toi dont la couleur est celle de l'or!",
   "03.061.03": "Aurore, toi qui fais face à toutes les créatures, tu te tiens debout, signal lumineux de l'immortel. Traçant ta marche vers un but (toujours) le même, tourne-toi de notre côté comme (tourne) la roue, toi qui es la plus neuve!",
   "03.061.04": "Comme une femme défaisant le fil, l'Aurore généreuse marche, maîtresse du pâturage. Engendrant la lumière solaire, elle bienheureuse, efficace, elle s'est étendue jusqu'aux confins du ciel et de la terre.",
   "03.061.05": "Je vous in(voque), déesse Aurore resplendissante: présentez-lui avec hommage le beau poème! La donneuse de miel a fixé au ciel, tout droit, sa masse: splendide, elle a fait resplendir (les espaces lumineux), elle à l'aimable apparence.",
   "03.061.06": "La (Fille) du ciel, vouée à l'Ordre, a été éveillée par les chants. Riche, elle a gravi avec éclat les deux mondes. L'Aurore qui arrive, qui brille, ô Agni, tu vas vers elle, toi qui désires en partage une richesse agréable.",
   "03.061.07": "Dans le fondement de l'Ordre, le Taureau courant après les Aurores est entré dans les deux grands mondes. Grande est la force altérante de Varuṇa, de Mitra: il a réparti en maint endroit son rayon comme de l'or.",
   "04.051.01": "Voici donc cette lumière, la première d'entre beaucoup, elle a surgi des ténèbres à l'orient, parlant les signes démarcateurs. Que maintenant les Filles du ciel, les Aurores, fraient la voie aux hommes en brillant!",
   "04.051.02": "Les Aurores éclatantes ont surgi vers l'orient, tels des poteaux érigés pour les cérémonies. En luisant au loin elles ont ouvert la porte de l'enclos, des ténèbres, elles les claires, les purifiantes.",
   "04.051.03": "Qu'en luisant aujourd'hui les Aurores généreuses distinguent les donateurs pour qu'ils confèrent des bienfaits! Que dorment les avares dedans le (domaine) obscur, sans se réveiller, en plein milieu des ténèbres!",
   "04.051.04": "Y aura-t-il par hasard, Aurores divines, un voyage, ancien ou bien nouveau, de vous aujourd'hui? (Sera-ce ce même voyage) par lequel vous avez (jadis) sur Navagva, sur Aṅgira, sur Daśagva, sur (le dieu) aux sept bouches, vous les riches, apporté en luisant les richesses?",
   "04.051.05": "Oui, vous autres déesses, avec vos chevaux attelés par l'Ordre, vous parcourez en un seul jour toutes les créations; éveillant, ô Aurores, celui qui dort, (la gent) bipède el quadrupède, (tout) ce qui vit, afin qu'il marche!",
   "04.051.06": "Où donc (et) la quantième était (l'Aurore) antique, grâce à laquelle (les dieux) répartirent les répartitions des R̥bhu? Lorsque les belles Aurores procèdent en beauté, elles ne sont pas discernables (l'une et l'autre), elles sont pareilles, exemptes de vieillir.",
   "04.051.07": "Ce sont en vérité ces bienheureuses Aurores qui furent jadis d'un éclat prééminent, véritablement nées de l'Ordre, chez qui celui qui sacrifie et prend de la peine, celui qui loue et récite en forme d'hymnes, a en un jour atteint la richesse.",
   "04.051.08": "Elles s'avancent (aujourd'hui encore) de l'orient par la même voie, d'un même lieu, de la même manière, s'étendant au loin, les Aurores divines qui, prenant leur éveil du siège de l'Ordre, s'éveillent comme des lâchers de vaches.",
   "04.051.09": "Ce sont bien ces Aurores qui procèdent de la même manière, elles semblables (les unes aux autres) avec leur couleur inaltérable, cachant l'informité noire avec leurs corps candides, elles les claires, pures, rayonnantes.",
   "04.051.10": "Filles du ciel qui resplendissez, conférez-nous la richesse faite de descendance, ô déesses! Puissions-nous, nous réveillant à votre (appel) d'une (couche) agréable, devenir les possesseurs d'hommes utiles!",
   "04.051.11": "Ainsi, Filles du ciel, Aurores resplendissantes, je m'adresse à vous, moi qui ai le sacrifice pour signe lumineux. Puissions-nous être distingués parmi les hommes! Que le Ciel et la Terre nous accordent ceci!",
   "04.052.01": "Cette femme libérale, qui luit au loin du sein de sa sœur, Fille du ciel, s'est fait voir (aux hommes).",
   "04.052.02": "Telle une jument, éclatante, rougeâtre, mère des vaches, gardienne de l'Ordre, l'Aurore est l'associée des Aśvin.",
   "04.052.03": "Tu es à la fois l'associée des Aśvin et la mère des vaches. Et en outre tu règnes sur la richesse, Aurore.",
   "04.052.04": "Toi qui refoules l'hostilité, ô riche en libéralités, nous t'avons de façon vigilante réveillée par nos louanges.",
   "04.052.05": "Les rayons bienheureux se sont montrés, tels des lâchers de vaches. L'Aurore a empli la vaste carrière.",
   "04.052.06": "En l'emplissant, ô resplendissante, tu as découvert les ténèbres par la lumière; Aurore, favorise-(nous) selon ta loi propre.",
   "04.052.07": "Tu tends le ciel de rayons, le vaste cher domaine aérien, Aurore, avec ton clair éclat.",
   "04.055.01": "Qui de vous, ô Vasu's, est le sauveur, qui le protecteur? -O Ciel et Terre, ô Aditi, veuillez nous sauver/ d'un mortel plus fort  (que nous), ô Varu1;a, ô lVIitra ! - Qui de vous, dieux, procurera largesse pour le cursus-rituel ?",
   "04.055.02": "Eux qui sont destinés-à-chanter avant (tout autre) lesinstitutions primitives - tant que luiront (les astres) discriminatenrs, exempts d'égarement -,/ ces (dieux sont ceux) qui ont  réparti, eux les répartiteurs inépuisables; ils ont brillé, (ces êtres) merveilleux dont les pensées-intuitives (vont selon) !'Ordre.",
   "04.055.03": "J'invoque en tête Pastya, Aditi, le Fleuve, avec des récitations; (j'invoque) Svasti la déesse, pour (obtenir) son alliance./ Qu'Aurore et Nuit, (déesses) impossibles à tromper, fassent en sorte que les deux parties du jour nous surveillent !",
   "04.055.04": "Aryamal), Varul)a, (ont) rendu la voie perceptible; Agni, maître de la jouissance (rituelle), (a rendu perceptible) le parcours heureux./ Indra-Viër.rn, une fois loués, eh bien! conférez-nous le refuge puissant, la protection formidable !",
   "04.055.05": "J'ai demandé-pour-faveur les assistances de Parvata, des Marut, du dieu Sauveur, de Bhaga./ Que le maitre (Varm;ia) nous garde du péril-anxieux venant des étrangers, et que Mitra nous libère de celui qui vient des alliés !",
   "04.055.06": "Et maintenant, veuille (le poète) vous louer, ô Deux Mondes, avec Ahi abyssal, ô vous divinités, avec (les dieux) des eaux (tant) désirés!/ Comme les (gens) épris de gain (découvrent) l'océan au cours de leur expédition, (les hommes pieux) ont découvert des rivières bruissant comme le chaudron (plein de lait bouillant).",
   "04.055.07": "Veille sur nous la déesse Aditi avec les dieux, le dieu Sauveur (nous) sauve sans défaillance!/ Nous ne devons pas laisser perdre la coulée (émanant) de Mitra, de Varu9a sur la surface d'Agni.",
   "04.055.08": "Agni est le maitre de la richesse-collective, Agni (ee.t le maître) d'une grande bonne fortune./ Ces (biens), qu'il nous en fasse présent !",
   "04.055.09": "Aurore magnanime, libérale, vél1icule ici maintes choses délectables/ pour nous, ô toi qui as les prix-de-victoire !",
   "04.055.10": "Voilà bien (ce que nous attendons de) Savitr, Bhaga, Varu9a, Mitra, Aryama9./ Qu'Indra arrive à nous avec un bienfait !",
   "05.041.01": "Quel (homme) épris de !'Ordre, ô Varu9a-Mitra, (est tel que) vous lui donniez (des récompenses), soit (au séjour) du Ciel puissant, soit (à titre) de (bien) terrestre,/ soit au séjour de !'Ordre - veuillez tous deux nous sauver! -, (en bref des récompenses) comme (celles qu'on donne) à l'être aimant sacrifier, (à savoir) des prix-de-compétition (consistant en) gains de bétail?",
   "05.041.02": "Que ces (dieux, à savoir) Mitra, Varu9a, Aryamal), l'Homme, Indra, ~bhuk'?al), les Marut, se plaisent en nous/ ou (en ceux) qui parmi les hommages (humains) instituent un bon éloge, un chant pour Ruclra le compatissant, (eux tous agissant) de concert!",
   "05.041.03": "0 Asvin's qui (êtes ceux qui) allez le plus vite dans l'envol du vent, je vous appelle pour la possession-florissante du charroi./ Ou encore (je dis :) présentez au Maître du ciel (mon) poème comme (on préscnLe) les breuvages-sômiques au sacrifiant.",
   "05.041.04": "En tête (de mon hommage se sont mis en marche) Trita, vainqueur céleste, dont l'oblateur est un Ka9va, (Trita qui vient) du ciel, de concert (avec d'autres dieux, ainsi que) Vâta, Agni,/ Pliëai;t, Bhaga, (dieu) à toutes jouissances, pour la présentation (des offrandes), comme se sont mis en marche pour l'arène ceux qui ont les chevaux les plus rapides.",
   "05.041.05": "Présentez votre richesse faite de chevaux attelés ! Puisse (ma) pensée-poétique se prêter à aider à la quête de richesse !/ L'oblatcur de la famille des Usij est favorable en ses comportements, comportements qui sont (aussi) les vôtres, ô Marut's (qui êtes des dieux) rapides. ·",
   "05.041.06": "Mettez en tête de votre (hommage) Va yu attelé au char, mettez (cc) dieu à la parole-inspirée, qui loue en (forme de) récitations!/ Vous qui revendiquez (des récompenses, en qualité d'hommes) cultivant !'Ordre. -Que les Bonnes Épouses confèrent en l'occurrence à notre pensée-poétique des plénitudes (de succès)!",
   "05.041.07": "Je veux m'approcher de vous avec des hymnes dignes d'être célébrés, (mettre) en tête (de mon hommage) les deux jeunes (filles) du Ciel (,Aurore d Nuit,) avec des chants qui se distinguent./ Aurore et Nuit, comme deux (femmes) qui save11t toutes choses, portent au mortel le sacrifice.",
   "05.041.08": "J'adresse un chant pour vous, seigneurs riches en floraison, Vàstoëpati, Tvaë~f, en donnant (l'offrande),/ Dhiëai;tâ l'enrichissante (csL) de concert-, avec des hommages, (je l'adresse pour) les Arbres de la forêt, pour les Plantes, en (ma) quête de richesse.",
   "05.041.09": "Que les Montagnes soient (propices) quand (il s'agit) pour nous d'implanter la descendance, (en sorte qn'ellcs se laissent) heureusement aborder comme de bons (patrons, de bons) maîtres !/ Loué soit toujours (Trita) Âptya, (ce dieu) cligne dn sacrifice! Que (cet être) viril invigore notre récitation par préférence (à tonte autre) !",
   "05.041.10": "Je viens de louer d'une belle louange le nouveau-né d'(Agni) le taureau terrestre, (comme) Trita (a loué) le Fils des eaux./ Agni est célébré par des 11yn1nes comme (un coursier qu'on incite) à aller. Lui dont la chevelure est de flammes, il détruit les bois.",
   "05.041.11": "Comment (oserons-nous) adresser la parole au grand (Rudra, l'être) rudraïque? Que (dirons-nous) à Bhaga, (dieu) de la richesse, lui qui comprend ? / Nous soient favorables les eaux, ainsi que les plantes, le ciel, les bois, les montagnes qui ont les arbres pour chevelure l",
   "05.041.12": "Que le maître des vigueurs entende nos paroles, !ni (le Vent) plus impétueux que la nuée, lui efficace, qui circule autour (du monde)!/ Qu'entendent les eaux, belles comme des corps qui (le) presse tout autour !",
   "05.041.13": "Je sais en vérité, (dieux) puissants, quels sont vos comportements : nous allons (le) dire, (dieux) merveilleux, en apportant l'(offrande) délectable./ Mème les oiseaux (les plus) robustes ne descendent pas (secourir) le mortel poursuivi par le choc (ennemi), par les armes-de-mort.",
   "05.041.14": "Je vais évoquer les engendrements célestes (et) terrestres et les eaux, à l'intention du (patron) généreux./ Que croissent (pour lui) les jours, les montagnes aux cimes brillantes, que croissent en eau les flots conquis !",
   "05.041.15": "Que pas après pas ma vieillesse soit mise en dépôt, (que ce soit par) Varütrl l'active ou bien par les Protecteurs!/ Que Rasa, la grande mère, nous assiste en compagnie des patrons, elle de qui la main (est dirigée bien) en face, qui (elle-même se dirige bien) en face !",
   "05.041.16": "Comment pourrions-nous honorer-dignement par (notre) hommage les Marut aux beaux dons, qui vont de leur pas vers l'appel (des dieux), les Marut très renommés, (qui vont) vers l'appel ? /Puisse Ahi abyssal ne pas nous placer dans le dommage ! Qu'il nous soit donneur de penséc-aidante !",
   "05.041.17": "C'est (en parlant) ainsi, dieux, que le mortel pourra gagner (une priorité) pour une descendance comportant (aussi) du bétail; pour vous, dieux, le mortel pourra gagner, pour vous./ (Rendez)  bénéfique en l'occurrence la sève de mon corps ! Que la Néantise avale ma ·vieillesse !",
   "05.041.18": "Cette faveur vôtre, dieux, la jouissance invigorante, pu1ss1ons-nous y atteindre, ô Vasu 's, grâce à l'instruction (impartie) par la Vache!/ Puisse cette déesse riche en dons, compatissante, venir en courant à notre rencontre, pour (notre) bien-être !",
   "05.041.19": "Qne l'offrande-liquide, mère du troupeau, ou bien Urvasl en compagnie des rivières nous encourage(nt)-par-la-parole !/ Ou (encore cette) Urvasl du haut du ciel, une fois chantée (par nous, elle) qui se dérobe (aux regards humains), (mère) de !'offerte, (mère) de l'Homme !",
   "05.041.20": "Que nous assiste (la mère) d'Ürjavya, (mère aussi) de la prospérité !",
   "05.042.01": "Puisse d'abord (mon) inspiration, (ma) parole la plus bénéfique atteindre Varrn:ia, Mitra, Bhaga, Adit.i, bientôt !/ (L') entende le Maitre (Aryamai;i) qui séjourne dans (la graisse) diaprée, (le dieu) aux cinq oblatcurs, au chemin infranchissable (pour ses ennemis), (le dieu) réconfortant!",
   "05.042.02": "Puisse Acliti accueillir-fa\\rorablernenL ma louange, com1nc une mère son fils cher au coeur, bien aimé !/ La Formule-suprêrne, chérie, qui a été instituée par les dieux) la réconfortante, moi (je l'accueille) de la part de Mitra, de Varui;ia. '",
   "05.042.03": "Mots en branle Io plus poète des poètes ! (Officiants,) arrosez-le de miel, de beurre-fondu!/ C'est le dieu SaviLr (qui) suscitera pour nous des trésors offerts, mis (en enjeu), étincelants.",
   "05.042.04": "O Indra, conduis-nous d'une âme (bienveillante en sorte d'être unis) avec les vaches, avec les patrons, ô possesseur des alezans, avec le bien-être,/ avec la Formule qui a été instituée par les dieux, avec la faveur des dieux dignes du sacrifice !",
   "05.042.05": "Le dieu Bhaga, Savitr (maître) de la richesse, Arμsa, Indra (vainqueur) de Vrtra conquérant des trésors,/ l}bhuk~ai;i, Vaja ainsi que Purarpdl1i, qu'ils nous favorisent, (tous ces dieux) immortels, valeureux!",
   "05.042.06": "Nous allons proclamer les (hauts) faits d'(Indra) qu'accompagnent les Marut, du (dieu) irrésistible, victorieux, exempt de vieillir./ Ni les gens du passé, ô Libéral, ni ceux à venir, aucun  d'aujourd'hui n'a atteint ta force-virile.",
   "05.042.07": "Loue en sus le premier confèrement de trésor, (incarné par) Brhaspati, gagneur de richesses,/ bénéfique entre tous à celui qui récite (et) qui chante, riche en biens, en sorte qu'il vienne vers celui qui l'appelle-à-grands-cris !",
   "05.042.08": "Accompagnés de tes assistances, ô Brhaspati, les donateurs sont exempts de dommage, riches en hommes-d'élite./ Ceux qui so11t donneurs de cl1evaux ou bien donneurs de vaches, les donneurs de vêtements, - les richesses leur (soient) propices !",
   "05.042.09": "Fais que s'écoule-en-pure-perte le bien-acquis de ceux qui tirent profit des hymnes sans (rien) donner!/ Éloigne du soleil ceux qui se détournent des voeux (divins), qui (se croyant) renforcés pour la compétition veulent (en fait) du mal à la Formule!",
   "05.042.10": "Celui qui prend en considération les êtres dé1noniaques pour l'invite aux dieux, passez-lui sur le corps 1 ô Niarut's, de (vos cl1ars) sans roues !/ Celui qui songe à blâmer la peine de qui a peiné (au sacrifice), qu'il se fasse des désirs inanes, (1nêrne s'il) a sué(de zèle pieux) !",
   "05.042.11": "Loue encore ce (dieu Rudra) qui, avec de bonnes flèches, un bon arc, règne sur LouL rerr1ède !/Adore Rudra en vue (d'obtenir sa) grande bienveillance, gratifie le dieu, le Maître, de (tes) hommages!",
   "05.042.12": "Les maîtres de maison actifs-à-l'oeuvre, (les I~blm) aux bonnes inains, les Rivières épouses du taureau (Indra), façonnées par Vibhvan,/ Sarasvatl (venue) du haut du ciel, ainsi que Raka, les brillantes (déesses), qu'elles se montrent Jarges, (nous) honorantclignement !",
   "05.042.13": "Je présente clone (ici le témoignage de ma) sagesse, au grand (Tvm;\\r, dieu) au bon refuge, un chant nouvel(lement) né -,/ à 1 ui, (dieu) salace, qui, altérant ses formes dans les entrailles de sa fille, a fait pour nous (le monde que) voici.",
   "05.042.14": "Puisse en prc1nicr la bonne louange, ô chantre, atteindre maintenant (Parjanya), qui tonne (et) hurle, maître de l'oflrandeliquidc,/ lui qui, ricl1e en nuages, ricl1e en eau, s'avance avec l'éclair en arrosant les deux mondes !",
   "05.042.15": "Puisse l'éloge que voici accéder jusqu·'à la cohorte mârutienne, jusqu'aux fils juvéniles de Rudra !/ Le désir m'appelle vers la richesse - hien-être (à moi)! - Ajoute à ta louange les (Marut) aux chevaux tachetés, les (dieux) infatigables!",
   "05.042.16": "Puisse, (plus) en avant, l'éloge que voici accéder vers la Terre, vers 11Espace-médian, 'Vers les Arbres de la forêt, les Plantes, pour (que j'obtienne) la richesse!/ Qu'un dieu après un dieu soit propice à invoquer pour moi ! Que la Terre mère ne nous place pas dans la défaveur !",
   "05.042.17": "Puissions-nous être dans le large (espace), dieux, clans l'absence de presse !",
   "05.042.18": "Puissions-nous être unis avec la faveur présente des ASvin,  (leur faveur) réconfortante, qui conduit à bon port!/ Véhiculez [duel] pour nous la richesse ainsi que les hommes-d'élite, et aussi toutes bonnes fortunes, (dieux) immortels!",
   "05.043.01": "Que les vacl1es-laitières, se hâtant au but, ·vicnne11t à nous sans manquer, avec le lait, avec le miel!/ En vue (d'obtenir) la richesse grandement, le (poète) inspiré, le chantre, appclle-àgrands- cris les sept puissantes (femelles) réconfortantes.",
   "05.043.02": "Grâce à l'eulogie, je veux avec hommage tourner à moi le Ciel et la Terre, (ces divinités dont l'aide est) immanquable, en vue de (gagner) le prix-de-victoire!/ Que le père (Ciel), la mère (Terre) aux douces paroles, aux inains actives, (ces dieux) renommés, nous portent assistance en chaque compétition !",
   "05.043.03": "O adhvaryu's, qui avez fait les doux-breuvages, présentez à Vayu le clair (soma) plaisant!/ (En qualité de notre) oblateur, bois le premier de ce miel nôtre, ô dieu (Vayu) ! Nous te (!')avons donné pour que (tu) t'enivres.",
   "05.043.04": "Les dix doigts (de l'officiant,) les deux bras attellent la pierreà- presser : ce so11t leS préparateurs du so1na, aux mains actives./ La tige aux beaux rameaux a donné-pour-lait la sève (du soma semblable à) du miel, (plante) de la montagne, (sève) très-brillante, claire.",
   "05.043.05": "Il a été pressé pour toi (Indra) qui l'aimes, (ce) soma, pour (que tu obtiennes par lui) la force-théorique, la force-pratique, l'ivresse puissante./ Amène de ce côté-ci les deux (chevaux) alezans, propres à être attelés au char pour (partir) en expédition, (les chevaux) aimés, ô Indra, quand tu es invoqué !",
   "05.043.06": "(Amène-) nous vers ici ]a grande Aramati, d'accord (avec elle), la Femme divine à qui l'on offre l'oblation avec hommage !/ La puissante (déesse) qui connaît !'Ordre, pour (nous permettre de nous) enivrer (du soma semblable à) du miel, amène-la, ô Agni, par les chcn1ins où \\ro11t les dieux !",
   "05.043.07": "(Ce chaudron de lait bouillant) que l'on consacre-par-onction comme (!ont) les officiants, en étendant (la litière rituelle), en (le) chauffant au feu comme (on chauffe un morceau de viande)  accompagné de l'epiploon,/ le chaudron très aimé, conforme à l'Ordre, a été installé sur Je feu comme le fils (s'installe) sur le giron du père.",
   "05.043.08": "Que la parole grande, puissante, très bénéfique, aille tel un messager pour appeler les Asvin !/ Arrivez de ce côté-ci, [dieux : duel] réconfortants, sur un même char, venez (conférer votre) trésor, aussi (naturellement) que la cheville (vient s'ajuster) au joug, au moyeu (de la roue) !",
   "05.043.09": "Tout d'abord, moi, j'ai ordonné l'énoncé d'un hommage au (dieu) plus fort (que les autres), au fort Pu~al) ainsi qu'au (fort) Vayu,/ qui sont les deux incitateurs de pensées-poétiques grâce au bienfait (qu'ils répandent); ils sont aussi, en personne, (des donneurs) de prix-de-victoire (égaux à) Dravir;t0das.",
   "05.043.10": "Amène ici les Marut avec (leurs) noms (individuels), eux tous, avec leurs formes (individuelles), ô (Agni) Jatavedas, quand on t'invoque!/ Venez au sacrifice, aux paroles· et à l'eulogie du chantre, vous tous ô Marut's, tous (accompagnés) de (votre) faveur!",
   "05.043.11": "Que du haut (du) ciel, de la montagne, vienne à nous ici Sarasvatl, (déesse) digne du sacrifice, vers (notre) sacrifice!/ Que la déesse, agréant (cet) appel, marquée de beurre fondu, entende notre parole zélée, (d'une âme) bien disposée!",
   "05.043.12": "Brhaspati, l'ordonnateur (du sacrifice) au dos noir, (le dieu) puissant, installez-le ici sur (son) siège (attitré)!/ A (ce dieu) qui prend place en son séjour (naturel), qui resplendit dans la maison, qui a la couleur de l'or, couleur-de-feu, nous ·voulons rendre un culte.",
   "05.043.13": "Qu'(Agni) base (du sacrifice), (venu) du haut (du) ciel, conférant (des biens), vienne ici avec toutes (ses) auxiliarités, quand on l'appelle,/ (cc dieu) vêtu de femelles, de plantes, ne laissant jamais en plan, taureau triplement cornu, donneur de vigucur2 J",
   "05.043.14": "Au pas suprême de la Mère (Urvasl), (au pas) d'Àyu, sont arrivés les clairs, les célébrés (jus de soma) qui bruissent./ (Les officiants) approprient avec hommage (Agni) le nouveau-né bien aimé auquel ils donnent des offrandes, comme font les Àyu dans (leur) demeure.",
   "05.043.15": "A toi (dieu) puissant, ô Agni, (appartient) la force puissante. Les couples vieillis en religion (t')escortent./ Qu'un dieu ... ( = 42,16).",
   "05.043.16": "= 42,17.",
   "05.043.17": "= 42,18.",
   "05.044.01": "A la manière ancienne, primitive, générale, actuelle, (je n1'cn vais traire) ce (dieu Indra), l'aîné (des dieux), sis sur la litièrerituelle, découvreur de la lumière-céleste;/ je m'en vais (le) traire par la parole (en sorte qu'il) se tourne-avec-faveur vers (notre) groupe, (ce dieu) rapide, conquérant (des vaches) au long desquelles je veux prendre vigueur.",
   "05.044.02": "Belles à voir, (parées) pour la beauté, [sont les femmes = les rayons] du soleil inférieur [ = d'Agni]; (celui-ci est) illuminant pour qui s'abstient d'inciter (au don) les sommets./ (0 Agni,) tu es un bon gardien, impossible à tromper, (dieu) au bon conseil. Ton nom a été de tout temps au-delà des activités-altérantes, dans (le domaine de) !'Ordre.",
   "05.044.03": "L'oblation suit le coursier (Agni) et (sa) fondation est réelle, sa marche inendommageable ; il est l'oblateur, porteur de forcesvives./ Le taureau enfant, qui s'est avancé à la hâte le long de la litière-rituelle, s'est placé au milieu avec (sa) flamme, lui le jeune (dieu) exempt de vieillir.",
   "05.044.04": "En Lête (de mon hommage sont) ces (chevaux cl'Agni), bien atlelés, (qui vont) en expédition à la recherche (de butin); vers lui (accourent), (tête) en bas, les (soeurs) jumelles [~les coulées de beurre rituel] qui sont invigorées par l'Ordre./ Avec les rênes bien contrôlantes, toutes dirigeantes (des officiants), (Soma le dieu) fauve dérobe leurs no1ns (aux eaux) lorsqu'il s'élance ('rers elles, daus la cuve).",
   "05.044.05": "(Agni) qui étincelle en tous sens à travers les arbres, (le dieu) aux belles colonnes (de flammes) (séjourne) dans les (femelles) visiblement pleines, (cherchant à atteindre l'oflicianl) qui puise dans (le soma) pressé, pourvu d'une branche./ Toi dont la marche est droite, (ô Agni,) je veux (t') embellir en des discours (semblables à des) coulées; grandis, plein de vie, pour le cursusrituel, par-delà les Épouses !",
   "05.044.06": "Tel qu'il a été vu, tel il est décrit : (les dieux à l'origine des temps) ont (rc)constitué, à l'aide du reflet réalisé clans les eaux,/ la Terre, qui conquiert pour nous le large (espace), (avec son) large domaine, (avec sa) force puissante faite d'hommes-d'élite, inébranlable.",
   "05.044.07": "(Le soleil,) célibataire (et pourtant) pourvu de femmes, s'engage au-delà des rivalités, d'une âme combative, lui le poète./ Qu'il nous assure une demeure protégeant de tontes parts de (son) ardeur, (nous servant de) refuge, lui qui a des trésors en propre!",
   "05.044.08": "Au signal de cette compétition, (les paroles du poète) s'avance(nt) vers la rumeur imposante des Sages (antiques), (paroles) parmi lesquelles est ton nom (, ô Agni)./ Celui chez qui (la parole) a été placée, quel qu'il soit, elle se l'acquiert grâce à (son) activité. Et celui qui (!')emmène d'elle-même (comme une nouvelle épouse), il mettra en bonne-forme (son discours).",
   "05.044.09": "De ces (paroles), celle qui est en tête est descendue (comme un fleuve) vers l'océan (spirituel). La pressée (de soma) ne subit pas de dommage (chez celui) à qui (cette parole) s'agrège./ Le coeur de Krava:r:ia ne tremble point à l'endroit où se trouve une penséepoétique connectée au (soma) clarifié.",
   "05.044.10": "En effet (le chantre agit) selon les intentions de K~atra Manasa, d'Evavada, de Yajata, de Sadhri./ Nous voulons remporter avec les joyeux (compagnons) d'Avatsâra le prix-de-victoire le plus robuste, (salué comme une) réussite même par celui qui sait.",
   "05.044.11": "Le faucon est l' Aditi de ces (paroles sacrées) ; la boisson enivrante de Visvavara, de Yajata, de Miiyin, est (comme) une courroie (à faucon)./ (Les officiants) se concertent pour aller de  l'un à l'autre. Ils savent (avoir) devant eux le dételage, la boisson (rituelle) circulaire.",
   "05.044.12": "Que Yajata, qui toujours donne, disperse-et-tue les ennemis ! Bahuvrkta, Srutavid, Tarya, sont avec vous./ Il va au-devant de l'un et l'autre objets-de-voeux et brille, quand il s'intègre à la troupe (des poètes, faite d'hommes) dont l'abord est de bon augure.",
   "05.044.13": "Sutambhara est le maître du siège du sacrifiant (laïc); c'est lui qui puise (à) la mamelle de toutes les inspirations./ La vachelaitière porte un lait plein de sève; (cc lait) a été mélangé. - Comprend qui récite (un texte), non point qui dort.",
   "05.044.14": "Celui qui ''cille, lcF strophes l'aÎlnent; celui qui -veille, les mélodies (rituelles) vont à lui aussi./ Celui qui veille, le soma que voici lui dit : n1oi, dans Lon arnitié, (je me sens co1nrne) chez mol.",
   "05.044.15": "Agni veille, les strophes l'aiment ; Agni veille, les mélodies (rituelles) vont à lui aussi./ Agni veille, le soma que voici (etc.).",
   "05.046.01": "Comme un coursier, moi qui sais, je me suis attelé de moimème au brancard. Je tire ce (brancard) qui promeut, qui donne assistance./ .Je ne .. veux pas le dételer, ni tourner en arrjère. Celui qui sait le chc1nin, qui va en tête, qu'il (rne) conduise droit!",
   "05.046.02": "O Agni, ô Indra, ô Varm:ia, ô Mitra, (et autres) dieux, conférez (-11ous un rcfugc)i ô cohorte rnâruticnne et toi, ô Vi~J)-U !/Que l'un d l'autre Nâsatya, Rudra et aussi les Femmes (divines), Pu9ai;i, Bhaga, Sarasvatl trouvent plaisir (à mon hymne) !",
   "05.046.03": "Indra-Agni, Varm;a-Mitra, Aditi, le Soleil, la Terre, le Ciel, les Marut, les Montagnes, les Eaux,/ - je (les) appelle, ainsi que Vi9\\m, Pu9ai;i, Brhaspati, Bhaga et aussi (Nara)-Saipsa, Savitr, qu'ils (nous) favorisent!",
   "05.046.04": "Et encore : que Vi~i;iu ainsi que Viita (et autres dieux) exempts d'échec, Dravii;iodas ainsi que Soma nous réconforte(nt) !/ Et encore : les J,î.bhu ainsi que les Asvin, en vue (de nous donner) la richesse, ainsi que Tva9tr, ainsi que Vibhvan nous concède(nt) (le droit à la richesse) !",
   "05.046.05": "Et encore : cette-célèbre cohorte mârutiennc résidant au ciel, qu'elle vienne ici, elle adorable, afin de prendre place sur la litière (riLuelle) !/Que Brhaspati ainsi que Pü9a\\1 nous accorde(nt) un refuge comportant couverture, (et aussi) Varui;ia, Mitra, Ar~yamar:i !",
   "05.046.06": "Et encore : ces montagnes illustres, (ces) rivières éclatantes, qu'elles nous soient à sauvegarde !/ Que Bhaga le répartiteur vienne avec (sa) puissance, (sa) faveur! Qu'Aditi s'étendant aularge entende mon appel !",
   "05.046.07": "Que les Épouses des dieux nous favorisenL de leur plein gré, nous aident par pré(dilcction) afin de faire jaillir (l'inspiration) en nous, (nous faire) gagner le prix-de-vicLoire !/ (Épouses) terresLrcs (et vous auLres) qui êtes clans le voeu (d'obédience) des eaux, ô déesses propices à invoquer, accordez-nous le refuge !",
   "05.046.08": "Et encore : que les Femmes qui ont un dieu pour époux agréenL (notre invite), IndriiI.J-f, Agnayf, Asvinf, la Reine!/ Qu'entende(nt) Rodas!, VaruI.J-anl (en venant) ici! Qu'agréent (notre inviLe) les déesses qui sont le parangon des femmes!",
   "05.047.01": "Celle qu'on nomme la mère ptiiss&L, .. ''Aurore) d'une fille (qui est la Prière), attelant (les humains à leur tâche), (les) éveillant, va (du haut) du ciel;/ (elle est aussi) une jeune femme, qui cherche à attirer (les êtres) par l'inspiration, qui (les) appelle-à-grands-cris vers le siège (du sacrifice, issu) des Pères.",
   "05.047.02": "Les agiles (chevaux du Soleil), se hâtant vers la tâche (qui estla) leur, après avoir gravi le nombril de l'ImmorLel, -/Sans fin, vastes, autour du Ciel et de la Terre vonL les chemins de toutes parts.",
   "05.047.03": "(Le soleil), taureau, océan, aigle fauve, est rentré dans le sein du père primitif./ Déposé au milieu du ciel, (tel) une pierre bigarrée, il a enjambé (l'éLcndue). Il garde les cieux bouts de l'espace.",
   "05.047.04": "Quatre (entités masculines) le portent, assurant (son) repos. Les dix (doigts de l'officiant) donnent à téter au nouveau-né, afin qu'il marche./ A triple base sont ses vaches [ = ses rayons] les plus hautes; elles vont en un même jour (de l'une à l'autre) des bornes du ciel.",
   "05.047.05": "C'est une chose prestigieuse, un mystère-oral, gens, (à savoir) que les rivières marchent (et qu'en revanche) les eaux sont immobiles ;/ (ou encore) que deux (êtres, à savoir le Ciel et la Terre,) autres que la mère (,à savoir !'Aurore,) le (,à savoir le Soleil,) portenL, (deux êtres féminins) qui sont nées (l'une) ici, (l'autre) là, (tout en étant) jumelles (et) parentes.",
   "05.047.06": "C'est pour ce (Soleil) que s'étendent les (trames des) penséespoétiques, les oeuvres (sacrées), (telles) des mères (qui) tissent les vêtemenLs pour (leur) fils./ Se complaisant à être fécondées par le taureau (Soleil), les jeunes épouses [=les prières] s'avancenL par le chemin du ciel.",
   "05.047.07": "Qu'il en soiL ainsi, ô VaruI.J-a-Mitra, ainsi, ô Agni! Que cet (hymne)-ci soit récité pour nous, pour (notre) heur eL profit!/ Puissions-nous atteindre un gué, ainsi qu'un point d'appui ! Hommage au Ciel, haute résidence !",
   "05.048.01": "Qu'allons-nous bien, nous (autres), composer-mentalement en l'honneur (du dieu Indra) à l'institution aimée, qui (tient) de soi-même le pouvoir-te1nporcl 1 de soi-1nên1e le renom, le grand (dieu),/ alors que la (femelle) artificieuse, choisissant-pour-faveur les eaux dans la nuée de l'espace imprégné-de-magic, (les) étend au loin ?",
   "05.048.02": "Ces (Aurores) viennent-d'étendre le jalonnement (des jours), qui fait grandir les hommes-forts, d'une seule et même course à travers tout l'espace./ L'individu qui aime les dieux refoule à l'arrière-plan (celles de ces aurores qui sont encore) à venir, il prolonge (sa durée de vie) par (les aurores) passées.",
   "05.048.03": "(L'homme pieux, tel Indra,) brandit (le soma pareil au) meilleur (des) foudre(s) sur le (démon) artificieux, à l'aide des pierres (à presser le soma), à l'aide des nuits qui comportent (aussi) des jours./ Celui dans la maison personnelle de qui s'avancent cent (instruments d'oblation), puissent les jours, qui (par nature) s'enroulent, (pour lui) se dérouler !",
   "05.048.04": "J'ai aperçu l'élan-destructeur de cet (Agni), tel celui d'une hache, (j'ai vu son) visage, afin de jouir de sa forme,/ lorsqu'en même temps il confère un trésor, telle une demeure riche en nourriture, à la tribu qui pousse-le-cri de guerre.",
   "05.048.05": "Ce (dieu Agni) aux quatre faces se pousse-en-avant avec sa langue; vêtu d'un plaisant (vêtement), faisant-s'aligner (même) !'Étranger, (il ést semblable à) VaruJ)a./ (Réduits au seul) entendement-humain, nous ne savons pas d'où Bhaga (et) Savitr donne(nt) (leur bien) délectable.",
   "05.049.01": "Je vais me rendre maintenant chez le dieu Savitr et chez Bhaga, qui répartit le trésor de l'Homme./ 0 vous deux, seigneurs, ô ASvin's qui (créez) rnaintc jouissance, je voudrais vous tourner à moi, jour après jour, cherchant (votre) amitié !",
   "05.049.02": "Toi qui t'y entends en cc qui touche l'expédition de l'Asura, gratifie d'hymnes le dieu Savitr !/ Que (l'homme) qui discerne veuille bien supplier, (lui rendant) hommage, (ce dieu) Lrès puissant qui lui aussi répartit le trésor de I1Homn1e l",
   "05.049.03": "Sans contre-partie, il(s) disLribue(nt) des (biens) délecLables, PilëaJ), Bhag·a, Aditi, à l'éclairement de l'aurore./ Qu'Indra, - 30 - Vi9r.n>, Varm;ia, Mitra, Agni, les (dieux) merveilleux, engendrent des jours bénéfiques !",
   "05.049.04": "Ainsi donc, que Savitr, (ce dieu) inaccessible à l'attaque, nous (assure) la couverture ; ainsi, que les Fleuves portant la prospérité (l')imiLent !/ Ce pour quoi je (les) aborde (en qualité) d'ohlateur du cursus-rituel, (je l'exprime ainsi :) puissions-nous devenir des maîtres de richesse, ayant pour trésor les prix-devicLoÜ'e !",
   "05.049.05": "Ceux qui présentent aux Vasu un hommage tel que celui-ci, qui parlent (au moyen) d'hymnes (adressés) à Mitra, à Varm;ia,/ que cède (devant eux) l'informité ! Faites (nous) libre-espace! Puissions-nous nous réjouir de la faveur du Ciel et de la Terre !",
   "05.050.01": "Puisse tout mortel choisir-pour-faveur l'alliance du dieu ConclucLeur (des hommes, Savitr) !/Tout (mortel) a pour objectif la richesse : puissc-L-il choisir-pour-faveur le prestige, en sorte qu'il prospère !",
   "05.050.02": "(Nous que) voici (sommes) Liens, dieu Conducteur (des homn1cs), ainsi que ceux qui sont aptes à louer en i1ous inütant./ Tels (que nous sommes), aptes en eJTet à êLre bourrés (de biens), puissions-nous avoir en accon1pag11en1ent la richesse, les chosesaccornpagnanLes !",
   "05.050.03": "Parlant, honorez-con11ne-il-sicd les seigneurs nos hôtes, partant (aussi), les épouses!/ Qu'au Join le refouleur (Savitr) refoule tout (être) qui se tient (en travers) du chemin, (tous) ennen11. s 1.",
   "05.050.04": "Quand (la bête cl') aLtelage, (tout) équipée, s'est mise à courir, animal résidant-clans-la-cuve-de-bois [le soma],/ (alors ]'être) à l'âme virile gagne des richesses comme (on gagne des pensées) sagaces, (en sorte qu'il ait) sa maison (pleine) d'hommes d'élite.",
   "05.050.05": "Voici, dieu Conducteur (des hommes), le maître de Lon char. (Voici) la richesse, pour (ton) bonheur./ (Poussant le cri) «pour (ton) bonheur n, en vue (d'obtenir) la richesse, «pour (ton) bonheur))' en vue ( d'obte11ir) le bien-être, nous sommes co11nus (comme étant) ceux qui célèbrent les jouissances (sacrificielles), nous sommes connus (comme étant) ceux qui célèbrent les dieux.",
   "05.051.01": "O Agni, viens ici pour boire (le soma) pressé, avec tous (tes) auxiliaires,/ (à savoir,) avec les dieux, pour le partage de l'oblation!",
   "05.051.02": "O vous qui avez la pensée (tournée ·vers) l'Ordre, venez ici, ô vous qui avez le vrai pour norme, (venez) vers Je cursus-rituel !/ Buvez avec la langue cl'Agni !",
   "05.051.03": "O prêtre-orateur, ô véridique, viens ici avec les prêtres-orateurs qui se metLent en marche de bonne heure,/ (viens) avec les dieux pour boire le son1a !",
   "05.051.04": "Voici le soma (qui), pressé clans la cuve, est déversé tout autour clans la coupe,/ lui cher à Indra, à Vayu.",
   "05.051.05": "O Vayu, arrive ici pour l'invitation, (1') agréant, pour Je partage de l'oblation!/ Bois (du jus) de la tige pressée, jusqu'à (ta pleine) satisfaction!",
   "05.051.06": "Indra et toi, ô Vayu, vous avez droit au breuvage de ces (tiges) pressées./ Agréez-les, (vous deux) exempts de tache, pour ( voLre pleine) satisfaction !",
   "05.051.07": "Pressés pour Indra, pour Vayu, ont été les soma (comportant) une mixture de lait-sur./ Ils vont comme des fleuves (qui suivent) la clécliviLé, pour (notre pleine) satisfaction.",
   "05.051.08": "De concert a·vcc tous les dieux, a'rec les ASvin, avec rAurore de concert,/ arrive ici, ô Agni, co1nn1e (chez) Atri co1nplais-toi au (soma) pressé!",
   "05.051.09": "De concert avec Varuna-Mitra, de concert avec Soma, avec Viër;tu,/ arrive (etc.).",
   "05.051.10": "De concert avec les Aditya, avec les Vasu, de concert avec Indra, avec Vayu,/ arrive (etc.).",
   "05.051.11": "Bien-être nous mesurent les Asvin, Bhaga ; bien-être, la déesse Aditi, (Lous dieux) inaccessibles à l'attaque !/ Bien-être nous confère Pü~a:ç_, le l\\tlaîtrc ; bien-être, Ciel et Terre de bonne entente !",
   "05.051.12": "Pour (notre) bien-être nous allons supplier Va yu ; pour (notre) bien-être, Soma, le chef de la création!/ Brhaspati avec sa troupe entière, pour (notre) bien-être; que les À.clitya soient pour notre bien-être !",
   "05.051.13": "Que tous les dieux aujourd)hui soienL pour notre bien-être, Vaisvanara, Vasu, Agni, pour (notre) bien-être!/ Que les dieux, (à savoir) les ~hhu, soient auxiliaires pour (notre) bien-être; que pour (notre) bien-être Rudra nous garde de la détresse!",
   "05.051.14": "Pour (notre) bien-être, ô Varur;ia-Mitra; bien-être, ô Pathya la riche !/ Bien-être nous (procurenL) et Indra et Agni ; bien-être, ô AdiLi, procure-nous !",
   "05.051.15": "Pour (notre) bien-être, puissions-nous marcher le chemin (tout) au long, comme le soleil et la lune!/ Puissions-nous nous trouver réunis à un qui donne en retour, qui ne tue pas (le bienfait reçu), qui comprend!",
   "05.079.01": "Éveille-nous aujourd'hui, Aurore, pour la grande richesse, ô toi riche en lustre, comme (jadis) tu nous éveillais chez Satyaśravas Vāyya, ô toi bien née, ô libérale en chevaux!",
   "05.079.02": "Toi qui luisais au loin chez Sunītha Śaucadratha, ô Fille du ciel, luis (de même) au loin chez Satyaśravas Vāyya qui est plus fort (encore), ô toi... !",
   "05.079.03": "Luis au loin pour nous aujourd'hui, apportant des trésors, ô Fille du ciel, toi qui luisais au loin chez Satyaśravas Vāyya qui est plus fort, ô toi... !",
   "05.079.04": "Ceux qui, ô resplendissante, te chantent avec des louanges, les guides (du rite), avec des présents, ô généreuse, (puissent-ils devenir) riches en gloire, munis de dons, riches en faveurs, ô toi... !",
   "05.079.05": "Si jamais ces groupes te semblent propres à recevoir des présents, eux les donateurs de bonne volonté, ils auront parachevé un bienfait non méprisable, ô toi... !",
   "05.079.06": "Confère à ces patrons, Aurore généreuse, la distinction consistant en hommes utiles, eux les généreux qui nous ont donné des bienfaits non méprisables, ô toi... !",
   "05.079.07": "Apporte-leur, Aurore généreuse, le haut prestige, la distinction, à eux les patrons qui nous ont donné en partage des bienfaits consistant en chevaux, en vaches, ô toi... !",
   "05.079.08": "Quant à nous-mêmes, apporte les jouissances consistant en vaches, ô Fille du ciel, en même temps que les rayons du soleil, ses claires, ses éclairantes ardeurs, ô toi... !",
   "05.079.09": "Luis au loin, Fille du ciel, ne tends pas ton œuvre en longueur, de peur que le soleil ne te brûle de son ardeur comme (on brûle) un voleur, un fourbe, ô toi... !",
   "05.079.10": "Telle est la mesure ou même davantage, Aurore, que nous souhaitons que tu donnes, toi qui, ô resplendissante, en luisant pour tes laudateurs ne perds (rien de ton éclat), ô toi... !",
   "05.080.01": "La haute (Aurore) au voyage radieux, vouée à l'Ordre selon l'Ordre, (aux chevaux) roses, resplendissante, la déesse porteuse de la lumière solaire, les orateurs la réveillent par leurs prières.",
   "05.080.02": "La voici, plaisante à voir, qui éveille les hommes, rend les chemins faciles, elle va en avant: elle à la haute voiture, haute (elle-même), qui met tout en branle, l'Aurore tient la lumière à l'orée des jours.",
   "05.080.03": "La voici, attelant (son char) de vaches roses; elle a sans erreur acquis la richesse inlassablement. La déesse louée largement, qui trace les chemins pour une marche heureuse, qui porte toutes choses désirables, brille au loin.",
   "05.080.04": "La voici, chatoyante, doublement robuste quand elle découvre son corps à l'orient. Elle suit régulièrement le chemin de l'Ordre comme une qui comprend: elle n'enfreint pas les directions de l'espace.",
   "05.080.05": "La voici, comme une belle qui a conscience de son corps, qui se baigne debout pour ainsi dire, pour que nous la voyions. Refoulant l'hostilité, les ténèbres, l'Aurore, Fille du ciel, est arrivée avec la lumière.",
   "05.080.06": "La voici, la Fille du ciel allant à l'encontre des hommes, comme une belle jeune femme, elle fait glisser sa poitrine. Découvrant pour l'adorateur des choses désirables, la jeune femme a fait la lumière à nouveau, comme autrefois.",
   "06.049.01": "Je m’en vais louer la gent (divine) ferme en ses voeux, à l’aide de paroles toutes nouvelles, (et singulièrement) Varuna— Mitra, (dieux) bienveillants.j Que eos bons souverains-temporels viennent à (nous), qu’ils écoutent ici, Varuna, Mitra, Agni!",
   "06.049.02": "(Le dieu) digne d’être invoqué par chaque tribu dans les cursus—rituels, (le dieu) à l’impertul‘bab1e conseil, roue des deux(Mondes) juvéniles,/ nourrisson du ciel, f‌ils de la force-agressive, Agni, f‌lambeau du sacrif‌ice, couleur d’aurore, je veux lui sacrif‌ier.",
   "06.049.03": "Les deux f‌illes du (dieu) couleur d’aurore sont dissembiables ; l’une (la Nuit] est ciselée d’étoiles, l’autre [l’Aurorel, (des rayons) du soleil.] Elles circulent (cherchant à) se dépasser l’une l’autre, (ces deux divinités) purif‌iantes; elles accèdent, (sitôt) chantées (par moi), à (l’effet de) la prière entendue.",
   "06.049.04": "En téte (de mon hommage est) la puissante pensée—concentrée (qui va) vers Väyu à la puissante richesse, (possesseur de) tous (biens) déleetahles, comblant son char (de trésors pour l’homme). ] (En tant que) Poète à la marche éclatante, régissant les attelages (divins, ô Väyu, dieu) qui te distingues en tête, tu cherches à atteindre (toi aussi) le poète (humain).",
   "06.049.05": "il m’apparaît (tel) une forme-merveilleuse, le char étincelant des Aévin, celui qu’on attelle par la pensée,] celui avec lequel, ô seigneurs Näsatya’s, vous allez votre course af‌in que nous rece- vions (de vous) la jouissance, nous—mêmes et notre descendance.",
   "06.049.06": "O Parjanya—Väta, Ô taureaux de la terre, vivif‌ies les terroirs riches en eau !] 0 poètes [plur.] qui écoutez la (parole) vraie, attirez à nous le monde-animé, (attire—le), ô (maître) du monde animé, e régisseur (du monde inanimé), (toi) par les paroles de qui (les choses se réalisent) !",
   "06.049.07": "Que la Fille de l’éclair, à la singulière vitalité, Sarasvatî, dont l’époux est un étre-d’élite, (nous) confère l’inspiration !] Qu’avec les Femmes (divines) elle accorde de concert un refuge sans faille, une protection inattaquaiale pour le chantre !",
   "06.049.08": "(Je loue) avec éloqucnee (Pûsan) qui veille autourde tout chemin. Poussé par le désir, il a rencontré (mon) poème.] Qu’ilnous fasse présent de (richesses) accroissant le bétail, culminant en or! Que Püsan fasse réussir (plus) avant chacune de (nos)  inspirations !",
   "06.049.09": "Le dieu qui a droit à la première part, (le dieu) renommé, donneur de force, aux mains habiles, aux bras actifs, (le dieu) artiste,] Tvastr digne du sacrif‌ice, propice à invoquer, qu’Agni l’oblateur dise la yâjyr‘i (pour lui, Agni dieu) des maisons, éclairant au loin !",
   "06.049.10": "Rudra, père de l’univers, je veux par ces paroles l’exalter de jour, (ce même) Budra, de nuit.] Puissions—nous invoquer comme il sied (le dieu) puissant, immense, exempt de vieillir, très favorable, après y avoir été incités par le poète !",
   "06.049.11": "O jeunes poètes, ô Marut’s dignes du sacrifices, venez ici (pour complaire) au désir d’espace du chantre !] Celui—là même qui est voué à l’obscurité, vous le vivif‌ies, l’exaltant, approchant ainsi (que nous vous voyons faire), c seigneurs, comme (vous fîtes pour) Angiras.",
   "06.049.12": "En avant vers (Indra, le dieu-)héros, en avant, vers (le dieu) fort, (très) fort, je vais pousser (mon hymne) comme le gardien du bétail (pousse) au logis les troupeaux] Qu’il fasse en sorte que les paroles—inspirées de l’orateur touchent à son corps, à lui célébre, comme (on fait toucher) le f‌irmament par les étoiles !",
   "06.049.13": "Visnu qui non moins de trois fois a mesuré les espacesterrestres, pour l’Homme serré (à l’étroit), —] Puissions—nous dans cette protection de toi, (6 Visnu,) ici même offerte, nous réjouir de la richesse, pour (notre) personne et (notre) descendance!",
   "06.049.14": "Qu’ainsi Ahi abyssal avec les eaux, avec les f‌lammes, qu’ainsi la Montagne, ainsi Savitr nous donne(nt) satisfaction !] Qu’ainsi avec les Plantes (les déesses) accompagnant le don, Bhaga, Puram— dhi, (nous) vivifie(nt) (plus) ‘avant vers la richesse !",
   "06.049.15": "Eh bien, la richesse qui va-en—ohar, qui emplit les populations, qui abonde en hommes—d’élite, la gardienne de l’Ordre puissant,] donnez—nous (la, ainsi que) la résidence exempte de vieillir, en sorte que nous l’emportions sur les (autres) hommes, sur les rivalités impies et que nous rattmpions les tribus impies !",
   "06.050.01": "J’appelle pour vous avec des hommages la déesse Aditi, pour qu’(elle) ait pitié, Varuna, Mitra, Agni, ] Aryaman qui donne sans être sollicité, (le dieu) très bienveillant, les dieux sauveurs, Savitr et Bbaga.",
   "06.050.02": "O Soleil, invite (à mon sacrifice) les dieux au bel éclat, qui ont Dalçsa pour père, (en sorte qu’ils soient garants) de notreinnocence, é (dieu) très puissant,] eux qui sont a double naissance, cultivent l’Ordre, sont vrais, lumineux, dignes qu’on leur sacrifie, ayant Agni pour langue !",
   "06.050.03": "Et encore : ô Ciel et Terre, (qui avez) le vaste pouvoir—temporel, la puissante protection, ô Deux Mondes très favorables,] faites en sorte qu’un large—horizon (s’ouvre) puissamment à nous, qu’absence d’injure soit à notre résidence, {5 Dhisanâ’s !",
   "06.050.04": "Que les f‌ils de Rudra se penchent vers nous, les Vasu inattequables (sitôt) appelés aujourd’hui,] quand, placés dans une grande ou une petite eppression, nous avons appelé les dieux Marut,",
   "06.050.05": "parmi lesquels s’est agrégée la déesse Roclasî! Que (les) accompagne Püsan, (dieu) recevant un sacrif‌ice distinct !] Quand,  ayant entendu l’appel, ô Marut’s, vous vous mettez en marche, les terres tremblent sur le chemin séparément—choisi (par vous).",
   "06.050.06": "Je veux diriger mon chant vers ce-célébre (dieu—)héros aimant la parole, vers Indra, ô chantre, a l’aide d’un formulaire nouveau.] Qu’il entende donc l’appel et que, (sitôt) loué, il fasse présent de grands prix—de—victoire !",
   "06.050.07": "Eaux faites pour l’homme, conférer. (——nous) un secours qui ne faut jamais, pour l’heur et prof‌it de (notre) progéniture, de (notre) descendance ! ] Car vous étes les guérisseuses les plus maternelles, les génitrices de tout (l’univers) immobile (et) animé.",
   "06.050.08": "Que vienne à nous le dieu Savitr qui protège, avec sa main d’or, (le dieu) digne du sacrif‌ice, ] lui qui, riche en dons, découvre pour l’adorateur des biens—délectables, comme (fait) le visage de l’Aurore !",
   "06.050.09": "Et encore : ô toi, fils de la force-agressive, veuille tourner maintenant les dieux à nous pour le sacrifice que voici 1 ] Puisse—je,— moi, être tien, être toujours en ta faveur, ô Agni, avec (ton) assis— tance, (en sorte que j’obtienne) des f‌ils—d’élite!",
   "06.050.10": "Et encore : veuillez venir a mon appel, ô vous-célèbres Nâsatya’s, car vous étes (donneurs) de pensées—poétiques, ô inspi— réel] Comme vous délivrâtes Atri de la grande ténèbre, faites (—nous) passer outre au mauvais pas, o seigneurs, a l’instant—— critique !",
   "06.050.11": "Vous encore, soyez (par fonction) des donneurs de richesse brillante, comportant des prix—de—victoire (et) des hommes—utiles,  abondante en bétail !] Rendant justice, (vous dieux) célestes, (vous) terrestres, (vous autres) nés de la vache et (vous enfin) nés des eaux, ayez pitié, dieux !",
   "06.050.12": "Qu’(à leur tour) Rudra, Sarasvati de concert (avec les autres), les dieux) généreux Visnu, Vâyu, aient pitié !] Que Rbhuksan, Väja, le divin Répartiteur, Parjanya—Väta, nous gonflent de jouissances (comme de lait) ! /",
   "06.050.13": "Et encore : que cac—célébre dieu Savitr, Bhaga, le Fils des eaux, nous favorisc(nt), (eux) qui comble(nt) de dons,] Tvastr de concert avec les dieux, (c’est—à—dire) avec les Femmes (divines), le Ciel avec les dieux, la Terre avec les océans !",
   "06.050.14": "Et encore : qu’Ahi abyssal nous entende, Aja unipède, la Terre, l’Océan ! / Que tous les dieux invigorés par l’Ordre, appelés, loués (par des chants, par) des formules que récitent les poètes, (nous) favorisent !",
   "06.050.15": "Ainsi les Bharadväja, mes neveux à moi tel (que ce poème me révèle), chantent à l’aide de pensées—poétiques, de chants./ Les Femmes (divines) auxquelles on fait oblation, les Vasu inaccessibles à l’attaque, tous (dieux enf‌in,) soyez loués, ô vous qui êtes dignes du sacrifice !",
   "06.051.01": "Il surgit ce-célèbre ceiî puissant de Mitra, de Varuna, (oeil) aimé, impossible à tromper./ Le pur visage, beau à voir, de l’Ordre, & resplendi comme un bijou-d’or du ciel, au lever (du soleil).",
   "06.051.02": "Lui qui connaît les trois répartitions qui sont les leurs (et) l’engendrement des dieux, (le Soleil) inspiré (qui voit) au loin et au près,] voyant ce qui est droit chez les mortels et les choses eeurhes, ie Soleil considère les agissements de l’Etranger.",
   "06.051.03": "Je veux vous louer, qui êtes les gardiens de l’Ordre puissant, Aditi, Mitra, Varuna, les. biens—née,] Aryaman, Bhaga (et autres dieux) qui ne déçoivent pas les pensées (humaines), je les appelle à moi, eux qui sont associés, purif‌iants.",
   "06.051.04": "Les maîtres du siège qui veillent sur l’Étranger, rois puissants impossibles à tromper, donateurs de bonne véture,/ jeunes possesseurs de pouvoir—temporei, seigneurs résidants du ciel, les Âditya, Aditi, je les impiore avec (espoir) de gratif‌ication.",
   "06.051.05": "O Ciel pére, ô Terre mère a l’abri du dol, ô Agni frére, ôVasu’s, ayez pitié de nous !] Vous tous Aditya’s, ô Aditi, de concert (avec eux), acmrdez—nous diversement une protection soiide !",
   "06.051.06": "Ne nous livres pas au loup, à la louve, à un être quelconque qui (nous) veut du mal, (dieux) dignes du sacrif‌ice !] Car c’est vous (qui) êtes les eontlucteurs—-de…char de nos corps, vous (qui) avez-toujours—été ceux de la parole eff‌icace.",
   "06.051.07": "Puissionsumus ne pas payer pour le péché commis par autrui, contre vous, ne pas commettre, Ô Vasu’s, cela même que vous faites - rentrer (comme une dette) !] Car vous règnes sur l’univers, €} tous—- dieux. Puisse (l’être) nocif endommager soi—même son corps !",
   "06.051.08": "L’Hommage est formidable, je cherche a gagner l’I—Iommage. L’I—lommage porte la Terre et le Ciel./ Hommage aux dieux! L’Hommage a pouvoir sur eux. Le péché une fois commis, je l’attire (pour le détruire) par l’Hommage.",
   "06.051.09": "Vous les conducteurs-de—char de l’Ordre, aux eff‌icacitéspurif‌iées, siégeant dans la demeure de l’Ordre, (dieux) impossibles  à tromper,] seigneurs qui voyez au loin, je les courbe tous à moi par (mes) hommages, (ces dieux) grands, dignes du sacrif‌ice.",
   "06.051.10": "Eux qui ont en ellet l’éclat le plus beau, ils nous conduisent au—delà de tous les mauvais pas,] (ces dieux) au bon pouvoir— temporel, Varuna, Mitra, Agni, qui ont l’Ordre pour pensée, qui sont vraiment les rois de la parole (sacrale).",
   "06.051.11": "Que ces (dieux), Indra, la Terre, fassent croître notre terroir, (et en outre) Püsan, Bhaga, Aditi, les cinq (espèces d’) Hommes !] Qu’ils nous soient de bonne protection, de bon secours, de bon guidage, eux bons sauveurs, bons gardiens ! '",
   "06.051.12": "Oui, je voudrais accéder au siège céleste, dieux. L’oblateur des Bharadväja implore (votre) faveur.] Avec les dons—rituels située (près de lui), le sacrif‌iant (laïc), qui vise à la richesse, & célébré la génération des dieux. ‘",
   "06.051.13": "(Chasse) au loin ce—Îamcux tourbe, (cet) ennemi, (ce) voleur aux intentions mauvaises, ô Agni ! / 0 maître du siège, fais (en sorte qu’il y ait) bon passage (pour nous) aussi loin que possible de lui !",
   "06.051.14": "En vérité, les pierres (à presser le soma), ô some, ont exprimé leur vouloir pour s’associer avec nous./ Frappe, abats l’Atrin, le Papi : car il est un loup !",
   "06.051.15": "C’est vous, (dieux) aux beaux dons, qui, avec Indre pour chef, étes tournés vers le ciel.] Faites (en sorte que) nous (ayons) bonne marche au cours du voyage, (soyez aussi nos) gardiens à la maison !",
   "06.051.16": "Nous voici arrivés au chemin qui mène au bien—être, qui est libre d’envie,] par lequel (on) évite toutes inimitiés, (on) trouve la richesse.",
   "06.052.01": "Au (nom) du Ciel et de la Terre je ne cède sur ce point, au (nom) du Sacrifice ou des efforts (rituels) que voici :/ que les montagnes bien assises écrasent cet (homme), qu'il soit laissé à l'abandon, celui qui exécuLc un sacrifice-en-surenchère",
   "06.052.02": "Celui qui nous méprise, ô lVIarut's 1 ou encore celui qui blâme (notre) Formule en train de se faire,/ que les fourberies pour lui deviennent (autant) de brûlures, que le Ciel consume celui qui veut du mal à la Formule !",
   "06.052.03": "Que t'ont-ils donc dit de nous, ô soma, toi qui es le gardien de la Formule, oui, quoi donc, toi qui protèges contre la calomnie ? / Pourquoi donc nous regardes-tu (avec indiITérence) pendant qu'on nous blâme ? Lance l'arme de jet brûlante contre celui qui veut du mal à la Formule !",
   "06.052.04": "Me favorisent les aurores qui naissent, me fa-vorisent les fleuves qui gonflent !/ Me favorisent les montagnes solides, me favorisent les pères pour l'appel aux dieux ! 5. Puissions-nous être en tout temps de bonne disposition, voir donc le soleil se lever!/ Fasse ainsi le maître de richesses, (maître) des richesses, qui se prévaut d'être parmi les dieux le mieux venant à l'aide !",
   "06.052.06": "Indra, (car c'est lui qui est) le mieux venant à l'aide, de la façon la plus proche ; Sarasvatl qui gonfle avec les fleuves ;/ Parjanya qui réconforte avec les plantes ; Agni propice (à invoquer par) la récitation, bon à appeler tel un père, (qu'eux tous viennent à) notre (aide)!",
   "06.052.07": "O tous dieux, venez, entendez cet appel de moi ! Asseyez-vous sur cette litière (rituelle)! 8. Celui qui vous assiste, dieux, par l'oblation dont le dos (ruisselle) de beurre-fondu,/ approchez-vous de lui, vous tous!",
   "06.052.09": "Qu'ils entendent nos paroles, eux les Fils du principe-de-vie !/ Qu'ils nous soient compatissants !",
   "06.052.10": "Que tous les dieux, invigorés par !'Ordre, entendant l'appel (fait) scion les rythmes,/ agréent le lait (qui leur est) associé!",
   "06.052.11": "Qu'Indra avec sa cohorte de Marut's, accompagné de Tva;;tr,(ainsi que) Mitra, Aryamai;, agréent/ la laudation, nos oblations que voici !",
   "06.052.12": "Ce cursus-rituel de nous, ô Agni oblateur, exécute-le-sacrificiellement par des arrangements (successifs),/ toi qui connais la gent divine !",
   "06.052.13": "O tous dieux, entendez cet appel de moi, vous qui êtes dans l'espace-médian (ou) sous le ciel,/ vous qui avez Agni pour langue ou encore (vous, dieux) dignes du sacrifice, prenant place sur cette litière (rituelle), réjouissez-vous!",
   "06.052.14": "Que tous les dieux entendent ma prière, eux dignes du sacrifice, (ainsi que) l'un et l'autre Mondes et le Fils des eaux!/ Que je ne dise pas des mots propres à être évités-du-regard par vous! Puissions-nous nous réjouir (en ta11t que) les plus intiines en vos bienveillances !",
   "06.052.15": "(Les dieux) quels qu'ils soient qui sont sur terre, les puissants aux prestiges de dragon (qui sont) au ciel, (ceux enfin) qui naquire11t au séjour-co1nrnun des eaux,/ que ces dieux nous fassent large:;;;sc 1 en sorte que nous jouissions pour l'entière durée-devic des nuits (ee) des aurores!",
   "06.052.16": "O Agni-Parjanya, favorisez mon poème dans (la compétition que marque) l'appel que 'roici, ô vous propices à appeler, (favorisez) notre eulogie !/ Que l'un [Agni] engendre l'oblationliquiclc, l'autre [Parjanya] le germe ! Conférez-nous les jouissances comportant prog·éniture !",
   "06.052.17": "Sur la litière-rituelle jonchée, sur le feu enflammé, avec (ce) grand hymne je cherche à (vous) gagner par un hommage./ Dans ce sacrifice nôtre aujourd'hui, ô vous tous dieux dignes du sacrifice, dans (cette) oblation réjouissez-vous!",
   "06.064.01": "Les Aurores se sont levées brillantes pour être belles, rutilantes comme les vagues des eaux. Elle fait tous les chemins heureux, faciles à la marche; la riche, la généreuse Dakṣiṇā est apparue.",
   "06.064.02": "Tu t'es montrée bénéfique, tu brilles au loin, au large: ton éclat, tes rayons ont pris leur vol vers le ciel. Tu mets à découvert ta poitrine, te faisant belle, Aurore divine qui brilles en ta majesté.",
   "06.064.03": "Les vaches roses, rutilantes, véhiculent la bienheureuse qui s'étend au large. Comme un archer valeureux (chasse) les ennemis, elle chasse les ténèbres, tel un rapide conducteur (du char de guerre).",
   "06.064.04": "(Jusque) dans les montagnes, tes chemins sont heureux, faciles à la marche. (Même) en l'absence de vent tu franchis les eaux, toi dont les rayons (émanent) de toi-même. Ainsi donc, apporte-nous la richesse, Fille du ciel immense, au vaste voyage, afin que nous en tirions jouissance!",
   "06.064.05": "Apporte donc (cette richesse), Aurore insurpassable, toi qui avec les taureaux, apportes selon ton bon plaisir la chose souhaitée! Toi, Fille du ciel, qui, déesse, es belle à voir en ta munificence, lors de l'appel matinal.",
   "06.064.06": "= I. 124, 12",
   "06.065.01": "Voici donc cette Fille (du ciel), née du ciel. En luisant elle a éveillé les établissements humains, elle qui avec son rayon rutilant, dans les nuits (mêmes), s'est laissé discerner par delà les ombres des ténèbres.",
   "06.065.02": "Elles ont passé, ces (ténèbres), avec leurs chevaux attelés de rose. Les Aurores aux chars dorés brillent de manière éclatante. En conduisant la tête du haut sacrifice, elles écartent les ténèbres de la nuit.",
   "06.065.03": "Apportant renom, prix de victoire, jouissance, vigueur nourricière au mortel qui vous adore, Aurores généreuses, conférez à celui qui vous honore, vous qui avez en votre pouvoir des hommes utiles, l'assistance elle trésor, (dès) aujourd'hui!",
   "06.065.04": "Oui, maintenant il existe, (venant) de vous, un trésor pour celui qui vous honore, pour l'homme utile qui vous adore, Aurores; maintenant, pour l'orateur quand il chante des hymnes. Auparavant déjà vous avez apporté (ce trésor) à un homme comme moi.",
   "06.065.05": "Oui, maintenant, Aurore qui détiens le plateau de la montagne, les Aṅgiras chantent tes troupeaux de vaches. Avec le chant, avec la formule sacrale, ils ont fendu (la caverne). L'invite aux dieux s'est avérée (efficace, venant) d'hommes qualifiés.",
   "06.065.06": "Luis pour nous, Fille du ciel, comme autrefois, pour celui qui t'honore, comme (tu fis autrefois pour) Bharadvāja, ô généreuse! Dispense au chantre une richesse faite d'hommes utiles! Ceins-nous d'un renom allant au loin!",
   "07.034.01": "Qu'aille en tête (de mon hommage) la pure Inspirationpoétique, la divine, (partant) de moi, tel un char bien façonné qui gagne le prix-de-victoire !",
   "07.034.02": "Elles savent le lieu de naissance de la terre, du ciel, les Eaux : clics entendent, certes, tandis qu'elles coulent.",
   "07.034.03": "Ce sont les eaux qui ont gonflé pour ce (sacrifice), (les eaux) vastes; dans les (combats contre les) ennemis, elles passent pour des héros formidables.",
   "07.034.04": "Mettez pour ce (sacrifice) les chevaux aux brancards, comme (lait) Indra porte-foudre, aux bras d'or!",
   "07.034.05": "Mettez en marche (ce) sacrifice, comme (le soleil fait) les jours! Propulsez (-le) \\'OUs-mên1es pour l'envol, comme un qui va (dans les airs) !",
   "07.034.06": "Propulsez (-le) vous-mêmes dans les mêlées (compétitives),mettez le sacrifice comme emblème, (tel) un être-d'élite pour le (commun des) homme(s) !",
   "07.034.07": "(Le sacrifice) a surgi comme un rayon (de lumière) hors de son crépitement (de fumée). Il porte la charge, comme la terre (porte) le sol.",
   "07.034.08": "J'appelle les dieux sans (user de) sorcellerie, ô Agni; je compose un poème, (y) réussissant à l'aide de !'Ordre.",
   "07.034.09": "Attelez-vous le poème divin, mettez le discours en avant de vous, (en sorte qu'il se Loume) du côté des dieux!",
   "07.034.10": "Varuna le formidable regarde le territoire de ces rivières, lui r(le dieu) aux mille reg·ards,",
   "07.034.11": "(Il est) roi des royaumes, parure des rivières; à lui a été ·Concédé le pouvoir-temporel, pour toute durée-de-vie.",
   "07.034.12": "Favorisez-nous dans toutes les tribus, rendez sans éclat la récitation de celui qui veut (vous) critiquer!",
   "07.034.13": "Que s'écarte la foudre (, arme) sinistre de ceux qui (nous) veulent du mal! Chassez en tous sens l'avarie (physique, menace) pour nos corps !",
   "07.034.14": "Qu'Agni favorise nos oblations! Avec hommages a été déposée pour lui la louange la plus aimée (de lui).",
   "07.034.15": "De concert avec les dieux, faites du Fils des eaux (notre) associé ! Qu 'il nous soit bienveillant !",
   "07.034.16": "Je veux chanter avec des hymnes Ahi né dans les eaux ; (Ahi) qui siège au fond des rivières, dans les espaces-sombres.",
   "07.034.17": "Qu'Ahi abyssal ne nous place pas dans le dommage, que le sacrifice de ce (chantre) voué à !'Ordre ne subisse pas d'échec!",
   "07.034.18": "Et encore : qu'auprès de ces seigneurs (les dieux) nous confèrent une distinction, qu'ils avancent pour (nous donner) la richesse, en faisant fi de !'Étranger !",
   "07.034.19": "(Les dieux) brûlent l'ennemi comme la lumière-solaire (brûle) la terre, eux avec leur grande armée, avec leurs élansfurieux.",
   "07.034.20": "Quand viennent à nous les Épouses (des dieux), alors que Tvaëtr à la main habile (nous) confère des fils-d'élite!",
   "07.034.21": "Puisse Tvaëtr se complaire à notre louange ! Puisse Aramati ricl1c en biens être en nous !",
   "07.034.22": "Que les (déesses) accompagnant le don nous fassent présent de ces biens, que Rodasl, Varur.1anl nous cntende(nt) !/Que Tvaëtr nous soit de bon refuge avec les (déesses) protectrices, que le bon répartiteur distribue les richesses !",
   "07.034.23": "Qu'aiusi nous (aident) les Richesses, les Montagnes, ainsi nous (aident) les Eaux, ainsi les (déesses) accompagnant le don, les Plantes et aussi le Ciel,/ la Terre avec les Arbres de la forêt, de concert; que l'un et l'autre lVIondes nous protègent tout autour!",
   "07.034.24": "Qu'ainsi les deux vastes Mondes acquiesèent, ac(quiesce) Varur:ia résidant au ciel, avec Indra pour allié!/ Ac(quiescent) tous (les dieux,) les Marut vigoureux! Puissions-nous être (tels) que le fondement de la richesse s'établisse (en nous) !",
   "07.034.25": "Qu'ainsi Indra, Varm;ia, Mitra, Agni, les Eaux, les Plantes, les Arbres nous donnent leur agrément !/ Puissions-nous être dans la garde des Marut, en leur giron ! (Vous, protégez-nous toujours de vos bénédictions !)",
   "07.035.01": "Heur nous soient Indra-Agni avec (leurs) faveurs, heur nous soient Indra-Varm;ia à qui l'on donne l'oblation!/ Heur Indra-Soma pour (notre) bon passage, heur et profü à nous Indra-Pliëa'.l pour que (nous) gagnions le prix-de-victoire!",
   "07.035.02": "Heur nous soit Bhaga et heur nous soit la Récitation, heur nous soit la Plénitude et heur soient les Richesses ! / Heur nous soit la Récitation d'(une pensée) vraie, propice à régler, heur nous soit AryamaI). aux nombreuses naissances !",
   "07.035.03": "Heur nous soit ]'Ordonnateur et heur le Mainteneur, heur nous soit (la Terre) qui s'étend au loin avec ses autonomies!/ Heur les deux puissants Mondes, heur nous soit la Pierre (à soma), heur nous soient les appels propices (faits) aux dieux!",
   "07.035.04": "Heur nous soiL Agni au visage de lumière, heur nous soient Varur.ia-Mitra, heur les Asvin !/Heur nous soient les bienfaits des (dieux) bien-faisants, heur nous souffle le Vent revigorant!",
   "07.035.05": "Heur nous soient le Ciel, la Terre, pour l'appel matinal! Heur soit pour nous l'Espace-médian, en sorte que nous (le) voyions !/ Heur soient pour nous les plantes, les arbres, heur soit pour nous le maitre de l'espace, le (dieu) victorieux!",
   "07.035.06": "Heur nous soit le dieu Indra avec les Vasu, heur avec les ÂdiLya Varm;ia, propice à (invoquer par) la récitation!/ Heur nous soit Rudra avec les Rudra, le (dieu) guérisseur; pour (notre) heur nous en Len de ici Tvaëtr avec les Femmes (divines) !",
   "07.035.07": "Heur nous soit Soma, heur nous soit la Formule,/ heur nous soient les Pierres (presseuses) et heur les. Sacrifices!/ Heur nous soient les édifications de piliers (rituels), heur nous soient les végétaux et.heur l'autel!",
   "07.035.08": "Pour notre heur que le soleil, qui voit au loin, se lève, heur nous soient les quatre oricnLs-principaux !/ Heur nous soient les montagnes solides, heur nous soient les fleuves et heur les eaux !",
   "07.035.09": "Heur nous soit Aditi avec les voeux (divins dont elle a la garde), heur nous soient les Marut aux beaux chants!/ Heur nous soit Vi9:r:i-u Bt heur nous soit Pü9ar.i, heur nous soiL le séjour-desexistcnccs et heur le vent!",
   "07.035.10": "Heur nous soit le dieu Savitr qui protège, heur nous soient les aurores qui brillent!/ Heur nous soit Parjanya (ainsi qu') à (nos) enfants, heur nous soit le Maître du terroir, le bénéfique!",
   "07.035.11": "Heur nous soient les dieux, les tous-dieux (parmi eux), heur soit Sarasvatl avec les inspirations-poétiques!/ Heur les (divinités) escorteuses et heur les (divinités) accompagnant le don, heur nous soient les (dieux) célestes, terrestres, heur nous soient ceux des eaux !",
   "07.035.12": "Heur nous soient les Maitres de (la parole) vraie, heur nous soient les coursiers et heur les vaches !/ Heur nous soient les l}bl1u aux bons actes, aux bonnes mains, heur nous soient les Pères  pour les appels (faits aux dieux) !",
   "07.035.13": "Heur nous soit Aja unipède, le dieu, heur nous soit Ahi abyssal, heur !'Océan!/ Heur nous soit le Fils des eaux, le fécondateur 1 heur nous soit PrSni qui a des dieux pour gardiens !",
   "07.035.14": "Que les Aditya, les Rudra, les Vasu agréent cette Formule en train de se faire, toute nouvelle!/ Nous entendent les (dieux) célestes, terrestres, ceux nés de la vache ainsi que ceux propres au sacrifice !",
   "07.035.15": "Ceux des dieux propres au sacrifice qui sont (plus particulièrement) propres au sacrifice, qui sont adorables pour l'Homme, immortels, connaisseurs de !'Ordre,/ que ceux-là nous fassent présent aujourd'hui de (l'espace apte à) une longue marche! (Vous, protégez-nous, etc.).",
   "07.036.01": "Qu'aille en tête (cette) Formule, (émanant) du siège de !'Ordre! Le soleil a lâché en tous sens les vaches par ses rayons./ La terre avec son dos s'est déhiscée, (toute) large ; vaste surface, le feu (rituel) a été enflammé.",
   "07.036.02": "Ce beau poème, ô Varul.la-Mitra, je le compose pour vous comme un mets-savoureux, ô Maitres, selon (une forme) nouvelle./ L'un de vous deux [Varul.la] est un valeureux frayeur de voie; (c'est le dieu) impossible à tromper. L'autre [Mitra] engage les hommes, s'appelant (par suite le dieu) Contrat.",
   "07.036.03": "Les courants du vent qui fonce s'arrêtent; les mares (qui) avaient gonflé comme des vaches-laitières (s'arrêtent aussi de gonfler)./ Au siège du grand ciel, le taureau (Parjanya, sitôt) né, a mugi dans la mamelle même.",
   "07.036.04": "(L'homme) qui par la parole est apte à atteler ces deux alezans bien-aimés de toi, ô Indra, (attelés) d'un beau char, riches en dons, ô héros, (qu'il vienne à nous!)/ Puissé-je tourner à moi, tout d'abord, Aryamai:i au bon conseil, lui qui rend inane la fureur de l'homme visant à détruire !",
   "07.036.05": "(Les hommes) pleins de respect se procurent-en-sacrifiant l'alliance et la force de cc (dieu Rudra), dans sa propre fonction (par rapport) à !'Ordre./ li a désengagé les jouissances-comblantes, (une lois qu'il a eu été) loué par les seigneurs. Que cet hommage soit le plus cher à Rudra !",
   "07.036.06": "Quand ar(rivent) ensemble (les Rivières) renommées, riches en désirs, (avec) Sarasvatl en septième, qui a Sindhu pour mère,/ (ces rivières) qui enfantent, propices à traire, au beau courant, qui gonflent de leur propre eau-gonflante,",
   "07.036.07": "Et encore : ces-célèbres Marut, qu'ils favorisent, étant réjouis, notre pensée-poétique et (notre richesse en) en!ant(s), eux qui (donnent) les prix-de-victoire !/ Que ne passe pas sans nous voir la vache qui va (pâturant) !/ Ces (dieux) ont accru la richesse qui nous est allouée.",
   "07.036.08": "Mettez en tête de votre (hommage) la grande Aramati, en tête Pü9ai:i tel un être-d'élite qualifié pour la répartition (sacrificielle),/ (ainsi que) Bhaga favoriseur de ce poème-ci (et enfin) Purarμdhi accompagnatrice du don, en sorte que (nous obtenions) le gain du prix-de-victoire !",
   "07.036.09": "Jusqu'à vous aille la rumeur (de) cet (hymne), ô Marut's, jusqu'à Vi9i;iu qui de (ses) faveurs protège le (sperme) déversé! Et qu'ils confèrent la force à (notre) progéniture, au chantre! (Vous, protégez-nous, etc.)",
   "07.037.01": "Vous conduise ici le char (qui soit) le meilleur conducteur, (le char) immanquable, ô Vaja's, ô l,).bhuk9ai:i's, afin que (vous) soyez loués ! / Emplissez-vous puissamment des soma à triple dos, en vue des (trois) pressurages, en vue de l'ivresse, ô vous (dieux) au beau casque !",
   "07.037.02": "C'est vous qui conférez aux (patrons) libéraux un trésor immanquable, ô l,).bhuk9a,1's qui voyez la lumière-solaire./ Buvez en comn1un dans les sacrifices, (dieux) autonomes, distribuez-nous, les bienfaits (selon la valeur) de (nos) pensées-poétiques!",
   "07.037.03": "Car tu as coutume de donner, ô libéral (Indra), lors du partage d'un bieu, grand (ou) petit./ Tes deux mains sont pleines de bien(s). La générosité (est le propre de celui qui) ne retient pas (par devers soi) l'abondance-en-biens.",
   "07.037.04": "O Indra, toi qm es (en même temps un) l}bhuk9ai:i, (dieu) dont le renom (naît) spontanément, tu t'en retournes chez Loi comme un Vâja heureux, riche en strophes./ Quant à nous, puissionsnous être tes dignes-adorateurs, faisant une Formule (décisive), ô possesseur d'alezans, nous les Vasi~tJ1a !",
   "07.037.05": "Tu as coutume (, ô Indra), de gagner la course pour ton adorateur même, grâce à (ses) poèmes par quoi tu es mis en branle, ô possesseur de chevaux alezans./ Nous avons donc gagné par tes  faveurs (à nous) allouées. Quand, ô Indra, daigneras-tu nous gratifier (d'une part) de richesses?",
   "07.037.06": "Tu nous fais statio11ner, semble-t-il, toi, nous qui sommes (tes) fidèles. Quand, ô Indra, feras-tu attention à notre discours?/Puisse le coursier porteur des prix charrier chez nous, grâce au  don-poétique (fruit de l'héritage) paternel, une richesse faite d'hommes-d'élite (et) des jouissances-comblantes?",
   "07.037.07": "Bien que la déesse Néantise ait barre sur lui-même, les automnes comblantes approchent Indra./ Tribandhu, que les mortels ont rendu sans clientèle, arrive près de (ce dieu) qui a atteint la vieillesse.",
   "07.037.08": "Viennent à nous les bienfaits, ô Savitr, en sorte d'être les objets de (ma) louange, à (nous) les richesses de la montagne, en guise de dotation !/ Que toujours nous accompagne le gardien céleste ! (Vous, protégez-nous, etc.).",
   "07.039.01": "Haut-dressé, Agni a planté (comme un pilier) la pensée favorable du Vasu. La flamme va, tournée vers le domaine-divin./ Les deux pierres (à presser le soma) ont pris le chemin (de !'Ordre), comme (vont) deux conducteurs-de-char. Que l'oblateur mis en branle dise la yajyii pour nous (selon) !'Ordre !",
   "07.039.02": "A été rabattue la litière (rituelle), propice à aborder, de ces (dieux). Comme deux chefs de clan dans !'arroi des clans,/ Vayu (et) Pu9ai:i se hâtent, lors de l'éclairement de l'aurore, pour l'appel matinal : bien-être (soit à nous!) (C'est Vâyu avec) son attelage.",
   "07.039.03": "Qu'ici les dieux (qui vont) sur terre, (à savoir) les Vasu, se reposent ; que dans le vaste espace-médian ils se parent (afin d'être) brillants!/ Faites votre chemin de ce côté-ci, (dieux) au vaste cours ! Entendez ce messager de nous qui est venu (près de vous)!",
   "07.039.04": "Car ces (dieux)-là, dignes d'être adorés dans les sacrifices, auxiliaires, tous sont présents au séjour commun (du rite)./ Sacrifie leur dans le cursus-rituel, ô Agni, eux consentants, (sacrifie) avec obéissance à Bhaga, aux Nasatya, à Purarμdhi !",
   "07.039.05": "O Agni, amène ici vers (mes) paroles (les dieux qui viennent) du ciel, de la terre, Mitra, Varm:ia, Indra, Agni,/ a(mène) Aryamal_l, Aditi, Vi~1w, (vers ces paroles faites) sur eux! Que Sarasvatl, que les lYiarut se réjouissent !",
   "07.039.06": "J'ai offert l'oblation avec des prières aux (dieux) aptes au sacrifice: qu' (Agni) libre d'attaches atteigne le souhait des mortels!/ Conférez (-nous) la richesse inépuisable, toujours gagnante l Puissions-nous en vérité être accompagnés des dieux (qui nous sont natmellemcnt) associés !",
   "07.039.07": "Voici donc les Deux Mondes célébrés par les Vasi~tha, (ainsi que les dieux) possédant !'Ordre,. Varul_la, Mitra, Agni./ Que (ces dieux) lumineux nous inspirent le chant le plus proche! (Vous, protégez-nous, etc.)",
   "07.040.01": "Qu'ici vienne confluer l'exaucement propre au sacrifice! Nous voulons commencer la louange des (dieux) forts./ S'il est vrai qu'aujourd'hui le dieu Savitr suscite (des richesses pour nous), nous voulons être (présents) à sa distribution, (en sorte de devenir) possesseurs de trésors.",
   "07.040.02": "Qu'ainsi Mitra, Varul_la et les Deux Mondes nous donne(nt) (le trésor) distribué par le ciel, (et aussi) Indra, Aryamal_l !/Que la déesse Aditi (nous) assigne pour legs ce qne et Va yu et Bhaga attelleront (à leur char)!",
   "07.040.03": "Qu'il soit seul formidable, ô Marut, qn'il soit fougueux, le n1ortcl que vous favoriserez, ô vous aux chevaux bigarrés !/ Et encore : Agni, SarasvatI (et autres) l'incitent, nul n'est en mesure de dépasser les richesses de cet (homme).",
   "07.040.04": "C'est en effet ce (dieu) Varul_la, conducteur (du char) de !'Ordre, Mitra, Aryamal_l, (tous) rois (du ciel, qui) font les oeuvres (que nous voyons),/ (et aussi) la déesse Aditi propice à invoquer, inattaquable. Qu'eux (tous) nous fassent passer outre à la détresse, (en sorte que nous soyons) inaccessibles an dommage!",
   "07.040.05": "L'accommodement à ce dieu libéral, à Vi~I_ln rapide, (a lieu) au cours de !'offerte, par les oblations./ Car Rudra est connn (comme ayant) la majesté rudraïque. Courez votre circuit, ô ASvin's, riche en jouissanccs-oblatoires l",
   "07.040.06": "O Pü~al_l irritable, ne sois pas envieux à ce sujet, si la Protectrice et les (déesses) accompagnant le don font des présents!/ Que nous gardent les coursiers réconfortants, que le vent circulant tout autour donne la pluie!",
   "07.040.07": "= 39,7",
   "07.042.01": "En tète (de mon hommage) que s'approchent les brnhma(i Aùgiras', en tête s'élauce.le fracas du (soma) irruptcur !/ En tête que mugissent les vaches-laitières [ = le lait ajouté au soma] flottant dans l'eau! Veuillent les deux pierres (presseuses) atteler (le soma), parure du cursus-rituel !",
   "07.042.02": "Propice à suivre, ô Agni, connu de vieille date, est ton trajet. Attelle pour (le soma) pressé les alezanes et les (juments) rouges,/ ou bien (les chevaux) bais (qui sont) au siège (du sacrifice), porteurs de guerriers ! Assis (là), j'appelle les engendrements des dieux.",
   "07.042.03": "(Les chanteurs) magnifient votre sacrifice par des hommages, (mais) l'oblateur (divin, Agni) à la voix-harmonieuse l'a emporté (sur tous les autres) de manière évidente./ Sacrifie donc aux dieux, (ô Agni) aux visages multiples! Puisses-tu faire tourner de ce côté Aramati, (déesse) digne du sacrifice !",
   "07.042.04": "Quand, dans la demeure d'un riche personnage, l'hôte (Agni) sera mis en évidence, reposant sur la bonne couche,/ Agni satisfait, convenablement placé dans la maison, donnera un (bienfait) délectable à une tribu telle que la nôtre.",
   "07.042.05": "Agrée, ô Agni, ce cursus-rituel nôtre, fais en sorte qu'il se distingue pour nous en présence des Marut, d'Indra !/ Que la Nuit, l' Aurore, prennent place sur la litière ! Sacrifie ici à Varm:iaMitra consentants !",
   "07.042.06": "Ainsi Vasi~tha, désireux d'une richesse (comportant) toutes sortes de biens, vient de louer le puissant Agni./ Que (celui-ci étende pour nous la prospérité, la richesse, le prix ! (Vous, protégcznous, etc.).",
   "07.043.01": "En tête (de mon hommage) je veux que les (hommes) pieux chantent dans les sacrifices, le Ciel, la Terre avec hommage, en sorte que (nous) en tirions profit,/ (ces hommes) dont les Formules incomparables, inspirées, circulent en divers sens, co1nmc (vont) les branches de l'arbre.",
   "07.043.02": "Que le sacrifice se mette en marche, comme un chevald'altelage propre à l'aiguillon! Levez d'un même coeur les (cuillers) marquées par le beurre-fondu!/ Jonchez la litière pour le cursus- rituel, correctement! Les flammes se tiennent droites, (comme si}elles tendaient aux dieux.",
   "07.043.03": "Comme des fils (en âge) d'être portés (par) leur mère, les. dieux veuillent prendre place sur la surface de la litière !/ Que la (cuiller) qui se meut en tous sens oigne (la troupe des dieux) arrivant au sacrifice ! 0 Agni, ne nous laisse pas en carence du côté des dieux!",
   "07.043.04": "Ils se laissent adorer à (notre) gré, ces (dieux) dignes du sacrifice, qui ont tété les coulées de !'Ordre, bonnes à traire./ V cnez aujourd'hui vers ·votre plus puissante manifestation-degrandeur à vous Vasu's, (venez) d'un même coeur, (tous) tant que vous êLes !",
   "07.043.05": "Ainsi, ô Agni, traite-nous-dignement dans les tribus, nous (autres) qui te sommes attachés, ô (dieu) doué de force,/ (en sorte que nous soyons) joints à la richesse, nous réjouissant ensemble (avec les dieux), exempts de dommage! (Vous, protégez-nous, etc.).",
   "07.075.01": "L'Aurore, née au ciel, a lui au loin selon l'Ordre (cosmique); elle est venue, mettant à découvert sa majesté. Elle a dévoilé les maléfices, les ténèbres déplaisantes. La plus Aṅgiras (des Aṅgiras) a éveillé les chemins.",
   "07.075.02": "Sois-nous aujourd'hui à grande chance, Aurore! Fais-nous don d'une grande bonne fortune! Confère-nous la richesse éclatante, distinctive, qui crée le renom parmi les mortels, ó déesse humaine!",
   "07.075.03": "Voici ces rayons éclatants de l'Aurore belle à voir, ils sont venus immortels. Engendrant les ordonnances divines, ils se sont répandus emplissant les espaces aériens.",
   "07.075.04": "La voici qui, ayant attelé (son char) d'un (domaine) lointain, entoure en marchant les cinq établissements (humains), d'un seul jour, considérant les signes démarcateurs des hommes, elle la Fille du ciel, la maîtresse de la création.",
   "07.075.05": "La jeune femme du soleil, porteuse des prix, aux bienfaits éclatants, elle règne sur la richesse et sur les biens. Louée par les Sages, l’Aurore généreuse qui éveille (le monde) luit, chantée par les guides (du rite).",
   "07.075.06": "Les chevaux fauves se sont montrés, éclatants, véhiculant l’Aurore étincelante. La belle va sur le char tout orné. Elle apporte un trésor à l'homme qui l'honore.",
   "07.075.07": "Vraie avec les vrais, grande avec les grands, déesse avec les dieux, adorable avec les adorables... Qu'elle brise les forteresses, en donnant des vaches! Les vaches ont mugi à l'encontre de l'Aurore.",
   "07.075.08": "Ainsi donc, confère-nous un trésor fait de vaches, d'hommes utiles, Aurore, fait de chevaux, très riche en jouissances! Ne rends pas notre litière rituelle sujette au blâme de la part des hommes! (Protégez-nous toujours avec vos bénédictions!)",
   "07.076.01": "Vers (le ciel) Savitr̥ a érigé la lumière immortelle propre à tous les humains, lui le dieu propre à tous les hommes qualifiés. L'œil des dieux est né selon son inspiration. L'Aurore a rendu manifeste l'univers entier.",
   "07.076.02": "Les chemins menant aux dieux me sont devenus visibles, les impeccables, mis en état par les dieux. Le signal lumineux de l'Aurore est présent à l'orient. Elle est venue à notre encontre, (sortant) de ses palais.",
   "07.076.03": "Nombreux furent ces jours en vérité qui (surgirent) autrefois, au lever du soleil, à la suite desquels tu t'es montrée, Aurore, t'approchant comme vers un amant, non point comme une qui s'en va.",
   "07.076.04": "Ils étaient en vérité les commensaux des dieux, (ces) Poètes antiques voués à l'Ordre. Les Pères ont découvert la lumière cachée; réalisant les formules, ils ont engendré l'Aurore.",
   "07.076.05": "Rassemblés autour de l'enclos commun, ils sont en accord, ils ne se font pas obstacle réciproquement; ils n'enfreignent pas les ordonnances des dieux, (ces Pères) impeccables qui s'unissent aux dieux.",
   "07.076.06": "Les Vasiṣṭha t'invoquent à leur tour par les chants de louange, ô bienheureuse, eux qui s'éveillent à l'aurore, te louant. Conductrice des vaches, maîtresse des prix, luis pour nous, Aurore bien née, éveille-toi la première!",
   "07.076.07": "Voici la conductrice du bienfait, des libéralités, l'Aurore qui luit est chantée par les Vasiṣṭha, nous procurant la richesse au loin fameuse. (Protégez-nous...).",
   "07.077.01": "Elle a resplendi vers (nous) comme une jeune femme, incitant à marcher tout ce qui est vivant. Agni est à allumer par les hommes. Elle a fait la lumière, refoulant les ténèbres.",
   "07.077.02": "Faisant face à tout, elle s'est dressée, en (toute) son extension. Portant un vêtement rutilant, elle a brillé d'un clair (éclat). De couleur d'or, d'apparence belle à voir, mère des vaches conductrice des jours, elle a resplendi.",
   "07.077.03": "Bienheureuse, portant le regard des dieux, conduisant le cheval blanc, beau à voir, l'Aurore est apparue, teinte des rayons (du soleil). Avec ses bienfaits éclatants, elle s'est répandue à travers tout (l'univers).",
   "07.077.04": "Ayant tes faveurs tout près, au loin (chasse en) brill(ant) l’ennemi! Fais-nous un vaste pâturage, une (vaste) sécurité! Écarte l’hostilité, apporte les biens, suscite le bienfait pour qui te chante, ô généreuse!",
   "07.077.05": "Rayonne pour nous avec tes plus beaux rayons, Aurore divine, en prolongeant notre durée de vie! Et, nous conférant la jouissance, ô toi qui as toutes choses désirables, ainsi que le bienfait consistant en vaches, chevaux, chars!",
   "07.077.06": "Fille du ciel, toi que les Vasiṣṭha invigorent par leurs poèmes, Aurore bien née, confère-nous donc la richesse immense, haute! (Protégez-nous...).",
   "07.078.01": "Les premiers signes lumineux se sont montrés à l'encontre (des hommes); les ornements de l' (Aurore) se dressent haut en se dif(fusant). Aurore, sur ton haut char tourné vers nous, plein de lumière, apporte-nous des choses agréables.",
   "07.078.02": "Le feu enflammé s'éveille à sa rencontre, à sa rencontre les orateurs chantant par leurs poèmes. L'Aurore marche, refoulant par la lumière toutes les ténèbres, (tous) les dangers, la déesse.",
   "07.078.03": "Voici que se sont montrées à l'encontre (des hommes) les Aurores brillantes, offrant la lumière. Elles ont engendré le soleil, le sacrifice, le feu. Les ténèbres s'en sont allées vers l'occident, les déplaisantes.",
   "07.078.04": "La Fille du ciel généreuse s'est signalée. Tous voient l'Aurore brillante. Elle a monté le char qui s'attelle par sa propre loi, celui que tirent les chevaux bien attelés.",
   "07.078.05": "Nos (patrons) généreux, bien disposés, se sont éveillés à ton encontre aujourd'hui, ainsi que nous-mêmes. Montrez-vous fertiles, Aurores brillantes, (protégez-nous...)!",
   "07.079.01": "L'Aurore a illuminé les chemins des hommes, en éveillant les cinq établissements humains. Avec ses taureaux beaux à voir elle a érigé son rayon. Le soleil a dévoilé les deux mondes par son regard.",
   "07.079.02": "Les Aurores décorent diversement les nuits aux confins du ciel. Comme des tribus attelées (pour la guerre), elles se mettent en ligne. Tes vaches font s'enrouler les ténèbres. Elles tiennent la lumière (haute) comme Savitr̥ (tient haut) ses bras.",
   "07.079.03": "L'Aurore est ici, la plus (semblable à) Indra. Généreuse, elle a engendré les renommées pour le bien-être (des hommes). La divine Fille du ciel, la plus (semblable aux) Aṅgiras, répartit les biens pour celui qui agit correctement.",
   "07.079.04": "Aurore, donne-nous autant de bienfaits que tu en traças aux chantres (jadis) quand tu fus louée (par eux), eux qui t'engendrèrent par le mugissement du taureau. Tu ouvris les portes de la montagne fermée.",
   "07.079.05": "Aiguillonnant dieu après dieu en vue du bienfait, suscitant les libéralités à notre égard, fais en sorte, en luisant au loin, que nos pensées soient gagnantes! (Protégez-nous...).",
   "07.080.01": "Avec leurs louanges, leurs chants, les Vasiṣṭha, les orateurs, se sont éveillés les premiers à l'encontre de l'Aurore: elle qui déroule les deux espaces contigus, en mettant à découvert toutes les créatures.",
   "07.080.02": "La voici qui, assurant une durée de vie nouvelle, l'Aurore, s'est éveillée en cachant les ténèbres par la lumière. La jeune femme va en tête, sans fausse honte. Elle a rendu distinctifs le soleil, le sacrifice, le feu.",
   "07.080.03": "Puissent les Aurores bienheureuses luire toujours pour nous, elles qui ont chevaux, vaches et hommes utiles, trayant pour nous de toutes parts le (lait qui donne le) beurre fondu, elles gonflées de lait! (Protégez-nous...).",
   "07.081.01": "La Fille du ciel, en arrivant, s'est montrée, luisant, à l'encontre (des hommes). Elle écarte le voile des grandes ténèbres, afin qu'on voie (clair). La belle fait la lumière.",
   "07.081.02": "Le soleil émet les vaches en même temps qu'il se lève, astre flamboyant. A ton éclairement, Aurore, et à celui du soleil, puissions-nous rencontrer notre part (de nourriture)!",
   "07.081.03": "Nous nous sommes éveillés à ton encontre, ô Fille du ciel, Aurore vivace, toi qui apportes nombre de choses souhaitées, ô gracieuse, (ainsi que) la jouissance aimable, telle un trésor pour l'adorateur.",
   "07.081.04": "Toi qui en luisant fais discerner (les choses) avec munificence, ô grande déesse, (qui fais) voir la lumière solaire, nous t'implorons à cet (effet), nous qui avons part au trésor. Puissions-nous être (pour toi) comme des fils pour leur mère!",
   "07.081.05": "Apporte donc le bienfait éclatant, qui crée le plus de renom au loin! Ce que, ô Fille du ciel, tu as de nourriture pour le mortel, donne-le, que nous en soyons nourris!",
   "07.081.06": "(Qu'elle apporte) aux patrons le renom immortel, la possession des biens! A nous les prix consistant en vaches! Qu'aiguillonnant les généreux (donateurs), l'Aurore libérale écarte en luisant les maléfices!",
   "09.001.01": "De la plus agréable-au-goût, de la plus enivrante coulée clarifie toi ô soma/ pressé, pour Indra, pour qu'il boive !",
   "09.001.02": "(Le soma) qui frappe les démons, (qui s'est répandu) sur tous les peuples, (s'est dirigé) vers (son) séjour-natal façonné par le fer, / (le récipient) en bois ; il s'est installé (ainsi en son) siège.",
   "09.001.03": "Sois (ô soma) celui qui confère au mieux le large-espace, (sois) le plus généreux, le Vr̥trahaṇ par excellence;/ comble la faculté-de-donner des patrons-généreux !",
   "09.001.04": "Coule pour (répondre à) l'invite (faite) aux grands dieux, (coule) avec (ton) jus, / pour (procurer) prix-de-victoire ainsi que renom !",
   "09.001.05": "C'est vers toi que nous marchons, tel (étant notre) but même, jour après jour ; / ô suc-de-soma, en toi (demeurent) nos espoirs.",
   "09.001.06": "La Fille du soleil clarifie ton soma qui se répand tout autour,/ à travers (le tamis en) poil(s de brebis), d'un train perpétuel.",
   "09.001.07": "Le saisissent pour la compétition les dix (doigts, ces) menues jeunes-femmes,/ (les dix) sœurs, au (point) décisif (du) jour;",
   "09.001.08": "(ces) vierges le mettent-en-branle, elles soufflent l'outre de bakura,/ (elles traient) la liqueur triplement protectrice.",
   "09.001.09": "Ce nourrisson, les vaches elles aussi, les vaches-laitières le fortifient-par-mélange,/ lui le soma, pour Indra, pour qu'il boive.",
   "09.001.10": "C'est dans les ivresses de ce (soma qu') Indra frappe tous les ennemis,/ et (que ce dieu) héros donne-généreusement les dons-généreux.",
   "09.002.01": "Clarifie toi, ô soma qui convies les dieux, (en passant) à travers le filtre, avec rapidité ;/ pénètre en Indra (comme) un taureau, ô suc-de-soma!",
   "09.002.02": "Galope vers (nous) ici, grand festin, ô suc-de-soma (qui es un) taureau plein d'éclat ;/ installe toi en (ton) séjour-natal, (toi qui es) ferme (en tes assises) !",
   "09.002.03": "(Le soma) a été trait (en donnant pour lait) la liqueur aimée, coulée de (soma) pressé, de (soma) ordonnateur (du culte)./ Il s'est revêtu d'eau, (en sa) bonne force-délibérante.",
   "09.002.04": "De toi (ô soma) qui es grand, les eaux, grandes (elles-mêmes), les fleuves, coulent (tout) au long,/ quand tu dois-être-revêtu (du lait) des vaches.",
   "09.002.05": "L'océan (de soma) a été nettoyé dans les eaux ; étai, fondement du ciel,/ le soma dans le filtre, lui qui nous est favorable,",
   "09.002.06": "il a mugi (en) taureau, l'alezan, grand, visible (à tous) comme Mitra ; /il brille avec le soleil.",
   "09.002.07": "Les chants (qu'on) t'(adresse), actifs, ô suc-de-soma, sont nettoyés-puissamment grâce à (ta) force-formidable,/ (ces chants) dont tu t'embellis pour l'ivresse.",
   "09.002.08": "C'est toi que nous invoquons pour l'ivresse frémissante, toi qui crées l'espace./ Tes laudations sont grandes.",
   "09.002.09": "Pour nous-mêmes, ô suc-de-soma qui es voué à Indra, clarifie toi avec la coulée de liqueur,/ tel Parjanya le porteur de pluie !",
   "09.002.10": "Tu es un gagnant de vaches, ô suc-de-soma, un gagnant d'hommes-d'élite, un gagnant de chevaux et enfin un gagnant de prix ;/ (tu es) l'essence primordiale du sacrifice.",
   "09.003.01": "Voici le dieu immortel (qui) vole comme un (oiseau) ailé,/ pour s'installer dans les cuveaux-de-bois.",
   "09.003.02": "Voici le dieu fabriqué par la parole-inspirée, (qui) court à travers les obstacles, /Pavamāna, impossible à tromper.",
   "09.003.03": "Voici le dieu Pavamāna (qui) est nettoyé par les panégyristes/ épris-du-r̥ta, (le dieu) alezan, en vue du prix-de-victoire.",
   "09.003.04": "Voici (qu')il cherche à gagner toutes choses délectables, tel un héros partant/ avec les guerriers, lui Pavamāna.",
   "09.003.05": "Voici le dieu (qui) va en char, Pavamāna (qui) honore (les fidèles de ses dons) ; / il rend manifeste la résonance (du soma qu'on prépare).",
   "09.003.06": "Voici le dieu célébré par les poètes-inspirés, (qui) plonge dans les eaux,/ conférant des joyaux à l'adorateur.",
   "09.003.07": "Voici (qu') il parcourt le ciel à travers les espaces-troubles, en (sa) coulée,/ lui Pavamāna qui mugit-puissamment.",
   "09.003.08": "Voici (qu') il a franchi le ciel à travers les espaces-troubles,/ (ce dieu) invincible,/ Pavamāna, profitable au sacrifice.",
   "09.003.09": "Voici le dieu (qui), selon l'engendrement antique, coule pour les dieux,/ (ce soma) pressé, alezan, dans le filtre.",
   "09.003.10": "Et voici le-célèbre (dieu) aux vœux multiples, (qui sitôt) né, faisant naître (à son tour) les jouissances,/ se clarifie avec (sa) coulée, (le soma) pressé.",
   "09.004.01": "Gagne et conquiers, ô soma, ô Pavamāna, le grand renom (pour nous),/ et ainsi fais nous plus riches !",
   "09.004.02": "Gagne (pour nous) la lumière, gagne le soleil et toutes bonnes fortunes, ô soma,/ et ainsi...",
   "09.004.03": "Gagne (pour nous) force-agissante et force-délibérante, re(foule), ô soma, (et) frappe les ennemis,/ et ainsi...",
   "09.004.04": "O clarificateurs, clarifiez le soma pour Indra, pour qu'il boive,/ et ainsi...",
   "09.004.05": "Toi(-même, ô soma), donne-nous part au soleil, grâce à ta force-délibérante, à tes assistances,/ et ainsi...",
   "09.004.06": "Grâce à ta force-délibérante, à tes assistances, puissions-nous voir longtemps le soleil,/ et ainsi...",
   "09.004.07": "Coule, ô soma bien armé, pour (procurer) la richesse à double renfort, / et ainsi...",
   "09.004.08": "Coule, (toi qui es) inébranlable, pour (procurer) la richesse, toi qui triomphes dans les mêlées,/ et ainsi...",
   "09.004.09": "C'est toi que (les officiants) ont invigoré par les sacrifices, ô Pavamāna, en sorte que tu répandes (tes dons),/ et ainsi...",
   "09.004.10": "La richesse éclatante, consistant en chevaux, (comportant) pleine durée-de-vie, ô suc-de-soma, apporte nous la,/ et ainsi...",
   "09.005.01": "(Sitôt) enflammé, de toutes parts le Maître, Pavamāna, brille au loin,/ satisfaisant (les dieux), taureau qui mugit-puissamment.",
   "09.005.02": "Tanūnapāt (qui est) Pavamāna, aiguisant ses cornes, coule/ en brillant-puissamment à travers l'espace-médian.",
   "09.005.03": "Digne d'être invoqué, (Agni qui est) Pavamāna, richesse éclatante, brille au loin/ avec les coulées de la liqueur, formidablement.",
   "09.005.04": "Jonchant formidablement la Litière (rituelle) tournée vers l'Est, Pavamāna l'alezan/ s'avance en dieu parmi les dieux.",
   "09.005.05": "S'ouvrent haut avec (leurs) ailes les deux Portes divines, dorées,/ bien louées par Pavamāna.",
   "09.005.06": "(Vis-à-vis) des deux (femelles) bien parées, hautes, grandes, Nuit et Aurore, telles deux (femmes) belles à voir,/ Pavamāna se comporte en taureau.",
   "09.005.07": "Les deux dieux au regard de maîtres, les deux Hotar divins, je les appelle./ Pavamāna (, c'est) Indra taureau.",
   "09.005.08": "Que Bhāratī, Sarasvatī (et) Il̥ā (autrement dit) Mahī arrivent à/ ce sacrifice nôtre de Pavamāna, (ces) trois déesses aux beaux ornements !",
   "09.005.09": "Tvaṣṭr̥ le premier-né, gardien, précurseur, je l'appelle./ Le suc-de-soma (est) Indra, taureau, alezan ; Pavamāna (est) Prajāpati.",
   "09.005.10": "L'Arbre, ô Pavamāna, oins le entièrement de la liqueur de la coulée (de soma),/ (l'arbre) aux mille rameaux, vert, flamboyant, doré !",
   "09.005.11": "O Tous-dieux, arrivez à l'énoncé « svāhā ! » de Pavamāna ;/ (qu'y arrivent aussi) Vāyu, Br̥haspati, le Soleil, Agni, Indra, d'un même consentement !",
   "09.006.01": "D'une coulée harmonieuse, ô soma, clarifie toi en taureau aimant les dieux,/ dans (le tamis en) poils de brebis, toi qui nous aimes !",
   "09.006.02": "Vers cette-célèbre ivresse enivrante, ô suc-de-soma, coule (te disant) ainsi « (je vais à) Indra »,/ vers les coursiers porteurs de prix!",
   "09.006.03": "Vers cette-célèbre ivresse primitive coule, (une fois) pressé dans le filtre,/ vers le prix-de-victoire et le renom !",
   "09.006.04": "Les gouttes, les sucs-de-soma ont coulé à la suite (les uns des autres), telles les eaux sur la surface-déclive ;/ se clarifiant, ils ont atteint Indra.",
   "09.006.05": "(Le soma) que, comme un coursier gagnant-du-prix, nettoient les dix jeunes-femmes [les doigts],/ tandis qu'il joue dans (la cuve de) bois par-delà (le filtre en poils de) brebis,",
   "09.006.06": "cette sève puissante, (le soma) pressé, mélange le aux (laits des) vaches, pour l'ivresse,/ pour l'invite aux dieux, pour l'offrande !",
   "09.006.07": "Le dieu (Soma) se clarifie pour le dieu Indra avec (sa) coulée, (le soma) pressé,/ quand il fait se gonfler son lait.",
   "09.006.08": "Essence du sacrifice, (une fois) pressé avec rapidité, (le soma) se clarifie ; (le soma) pressé/ veille-en-profondeur sur l'antique art-poétique.",
   "09.006.09": "Ainsi, te clarifiant, toi qui aimes Indra, ô (soma) très enivrant, en sorte qu'(Indra) agrée l'ivresse,/ tu portes (en ton sein) les chants, si cachés (qu'ils soient en apparence).",
   "09.007.01": "Ils ont été lâchés sur le chemin du r̥ta, les sucs-de-soma, dans la tenure (du r̥ta, ces sucs) prestigieux,/ qui réalisent le trajet de ce (soma).",
   "09.007.02": "Coulée de liqueur, (le soma marche) en avant, tenant-la-tête ; il plonge dans les grandes eaux,/ offrande parmi les offrandes, (dieu) célébrable.",
   "09.007.03": "(Il marche) en avant, venant-en-tête de la parole accompagnante; taureau, il a mugi en des(cendant vers la cuve de) bois,/ vers (son) siège, (lui qui est) le vrai sacrifice.",
   "09.007.04": "Lorsqu'il coule tout autour, vêtu d'arts-poétiques, lui Poète, de virilités,/ porteur de prix, il cherche à gagner le soleil.",
   "09.007.05": "Pavamāna assiège les ennemis comme le Roi (entoure ses) sujets,/ quand le mettent-en-mouvement les ordonnateurs (du sacrifice).",
   "09.007.06": "(Le dieu) aimé, l'alezan, est assis autour (du tamis en) poil(s) de brebis, dans les (cuves de) bois ;/ barde, il est mis-en-état-de-grâce par l'hymne.",
   "09.007.07": "Le (soma) va vers Vāyu, vers Indra, vers les deux Aśvin, en même temps que l'ivresse,/ (ivresse) qui est joyeusement (présente) dans ses comportements.",
   "09.007.08": "(Amenant) vers ici Varuṇa-Mitra (et) Bhaga, les vagues de la liqueur (sômique) se clarifient,/ procurant (les biens) selon les capacités de ce (soma).",
   "09.007.09": "Pour nous (autres), ô Deux Mondes, conquérez la richesse, afin que (nous) gagnions le prix-de-victoire/ (consistant en) liqueur (sômique), le renom (et) les biens-matériels !",
   "09.008.01": "Voici les soma (qui) ont coulé au-devant du désir cher d'Indra,/ renforçant la force-virile de ce (dieu).",
   "09.008.02": "Se clarifiant, sis dans les cuves, allant vers Vāyu, vers les deux Aśvin,/ que ces (soma) nous confèrent abondance d'hommes-utiles !",
   "09.008.03": "O soma, aiguise pour le don le cœur d'Indra, en te clarifiant,/ pour (t')installer au séjour-natal du r̥ta !",
   "09.008.04": "Te nettoient les dix doigts (de l'officiant), (te) mettent en branle les sept intelligences,/ en suite (de quoi) les orateurs-inspirés ont marqué-leur-joie.",
   "09.008.05": "Toi qui t'es répandu pour les dieux, pour l'ivresse, (en passant) au-delà (du tamis en poils) de brebis,/ nous te vêtons entièrement de (lait de) vaches.",
   "09.008.06": "Se clarifiant dans les récipients, le (dieu) fauve, l'alezan, a endossé/ les vêtements faits de (lait de) vaches.",
   "09.008.07": "Donne-nous-en-te-clarifiant des patrons-généreux, frappe (et) re(foule) tous les ennemis,/ ô suc-de-soma, pénètre en (Indra, ton) ami!",
   "09.008.08": "La pluie du ciel, fais la couler tout autour ; l'éclat (venant) de la terre,/ confère le nous, ô soma, (ainsi que) la force-victorieuse dans les batailles !",
   "09.008.09": "Toi au regard de maître, qui procures le soleil, puissions-nous, (une fois) bu par Indra,/ te consommer (à notre tour, ayant du même coup en partage) descendance (et) jouissance !",
   "09.009.01": "Poète du ciel, (le soma) parcourt les étapes aimées, (une fois qu'il a été) placé entre les deux nièces [les mains de l'officiant] ;/ (il va, une fois) pressé, ayant la force-délibérante d'un poète.",
   "09.009.02": "Toujours plus avant, te plaisant à la résidence vénérable, à l'être-humain exempt de dol, / coule (à la faveur) d'une invite réjouissante au plus haut degré !",
   "09.009.03": "(Agissant) en fils pur, (le soma, sitôt) né, a fait resplendir ses deux parents (Ciel et Terre), nés (eux-mêmes) ;/ (devenu) grand, (il les a rendus) grands, eux ayant crû selon le r̥ta.",
   "09.009.04": "Incité par les sept intelligences, il a animé les rivières exemptes de dol,/ qui ont invigoré (son) œil unique.",
   "09.009.05": "Ces (rivières) ont placé le jeune (Soma) triomphant, irrésistible, en (situation de) prestige ;/ (elles ont mis) le suc-de-soma, ô Indra, sous ta volonté.",
   "09.009.06": "Cocher, tirant-puissamment (le char rituel, le soma) immortel considère les sept (intelligences) ;/ le Krivi a rassasié les (rivières) divines.",
   "09.009.07": "Favorise nous dans les rites, ô (soma) mâle ; les ténèbres qui sont à combattre, ô soma, / frappe les puissamment, en te clarifiant !",
   "09.009.08": "Ainsi donc, prépare les voies pour un hymne plus nouveau, (oui) plus nouveau (encore),/ selon le mode-antique fais briller les brillances (de l'inspiration) !",
   "09.009.09": "O Pavamāna, donne grand renom, vache, cheval, abondance en hommes-utiles ;/ gagne (pour nous) la sagesse, gagne le soleil !",
   "09.010.01": "Résonnant comme des chars, aimant le renom comme des coursiers,/ les soma se sont avancés pour la richesse.",
   "09.010.02": "Mis en branle comme des chars, ils ont couru sous les deux bras (de l'officiant),/ tels les enjeux d'hommes-cherchant-la-décision.",
   "09.010.03": "Comme les Rois (sont oints) par les panégyriques, les soma sont oints par (le lait des) vaches,/ comme le sacrifice (est oint aussi) par les sept installateurs.",
   "09.010.04": "(Une fois) pressés pour l'ivresse, avec violence, avec (accompagnement du) chant, les sucs-de-soma,/ les (soma) pressés coulent en jet tout autour.",
   "09.010.05": "Ayant atteint (la région) de Vivasvant, engendrant les Aurores (et) Bhaga,/ (ces soma) tendent au loin le tamis (comme) des soleils (tendent leurs rayons).",
   "09.010.06": "Les hérauts antiques ouvrent les portes des pensées-poétiques,/ (comme font aujourd'hui encore) les Āyu, pour la prise-en-charge du (soma-)taureau.",
   "09.010.07": "Groupés-ensemble, sont assis les officiants aux sept (intelligences) germaines,/ qui sauvegardent le pas du (dieu) unique.",
   "09.010.08": "(Le soma) a relié sa parenté (divine) à notre parenté (humaine), comme l'œil (est relié) au soleil ensemble./ La descendance du Poète (sômique) a été traite.",
   "09.010.09": "(Le soma) considère les (étapes) aimées, le séjour du ciel tenu en secret par les officiants-manuels ;/ (il le voit) grâce à l'œil du soleil.",
   "09.011.01": "Vers ce (dieu) Pavamāna, vers le suc-de-soma, chantez, ô maîtres,/ vers lui qui cherche à atteindre les dieux !",
   "09.011.02": "Les Atharvaṇ ont fortifié-par-mélange le lait avec ta liqueur ;/ (ils t'ont fortifié, ô soma qui es) un dieu, pour le dieu (Indra), en intention-divine.",
   "09.011.03": "Tel (étant), clarifie toi (en sorte d'apporter) bien-être à notre (groupe de) vache(s), bien-être à (notre groupe d')homme(s), bien-être à (notre groupe de) coursier(s),/ bien-être, ô roi (soma), aux plantes !",
   "09.011.04": "Ainsi donc, au brun soma, (au soma) fort par lui-même, (au soma) rosé,/ qui touche au ciel, chantez une mélodie !",
   "09.011.05": "Le soma pressé à l'aide des pierres mues par la main (de l'officiant), clarifiez le,/ détrempez le (doux soma) dans le doux (liquide, lait ou eau) !",
   "09.011.06": "Approchez vous de (ce soma) avec révérence, fortifiez-le-par-mélange avec le lait sûri,/ mettez le suc-de-soma dans Indra !",
   "09.011.07": "Toi qui frappes les adversaires, qui circules au loin, clarifie toi, ô soma, pour le bien-être de (notre groupe de) vache(s),/ toi qui agis pour les dieux selon leur désir !",
   "09.011.08": "Pour Indra, ô soma, pour qu'il boive, pour (son) ivresse, on te verse tout autour,/ toi qui comprends la pensée (en tant que) maître de la Pensée.",
   "09.011.09": "O Pavamāna, octroie nous abondance en hommes-utiles (et) richesse, ô soma,/ ô suc-de-soma, avec Indra pour notre allié !",
   "09.012.01": "Les soma ont été lâchés, les sucs-de-soma pressés, au siège du r̥ta,/ pour Indra, (ces soma) tout pleins de liqueur.",
   "09.012.02": "Les orateurs-inspirés ont crié-d'allégresse vers Indra, comme les vaches mères/ vers le veau, afin qu'(lndra) boive le soma.",
   "09.012.03": "Mettant en mouvement l'ivresse, il réside au siège (du r̥ta), dans la vague du fleuve, le soma/ qui comprend les mots-inspirés, qui prend appui sur (la peau de) buffle.",
   "09.012.04": "(Le dieu) qui regarde au loin au nombril du ciel prend de l'importance dans le (tamis en) poil(s) de brebis,/ le soma, ce Poète à la bonne force-délibérante.",
   "09.012.05": "Le soma qui a été placé dedans les récipients, sur le filtre,/ c'est lui que le suc-de-soma tient embrassé.",
   "09.012.06": "Le suc-de-soma pousse en avant la parole (jusque) vers la voussure de l'océan,/ vivifiant la cuve qui dégoutte de liqueur.",
   "09.012.07": "Lui qui a son mode-de-louange propre, Arbre des intuitions (sises) au-dedans (du cœur), surnaturellement trait,/ mettant en branle les âges humains,",
   "09.012.08": "le soma coule vers les séjours chers du ciel, (une fois) mis en branle,/ (ce) Poète, avec la coulée (née du travail) de l'orateur-inspiré.",
   "09.012.09": "O Pavamāna, fais (nous) tenir la richesse aux mille facettes,/ pour nous, ô suc-de-soma, (la richesse) efficace !",
   "09.013.01": "Se clarifiant, le soma coule, (avec ses) mille jets, par-dessus (le tamis en poils de) brebis,/ pour le rendez-vous de Vāyu (et) d'Indra.",
   "09.013.02": "Entonnez le chant vers Pavamāna, ô vous qui cherchez assistance, vers (le dieu) inspiré,/ qui a été pressé pour l'invite aux dieux !",
   "09.013.03": "Ils se clarifient pour gagner le prix-de-victoire, les soma aux mille formes,/ chantés pour l'invite aux dieux.",
   "09.013.04": "Ainsi donc, pour que (nous} gagnions le prix-de-victoire, clarifie toi, nous (procurant) de hautes jouissances,/ un (trésor) éclatant, ô suc-de-soma, une abondance en hommes-utiles !",
   "09.013.05": "Qu'ils se clarifient, nous (procurant) la richesse milluple, l'abondance en hommes-utiles,/ (une fois) pressés, (ces) dieux, les sucs-de-soma!",
   "09.013.06": "Tels des coursiers, incités par les incitateurs, (les soma) ont été lâchés pour gagner le prix-de-victoire,/ (chevaux) rapides, à travers (le tamis en) poil(s) de brebis.",
   "09.013.07": "Mugissants, les sucs-de-soma coulent vers (la cuve), comme les vaches-laitières (vont) vers le veau ;/ ils ont couru entre les deux bras (de l'officiant).",
   "09.013.08": "Agréé par Indra, enivrant, ô Pavamāna qui mugis puissamment,/ re(foule et) frappe tous les ennemis !",
   "09.013.09": "Re(foulant et) frappant les impies, ô Pavamāna's qui voyez le soleil,/ asseyez-vous au séjour-natal du r̥ta !",
   "09.014.01": "Le Poète (soma) s'est élancé tout autour (du tamis), prenant appui sur la vague du fleuve,/ portant (sur lui) le coup-décisif tant souhaité.",
   "09.014.02": "Lorsque, (aidés) par le chant, les cinq bataillons apparentés, [les dix doigts de l'officiant] actifs,/ entourent-d'apprêts (le soma) ferme (en ses assises),",
   "09.014.03": "alors Tous les Dieux se sont enivrés à la sève de ce (soma) fougueux,/ lorsqu'il se revêt (du lait) des vaches.",
   "09.014.04": "Laissant suinter (son jus, le soma) court à travers (le tamis), dépouillant les parties-fibreuses de son corps./ Puis il s'agrège à (Indra, son) allié.",
   "09.014.05": "Lui qui fut nettoyé par les nièces de Vivasvant, tel un beau jeune homme,/ en faisant (du lait) des vaches comme son vêtement-neuf,",
   "09.014.06": "(ce soma), prenant appui sur le fin (tamis), s'avance au-delà, (passant) en biais, (pour gagner le lait) des vaches ;/ il émet la rumeur qu'on connaît (bien).",
   "09.014.07": "Les doigts (de l'officiant) se sont assemblés, nettoyant le Maître de la jouissance ;/ ils saisissent les dos du (soma) gagnant-du-prix.",
   "09.014.08": "Serrant fortement tous biens-matériels, célestes (et) terrestres, tout autour,/ ô soma, va (de l'avant), toi qui nous aimes!",
   "09.015.01": "Voici (le soma qui), grâce à la pensée-poétique, s'avance par le fin (tamis, tel un) héros aux chars rapides,/ allant au rendez-vous d'Indra.",
   "09.015.02": "Voici (qu') il exerce-sa-pensée multiplement en vue de la haute fonction divine,/ là où les Immortels sont assis.",
   "09.015.03": "Voici (qu') incité (par les doigts de l'officiant,) il est conduit vers l'intérieur (du vase) par un beau chemin,/ quand (les opérateurs) s'affairant (le) battent.",
   "09.015.04": "Voici (que), secouant puissamment ses cornes, il (les) aiguise, taureau du troupeau,/ assumant les exploits-virils avec une force-formidable.",
   "09.015.05": "Voici (qu') il s'élance, gagnant-du-prix, avec ses tiges étincelantes, belles,/ lui qui est le Maître des fleuves.",
   "09.015.06": "Voici (qu') ayant traversé (le tamis en abandonnant) la nodosité (de sa tige), il descend/ (procurer) des biens-matériels solides, en (sa forme de fins) rameaux.",
   "09.015.07": "Voici (ce soma) digne d'être nettoyé, (que) nettoient les Āyu s'ap(prochant) des cuveaux-de-bois,/ lui qui met au grand jour de puissantes jouissances.",
   "09.015.08": "Voici le-célèbre (soma que) les dix doigts (de l'officiant) nettoient, les sept intelligences, / lui le bien armé, le très enivrant.",
   "09.016.01": "Les presseurs (de soma) pro(jettent) ta sève à (travers leurs) bras, en vue de l'ivresse frémissante./ Etaśa fonce, tel l'élan (des eaux lâchées).",
   "09.016.02": "Grâce à la force-délibérante (, base) de la force-agissante, nous avons accompagné (en pensée le soma), conducteur-du-char, qui se revêt d'eau en tant que plante,/ gagnant (le lait de) vache dans les fins (tamis où il passe).",
   "09.016.03": "Le soma inaccessible, insurmontable dans les eaux, laisse le couler dans le filtre,/ clarifie (le) pour Indra, pour qu'il boive !",
   "09.016.04": "Avec la compréhension d'un (être) qui se clarifie, le soma coule en avant dans le filtre ; /grâce à (sa) force-délibérante, il s'est installé sur (son) siège.",
   "09.016.05": "Les sucs, les soma ont été lâchés avec hommages au-devant de toi, ô Indra,/ eux qui emportent-la-décision dans le grand enjeu.",
   "09.016.06": "Se clarifiant dans la forme-concrète (du tamis en poils) de brebis, coulant pour (atteindre) tous prestiges,/ (le soma) se tient là, tel un héros (prêt) à (conquérir) des vaches.",
   "09.016.07": "Se gonflant comme le dos du ciel, le jet de (soma) pressé, du (dieu) ordonnateur (du culte),/ coule à sa guise dans le filtre.",
   "09.016.08": "Toi, ô soma, qui comprends les mots-inspirés quand tu te clarifies d'un trait chez les Āyu,/ tu cours à travers (le tamis en) poil(s) de brebis.",
   "09.017.01": "Frappant les ennemis, (les soma) qui s'affairent, tels des fleuves (allant) selon la pente,/ ont été lâchés en avant, les soma rapides.",
   "09.017.02": "(Une fois) pressés, les sucs-de-soma, telles les pluies en direction de la terre,/ ont coulé (en direction d') Indra, les soma.",
   "09.017.03": "Le soma dont la vague dé(borde le filtre) coule, ivresse enivrante, dans le filtre,/ dis(persant et) frappant les démonialités, aimant les dieux.",
   "09.017.04": "Il court vers les récipients, se déverse tout autour dans le filtre ;/ au moyen des hymnes il se renforce pour les sacrifices.",
   "09.017.05": "O soma, au-delà des trois régions-lumineuses tu brilles comme si tu montais au ciel (suprême) ;/ en lançant (la parole de l'officiant), tu as pour ainsi dire éperonné le soleil.",
   "09.017.06": "Les orateurs-inspirés ont crié-d'allégresse vers (le soma placé) à la tête du sacrifice,/ en tenant sous leur regard le (dieu) aimé.",
   "09.017.07": "C'est toi que, gagnant-du-prix, les maîtres, par (leurs) prières, les orateurs-inspirés cherchant assistance,/ nettoient en vue du service divin.",
   "09.017.08": "Laisse couler (tout) au long le jet de liqueur! Violent (au goût comme tu es, ô soma) tu t'es installé en (ton) siège,/ (dieu) agréable à boire (selon) le r̥ta.",
   "09.018.01": "(Une fois) pressé, le soma sis sur la montagne a coulé tout autour dans le filtre. / Dans les ivresses, tu es, (ô soma), celui qui confère tous (les biens).",
   "09.018.02": "Tu es l'orateur-inspiré, tu es le Poète, la liqueur engendrée de la plante (, ô soma)./ Dans...",
   "09.018.03": "Tous les dieux d'un même consentement ont atteint ton breuvage./ Dans...",
   "09.018.04": "(C'est le soma) qui a pris dans ses deux mains tous les biensmatériels délectables./ Dans...",
   "09.018.05": "(c'est lui) qui trait ces Deux grands Mondes ensemble, comme deux (vaches) mères./ Dans...",
   "09.018.06": "(c'est lui) qui entoure en coulant l'un et l'autre Mondes, d'un seul coup, avec les prix-de-victoire./ Dans...",
   "09.018.07": "lui, le (dieu) fougueux, il a mugi dans les récipients, en se clarifiant./ Dans...",
   "09.019.01": "O soma, le bien-matériel éclatant, digne-de-l'hymne, céleste (aussi bien que) terrestre,/ apporte nous le en te clarifiant !",
   "09.019.02": "Car vous êtes les deux Maîtres du soleil, (toi qui es) Indra et (toi), ô Soma, les deux Maîtres des vaches./ Vous qui (en) avez le pouvoir, gonflez (nos) pensées-poétiques !",
   "09.019.03": "En taureau, (le soma) qui se clarifie chez les Āyu, qui tonne sur la litière (rituelle),/ en alezan, il s'est installé dans (son) séjour-natal.",
   "09.019.04": "Les prières ont mugi sur (le soma), sperme du taureau (Soma),/ elles les mères, (sur le sperme) de (leur) fils, le veau.",
   "09.019.05": "Ne va-t-il pas, en se clarifiant, conférer un nouveau-né à (ces prières, femelles) désirant-le-taureau (Soma),/ elles qui traient (de lui) le lait blanc?",
   "09.019.06": "Attire-par-la-force ceux qui se tiennent à l'écart, porte la crainte chez les ennemis,/ ô Pavamāna, procure la richesse !",
   "09.019.07": "Abats, ô soma, la virilité de l'ennemi, a(bats sa) fougue, a(bats sa) force-vitale,/ qu'il soit loin ou bien près!",
   "09.020.01": "Le Poète (soma) coule en avant pour l'invite aux dieux, à travers (le tamis en) poils de brebis,/ triomphant de toutes les hostilités.",
   "09.020.02": "C'est lui en effet (qui) expédie aux chantres un prix-de-victoire consistant en vaches,/ lui Pavamāna, (un prix) milluple.",
   "09.020.03": "Tu enserres toutes choses en compréhension, tu te clarifies par la pensée poétique :/ tel (étant), ô soma, procure nous le renom !",
   "09.020.04": "Donne-en-coulant la haute gloire aux patrons-généreux, la richesse stable,/ apporte la jouissance aux laudateurs !",
   "09.020.05": "Toi, ô soma, tel un Roi fidèle au vœu tu es entré dans les chants (humains),/ en te clarifiant, ô conducteur-de-char, impossible à tromper.",
   "09.020.06": "Ce (soma) conducteur-de-char, insurmontable dans les eaux, qui se nettoie entre les deux bras (de l'officiant),/ le soma est assis dans les cuves.",
   "09.020.07": "Joueur, généreux comme un mécène, tu vas dans le filtre, ô soma,/ en conférant au laudateur l'abondance en hommes-utiles.",
   "09.021.01": "Voici les sucs, les soma (qui) courent pour Indra, frémissants,/ enivrants, procurant le soleil.",
   "09.021.02": "Bloquant les agressions, procurant le champ-libre au presseur (de soma),/ par eux-mêmes créant la force-vitale au laudateur,",
   "09.021.03": "jouant à leur guise, les sucs-de-soma se sont écoulés vers le siège/ unique, (étant portés) sur la vague du fleuve.",
   "09.021.04": "Voici les Pavamāna (qui) ont accédé à tous les (biens) délectables,/ tels des chevaux-d'attelage placés au char.",
   "09.021.05": "O sucs-de-soma, mettez en ce (soma-liqueur que voici) le (Soma) Veilleur à couleur-d'or, afin qu'il avertisse/ (l'homme) qui est avare à notre égard !",
   "09.021.06": "Comme l'Artisan (renouvelle) la roue-du-char, rendez nouvelle la disposition-d'esprit (de cet avare), pour (que le Veilleur l') avertisse!/ (O soma's), clarifiez vous, (devenant) purs avec (votre) flot!",
   "09.021.07": "Voici les célèbres (soma qui) ont mugi ; (ces) gagnants-du-prix ont franchi la carrière ;/ pareillement ils ont stimulé la pensée-poétique.",
   "09.022.01": "Voici les soma rapides, tels des chars gagnants-du-prix, (qui)/ ont été mis en branle (pour aller) de l'avant, lancés (sur leurs) erres.",
   "09.022.02": "Voici (les soma) vastes comme les vents, (abondants) comme les pluies de Parjanya,/ (allant) à leur guise comme les tournoiements du feu.",
   "09.022.03": "Voici les soma clarifiés, comprenant les mots-inspirés, mélangés de lait-sûri ;/ grâce à l'inspiration ils ont pénétré les pensées.",
   "09.022.04": "Voici (les soma) nettoyés, immortels, (qui bien qu') ayant couru ne se sont pas fatigués,/ en cherchant à atteindre les chemins (à travers) l'espace.",
   "09.022.05": "Voici (les soma qui) ont pénétré les surfaces des Deux Mondes divisant leur marche au loin,/ ainsi que l'espace tout en haut (des Mondes).",
   "09.022.06": "Le long du fil tendu tout en haut (vers cet espace, les soma) ont atteint les étendues (plus) en avant,/ ainsi que (l'espace) situé tout en haut.",
   "09.022.07": "Toi, ô soma, tu as pris aux Paṇi les biens-matériels (consistant en) troupeaux de vaches ;/ le fil tendu (du sacrifice), tu l'as fait crier.",
   "09.023.01": "Les soma ont été lâchés, rapides, avec la coulée de liqueur, de breuvage-enivrant,/ afin (d'assurer) toutes les ressources-poétiques.",
   "09.023.02": "Les Āyu antiques ont marché (tout) au long, (d'un) pas nouveau :/ ils ont engendré le soleil, pour qu'il brille.",
   "09.023.03": "O Pavamāna, apporte nous l'avoir de l'Étranger qui n'adore pas (nos dieux) ;/ fais (nous) des jouissances consistant en descendance!",
   "09.023.04": "Les soma vivaces se clarifient pour (donner) l'ivresse enivrante, (se dirigeant) vers la cuve qui dégoutte de liqueur.",
   "09.023.05": "Le soma coule, ferme (en ses assises), contenant la sève bonne pour Indra,/ donnant des hommes-utiles, gardant contre la parole mauvaise.",
   "09.023.06": "Pour Indra, ô soma, tu te clarifies, pour les dieux, toi qui es digne-du-banquet ;/ ô suc-de-soma, tu veux gagner le prix-de-victoire.",
   "09.023.07": "Ayant bu de ce (soma), de (ses) ivresses, Indra a frappé et/ frappera encore les ennemis, incapables de résister.",
   "09.024.01": "Les soma ont couru en avant, les Pavamāna, les sucs ;/ renforcés-par-mélange, ils ont été nettoyés dans les eaux.",
   "09.024.02": "Ils ont couru vers les (laits de) vaches, comme des eaux allant selon la surface-déclive ;/ se clarifiant, ils ont atteint Indra.",
   "09.024.03": "Tu cours en avant, ô Pavamāna, ô soma, pour Indra, pour qu'il boive ;/ tenu-en-mains par les maîtres, tu es conduit à travers (le tamis).",
   "09.024.04": "O soma, toi qui enivres les maîtres, clarifie-toi pour (Indra) forceur de peuples,/ toi qui, gagnant (les prix), es digne-d'être-salué (par les hymnes) !",
   "09.024.05": "O suc-de-soma, lorsque, pressé par les pierres, tu cours autour du filtre,/ (tu es) de taille à (satisfaire) la vocation d'Indra.",
   "09.024.06": "Clarifie toi, ô Vr̥trahaṇ par excellence, qui es digne-d'être-salué par les hymnes,/ (dieu) pur, purificateur, intrompable!",
   "09.024.07": "Pur, purificateur s'appelle le soma, (le dieu) de la liqueur pressée ;/ (il s'appelle aussi) l'invitant des dieux, le frappeur de ceux aux paroles méchantes.",
   "09.025.01": "Clarifie toi, toi qui donnes-succès à la force-agissante, pour les dieux, pour qu'ils boivent, ô (soma) alezan,/ pour les Marut, pour Vāyu, (toi qui es) l'ivresse!",
   "09.025.02": "O Pavamāna, (une fois) mis en branle par la pensée-poétique, mugissant puissamment vers (ton) séjour-natal,/ pénètre en Vāyu selon (ta) nature !",
   "09.025.03": "(De conserve) avec les dieux, il s'embellit, le taureau, Poète aimé, en (son) séjour-natal,/ lui Vr̥trahaṇ, invitant de dieux par excellence.",
   "09.025.04": "Assumant toutes les formes, se clarifiant, il va, (ce dieu) désirable,/ là où les Immortels sont assis.",
   "09.025.05": "Le soma roux, qui engendre les chants, se clarifie, s'attachant aux Āyu,/ allant à Indra, lui qui a la force-inspirante d'un poète.",
   "09.025.06": "Clarifie toi, ô très enivrant, dans le filtre, en une (seule) coulée, ô Poète,/ pour t'installer au séjour-natal du chant !",
   "09.026.01": "Ils l'ont nettoyé, (ce soma) gagnant-du-prix, (sis) dans le giron d'Aditi,/ eux les orateurs-inspirés, grâce au fin (tamis), grâce à la pensée-poétique.",
   "09.026.02": "Vers lui les vaches ont crié-d'allégresse, vers le suc-de-soma aux mille coulées,/ inépuisable, mainteneur du ciel.",
   "09.026.03": "Lui l'ordonnateur (du culte, les officiants) l'ont mis en branle par la sagesse-poétique, lui Pavamāna au ciel,/ (dieu) ferme (en ses assises), nourricier de maints (êtres).",
   "09.026.04": "C'est lui qu'ils mirent en branle avec leurs bras, avec la pensée-poétique, lui qui se revêt (de lait dans le domaine) de Vivasvant,/ lui Maître de la parole, impossible à tromper.",
   "09.026.05": "C'est ce (dieu) alezan (que), sur le dos (du tamis), les sœurs [les doigts de l'officiant] mettent en branle à l'aide des pierres (presseuses),/ (le dieu) désirable, qui regarde maints (êtres).",
   "09.026.06": "C'est toi que les ordonnateurs (du culte) mettent en branle, ô Pavamāna, crû dans la montagne, / ô suc-de-soma, enivrant pour Indra.",
   "09.027.01": "Voici le Poète célébré (qui) jaillit-à-profusion sur le filtre,/ se clarifiant, frappant (et) re(foulant) les hostilités.",
   "09.027.02": "Voici (qu') il se déverse tout autour pour Indra, pour Vāyu, (ce) conquérant du soleil,/ dans le filtre, donnant-succès à la force-agissante.",
   "09.027.03": "Voici (qu') il est conduit par les maîtres à travers (le tamis), lui tête du ciel, taureau, (ce) soma/ pressé, dans les (cuves de) bois, lui qui connaît tout.",
   "09.027.04": "Voici Pavamāna (qui), désireux de vaches, a mugi, désireux d'or,/ le suc-de-soma partout vainqueur, impossible à abattre.",
   "09.027.05": "Voici qu'il rivalise-en-course avec le soleil, Pavamāna (sis) au ciel,/ lui qui dans le filtre (est) l'ivresse enivrante.",
   "09.027.06": "Voici (le dieu) fougueux (qui) a couru dans l'espace-médian, lui taureau, alezan,/ suc-de-soma se clarifiant, (il a couru) vers Indra.",
   "09.028.01": "Voici le gagnant-du-prix, mis en branle par les maîtres, connaissant tout, Seigneur de la pensée ;/ il court à travers (le tamis en) poil(s) de brebis.",
   "09.028.02": "Voici (qu') il a coulé dans le filtre, le soma pressé, pour les dieux, / pénétrant toutes les positions.",
   "09.028.03": "Voici le dieu (qui) s'embellit en (son) séjour-natal, l'immortel/ Vr̥trahaṇ, invitant de dieux par excellence.",
   "09.028.04": "Voici le taureau (qui), mugissant puissamment, tenu-en-mains par les dix sœurs [les doigts],/ court vers les cuveaux-de-bois.",
   "09.028.05": "Voici (qu') il a fait briller le soleil, (ce) Pavamāna circulant au loin,/ (qui connaît) toutes les positions, connaisseur de tout.",
   "09.028.06": "Voici le fougueux, l'intrompable soma, (qui) coule (une fois) clarifié,/ l'invitant des dieux, le frappeur de ceux aux paroles méchantes.",
   "09.029.01": "Ses jets ont coulé en avant, à (ce) taureau pressé, d'une force-formidable,/ lui qui se met au service des dieux (l'un) après (l'autre).",
   "09.029.02": "Les ordonnateurs (du culte) nettoient le (soma), cheval-attelé ; en chantant, les hérauts (le parent) du chant,/ lui qui est né (comme une) Lumière digne-de l'hymne.",
   "09.029.03": "Aisés à forcer, ô soma, sont ces (biens-matériels) pour toi qui te clarifies, ô (dieu) abondant en biens-matériels ;/ accroîs l'océan (sômique) digne-de-l'hymne !",
   "09.029.04": "Toi qui conquiers tous les biens-matériels, ô soma, clarifie toi avec (ta) coulée,/ (re)pousse les hostilités d'un même coup !",
   "09.029.05": "Garde nous donc de l'avare, du son même (de sa voix), quel qu'il soit,/ (nous plaçant) là où nous soyons à l'abri de la nocivité !",
   "09.029.06": "Donne-en-te-clarifiant, ô suc-de-soma, la richesse terrestre (aussi bien que) céleste, avec (ta) coulée ;/ apporte l'énergie éclatante!",
   "09.030.01": "Les jets de ce (soma) fougueux ont coulé en avant, à leur guise, dans le filtre ;/ en se clarifiant, il lance la parole.",
   "09.030.02": "Mis en branle par les presseurs, le suc-de-soma, nettoyé, mugissant avec force,/ émet le son indrien.",
   "09.030.03": "A(mène) nous l'énergie propre à triompher des guerriers, (procurant) des hommes-utiles, (l'énergie) très désirable,/ en te clarifiant, ô soma, avec (ta) coulée !",
   "09.030.04": "Le soma s'est répandu en avant, par-delà (le tamis), Pavamāna, en (sa) coulée,/ pour s'installer dans les cuveaux-de-bois.",
   "09.030.05": "Dans les eaux (les officiants) te mettent en branle, toi très riche en liqueur, toi l'alezan, avec les pierres (presseuses),/ ô suc-de-soma, pour Indra, pour qu'il boive.",
   "09.030.06": "Pressez le soma très riche en liqueur, pour Indra le (dieu) porte-foudre,/ (le soma) agréable à la troupe (des Marut), enivrant !",
   "09.031.01": "Les soma se sont avancés, Pavamāna's aux bonnes intentions ;/ ils créent une richesse signalée.",
   "09.031.02": "(A partir) du ciel (et) de la terre, ô suc-de-soma, sois un accroisseur d'éclat,/ sois le maître des prix-de-victoire !",
   "09.031.03": "Pour toi (soufflent) les vents favorables, pour toi coulent les fleuves ;/ ô soma, ils accroissent ta puissance.",
   "09.031.04": "Gonfle toi ; que concoure de toutes parts ta force-de-taureau !/ Sois (disponible) dans le confluement de(s) prix-de-victoire(s) !",
   "09.031.05": "C'est pour toi que les vaches ont donné-pour-lait le beurre-fondu, ô (soma) brun, le lait impérissable, / sur le dos le plus élevé (du ciel).",
   "09.031.06": "Toi qui es bien armé, ô Maître de l'univers, nous (autres),/ ô suc-de-soma, voulons ton amitié.",
   "09.032.01": "Les soma mouvant l'ivresse se sont avancés pour le renom de notre patron-généreux,/ (les soma) pressés, pour la répartition (sacrificielle).",
   "09.032.02": "Alors les jeunes-femmes de Trita [les doigts de l'officiant] mettent en branle le (soma) alezan à l'aide des pierres,/ le suc-de-soma, pour Indra, pour qu'il boive.",
   "09.032.03": "Alors, comme le cygne (crie) vers (sa) troupe, (le soma) a mugi vers la prière de tout (homme) ;/ comme un coursier il est oint (du lait) des vaches.",
   "09.032.04": "Jetant ton regard en bas, ô soma, sur l'un et l'autre (Mondes), telle une bête qui fonce, tu coules,/ t 'installant (ensuite) au séjour-natal du r̥ta.",
   "09.032.05": "Les vaches ont crié-d'allégresse vers (le soma) comme la jeune-femme vers l'amant chéri ;/ elles sont allées dans l'arène comme (pour rejoindre le soma) mis en branle (par les prières).",
   "09.032.06": "Confère nous la gloire éclatante, et aux patrons-généreux et à moi-même,/ le gain (accompagné de) sagesse ainsi que le renom!",
   "09.033.01": "Les soma comprenant les mots-inspirés vont de l'avant, comme les vagues des eaux,/ comme les buffles dans les forêts.",
   "09.033.02": "En direction des cuveaux-de-bois les bruns (soma), les purs, avec le jet du r̥ta/ ont coulé pour (procurer) le prix-de-victoire consistant en vaches.",
   "09.033.03": "Pressés, (les soma coulent) pour Indra, pour Vāyu, pour Varuṇa, pour les Marut,/ les soma coulent pour Viṣṇu.",
   "09.033.04": "Les trois paroles s'élèvent ; les vaches mugissent, les vaches-laitières ;/ l'alezan (soma) va hennissant avec force.",
   "09.033.05": "Les (femelles) vouées à la Formule ont crié-d'allégresse vers (ce soma), les vivaces mères du R̥ta ; avec force elles nettoient le (soma), nourrisson du ciel.",
   "09.033.06": "Donne-nous-en-te-clarifiant les richesses, quatre océans (de biens), intégralement,/ ô soma, (les richesses) milluples !",
   "09.034.01": "(Une fois) pressé, avec (sa) coulée, continuement, le suc-de-soma, mis en branle (par les officiants), coule en avant ;/ il brise les choses (les plus) dures avec une force-formidable.",
   "09.034.02": "= 33,3.",
   "09.034.03": "Taureau tenu en mains par les (officiants), taureaux (eux-mêmes, ceux-ci) pressent le soma à l'aide des pierres ;/ il traient le lait avec capacité.",
   "09.034.04": "(Le soma) est digne d'être nettoyé par Trita, il est enivrant pour Indra ;/ l'alezan est oint entièrement de formes-concrètes.",
   "09.034.05": "Pour (atteindre) le pinacle du r̥ta, (les Marut) dont Pr̥śni est la mère traient ce (soma),/ oblation agréable, très aimée.",
   "09.034.06": "Ces chants délivrant du mal coulent ensemble vers lui, d'un même cours./ (Le dieu) mugissant a fait mugir les vaches-laitières.",
   "09.035.01": "Donne-nous-te-clarifiant, avec (ta) coulée, ô Pavamāna, la richesse étendue,/ par laquelle veuille nous procurer la lumière !",
   "09.035.02": "O suc-de-soma qui fais se balancer l'océan, clarifie toi, ô toi qui fais bouger toutes choses,/ porteur de notre richesse, grâce à (ta) force-formidable !",
   "09.035.03": "Avec ton aide, être-d'élite, ô (soma) pourvu d'êtres-d'élite, puissions-nous triompher des agresseurs !/ Coule pour nous (procurer un bien) délectable !",
   "09.035.04": "Le suc-de-soma lance en avant (la parole), cherchant à gagner le prix-de-victoire, lui le gagnant-du-prix, le prophète,/ qui procure les vœux, les armes.",
   "09.035.05": "Lui qui fait se balancer la parole, nous le revêtons de chants tandis qu'il se clarifie,/ le soma, maître de vaches (auprès) du peuple,",
   "09.035.06": "(ce soma) sous le vœu duquel tout être-humain se tient, (soma) maître du comportement,/ (soma) clarifié, aux biens-matériels abondants.",
   "09.036.01": "Il a été lâché comme un cheval-du-char vers le filtre, (ce soma) pressé, (pour entrer) dans les deux vases ;/ en gagnant-du-prix il a foulé (le sol de l'arène jusqu') à la barrière.",
   "09.036.02": "Guidant-le-char, ô soma, (toi qui es) vigilant, clarifie toi, invitant les dieux, (passant) au-delà (du tamis),/ vers le récipient qui dégoutte de liqueur !",
   "09.036.03": "Tel (étant), fais briller pour nous les lumières, ô toi (dieu) primordial, ô Pavamāna,/ incite nous pour (que nous obtenions) force-délibérante (et) force-agissante !",
   "09.036.04": "Embelli par les (hommes) aimant le R̥ta, nettoyé entre les deux bras (de l'officiant),/ (le soma) se clarifie dans le (tamis fait en) poil(s) de brebis.",
   "09.036.05": "Que ce soma donne-en-se-clarifiant tous les biens-matériels à l'adorateur, (les biens) célestes/ (et) terrestres, (ainsi que) ceux de l'espace-médian !",
   "09.036.06": "Tu gravis le dos du ciel en cherchant des chevaux, en cherchant des vaches, ô soma,/ en cherchant des hommes utiles, ô Maître de la force.",
   "09.037.01": "Lui, pressé pour le breuvage, taureau, le soma coule dans le filtre,/ dis(persant et) frappant les démonialités, cherchant les dieux.",
   "09.037.02": "Lui qui regarde au loin, l'alezan coule dans le filtre, ferme (en ses assises),/ vers (son) séjour-natal, en hennissant avec force.",
   "09.037.03": "Lui, le gagnant-du-prix, il parcourt les régions-lumineuses du ciel, Pavamāna/ qui frappe les démons, (en passant à travers le tamis en) poil(s) de brebis.",
   "09.037.04": "Lui Pavamāna, sur le dos de Trita il a fait briller/le soleil (en s'associant aux sœurs) germaines.",
   "09.037.05": "Ce Vr̥trahaṇ, taureau, soma pressé, procureur du large-espace, intrompable,/ a coulé comme (pour se rendre vers) le prix-de-victoire.",
   "09.037.06": "Ce dieu mû par le poète court vers les cuveaux-de-bois,/ (lui qui est) le suc-de-soma, pour Indra, avec largesse.",
   "09.038.01": "Voici le-célèbre (soma), taureau, (cheval attelé au) char, (qui) coule à travers (le tamis en) poils de brebis,/ en se rendant au prix-de-victoire milluple.",
   "09.038.02": "Voici l'alezan que les jeunes-femmes [les doigts] de Trita mettent en branle à l'aide des pierres,/ le suc-de-soma, pour Indra, pour qu'il boive.",
   "09.038.03": "Voici le-célèbre (soma) que les dix actives (femelles) [les doigts], de couleur dorée, nettoient vigoureusement,/ elles par qui il est embelli pour l'ivresse.",
   "09.038.04": "Voici le-célèbre (soma qui,) tel un faucon, se pose dans les établissements humains,/ s'(y) rendant comme l'amant vers la jeune-femme.",
   "09.038.05": "Voici le-célèbre (soma), sève enivrante, (qui) regarde vers en bas, lui nourrisson du ciel,/ suc-de-soma qui est entré dans (le tamis en) poil(s de brebis).",
   "09.038.06": "Voici le-célèbre (soma) pressé, l'alezan, (qui) coule pour être bu, ferme (en ses assises),/ en mugissant, pour (atteindre) le séjour-natal aimé.",
   "09.039.01": "(Toi qui es) rapide, coule, ô (soma) dont haute est la pensée, (coule) tout autour en (ta) fonction aimée,/ (vers le lieu) où l'on dit « (voilà) les dieux » !",
   "09.039.02": "Toi qui parachèves ce qui n'avait pas été achevé, qui fais s'aligner les jouissances pour l'être humain,/ laisse couler tout autour la pluie du ciel !",
   "09.039.03": "Pressé, (le soma) va dans le filtre, assumant son éclat d'une force-formidable,/ regardant au loin, illuminant au loin.",
   "09.039.04": "Voici le (dieu) qui, du ciel, en une course rapide, s'est écoulé/ dans le filtre, sur la vague du fleuve.",
   "09.039.05": "Cherchant à gagner à soi (les dieux, en partant) du domaine-(le plus)-lointain et aussi du domaine-prochain, (le soma) pressé/ se déverse pour Indra, la liqueur (se déverse).",
   "09.039.06": "Se groupant ensemble, (les soma) ont crié-d'allégresse ; ils mettent en branle l'alezan (soma) à l'aide des pierres./ Asseyez-vous au séjour-natal du R̥ta !",
   "09.040.01": "Se clarifiant, (le soma) a marché contre toutes hostilités, (dieu) qui circule au loin ;/ (les officiants) embellissent le (dieu) inspiré d'intuitions-poétiques.",
   "09.040.02": "Que (le dieu) couleur-d'aurore monte au séjour-natal, qu'il se rende vers Indra, (ce soma) taureau, pressé !/ Il s'asseoit sur le siège stable.",
   "09.040.03": "Eh bien, donne-nous-en-te-clarifiant la richesse grande, ô suc-de-soma, pour nous, ô soma,/ intégralement, (la richesse) milluple !",
   "09.040.04": "Tous les prestiges, ô soma Pavamāna, apporte les, ô suc-de-soma,/ procure les jouissances milluples !",
   "09.040.05": "Tel (étant), apporte, te clarifiant, la richesse à notre laudateur, l'abondance en hommes-utiles ;/ invigore les chants du chantre !",
   "09.040.06": "Te clarifiant, ô suc-de-soma, apporte, ô soma, la richesse à double renfort ;/ ô taureau, ô suc, (apporte la) nous, (qui soit) digne-de-l'hymne.",
   "09.041.01": "(Je chante les soma) qui se sont avancés tels des vaches, frémissants, impétueux, infatigables,/ frappant (et) re(foulant) la peau noire.",
   "09.041.02": "Nous évoquons la marche-heureuse (de Soma), par delà la digue inattaquable,/ quand nous forçâmes le Dasyu qui-ignore-les-vœux.",
   "09.041.03": "On entend la résonance, telle (celle) de la pluie, (qui émane) de Pavamāna le fougueux./ Les éclairs circulent au ciel.",
   "09.041.04": "Donne-en-te-clarifiant la grande jouissance, possession de vaches, ô suc-de-soma, possession d'or,/ possession de chevaux, possession de prix-de-victoire, toi (soma) pressé !",
   "09.041.05": "Tel (étant), clarifie toi, ô toi qui circules au loin ; emplis les Deux Mondes,/ comme (le font) les Aurores, le Soleil avec (leurs) rayons !",
   "09.041.06": "De ton (jet) protecteur, ô soma, de toutes parts coule tout autour/ pour nous, comme la (rivière) Rasā (autour) du pinacle (de l'océan) !",
   "09.042.01": "Lui qui engendre les espaces-lumineux du ciel, qui engendre dans les eaux le soleil,/ qui se vêt (du lait) des vaches, (se vêt) des eaux, (lui le soma) alezan,",
   "09.042.02": "voici que, selon l'évocation antique, le dieu (Soma, venu) de (chez) les dieux,/ se clarifie avec (sa) coulée, (une fois) pressé.",
   "09.042.03": "Pour le champion (Indra) qui fut invigoré (par eux), les soma sont clarifiés en vue de gagner/ le prix-de-victoire, (ces soma) aux mille formes.",
   "09.042.04": "Se laissant traire (son) lait antique, (le soma) se déverse dans le filtre tout autour ;/ en mugissant il a engendré les dieux.",
   "09.042.05": "Pour (atteindre) toutes les choses délectables, pour (atteindre) les dieux crûs par le R̥ta,/ le soma coule en se clarifiant.",
   "09.042.06": "(Donne) nous en te clarifiant, ô soma, possession de vaches, possession d'hommes-utiles, possession de chevaux, possession de prix ;/ étant pressé, (donne) les hautes jouissances !",
   "09.043.01": "Lui qui, tel un coursier, est nettoyé par (le lait des) vaches, en vue de l'ivresse, (ce dieu) désirable,/ c'est lui que nous revêtons de chants.",
   "09.043.02": "C'est lui que tous nos chants cherchant sa faveur embellissent selon le mode-antique,/ le suc-de-soma, pour Indra, pour qu’il boive.",
   "09.043.03": "Il marche en se clarifiant, le soma désirable, entièrement préparé par les chants/ de Medhyātithi l'orateur-inspiré.",
   "09.043.04": "O Pavamāna, procure nous la richesse, ô soma, prestigieuse,/ ô suc, (la richesse) à mille facettes !",
   "09.043.05": "Le suc-de-soma, tel un coursier marchant au prix-de-victoire, hennit avec force dans le filtre,/ dès qu'il a (commencé à) couler à travers, lui qui aime les dieux.",
   "09.043.06": "Clarifie toi pour gagner le prix-de-victoire, pour invigorer le chanteur inspiré ;/ ô soma, octroie l'abondance en hommes-utiles !",
   "09.044.01": "En avant pour nous, ô suc-de-soma, pour le grand continuum (rituel), comme (si tu) portais la vague, tu coules/ en direction des dieux, (soma) l'infatigable.",
   "09.044.02": "Satisfait par le poème, mis en branle par la pensée-poétique, le soma se meut vers le domaine-(le plus)-lointain,/ grâce à la coulée du (prêtre)-inspiré, (ce soma) poète.",
   "09.044.03": "Voici (le dieu) vigilant parmi les dieux, (qui), pressé, va dans le filtre ;/ le soma marche, circulant au loin.",
   "09.044.04": "Tel (étant), clarifie toi pour nous, toi qui cherches le prix-de-victoire, qui rends le sacrifice agréable./ Portant la litière (rituelle), il cherche à gagner à soi (les dieux).",
   "09.044.05": "Tel (étant, qu'il se clarifie) pour Bhaga, pour Vāyu, (ce soma) qui a pour hommes-utiles les orateurs, toujours (les) invigorant ;/ que le soma nous dirige chez les dieux !",
   "09.044.06": "Toi qui, afin de donner des biens-matériels, procures la force-inspirante, procures l'issue (heureuse) par excellence,/ conquiers nous aujourd'hui le prix-de-victoire, le haut renom !",
   "09.045.01": "Tel (étant), clarifie toi pour l'ivresse, toi au regard de maître, pour l'invite aux dieux,/ ô suc-de-soma, pour Indra, pour qu'il boive !",
   "09.045.02": "Tel (étant), coule pour nous afin (de remplir) l'office du messager. Toi, tu jaillis-à-profusion pour Indra,/ étant vis-à-vis des dieux mieux (placé) que (nos) amis (mêmes).",
   "09.045.03": "Et toi-même, (dieu) couleur-d'aurore, nous t'enduisons du (lait des ) vaches, pour l'ivresse./ Ouvre nous les portes vers la richesse !",
   "09.045.04": "(Le soma) a franchi le filtre, comme (le cheval) gagnant-du-prix (franchit) le timon dans la course./ Le suc-de-soma est maître chez les dieux.",
   "09.045.05": "Ensemble les (officiants) amis ont chanté (le soma) qui joue dans (le cuveau de) bois, tra(versant le tamis en poils) de brebis ;/ les mélodies ont crié-d'allégresse vers le suc-de-soma.",
   "09.045.06": "Avec cette coulée-la clarifie toi, grâce à laquelle, une fois bu, ô suc-de-soma,/ tu révèles au laudateur l'abondance en hommes-utiles !",
   "09.046.01": "Ils ont été lâchés pour l'invite aux dieux, tels des coursiers enlevant-la-décision,/ en s'écoulant, (ces soma) crûs sur la montagne.",
   "09.046.02": "Munis de tous (leurs atours) comme une jeune-femme ayant son bien paternel, les sucs,/ les soma ont été lâchés vers Vāyu.",
   "09.046.03": "Voici les soma, les sucs porteurs de satisfactions (rituelles), pressés dans les cuves,/ (qui) invigorent Indra grâce aux actes (du sacrifice).",
   "09.046.04": "O (officiants) aux belles mains, détrempez, saisissez (les deux puisées, celle de soma) pur, (celle qui a été) barattée (de farine) ;/ fortifiez-en-mélangeant de (lait de) vaches (le soma) enivrant !",
   "09.046.05": "Tel (étant), clarifie toi, ô vainqueur de l'enjeu, qui confères un grand bienfait/ à nous (autres), ô soma, toi qui procures l’issue-heureuse !",
   "09.046.06": "Voici (le soma) digne-d'être nettoyé, que nettoient les dix doigts, (ce) Pavamāna,/ pour Indra, ivresse enivrante.",
   "09.047.01": "Grâce à cette bonne œuvre (poétique), le soma, si grand (fût-il déjà), a crû (encore) ;/ s'enivrant (lui-même), il s'exalte-en-taureau.",
   "09.047.02": "Les démolitions de Dasyu's qu'il a faites et qu'il fera sont en évidence :/ et c'est lui qui fait rentrer les dettes, (ce dieu) hardi.",
   "09.047.03": "Alors le soma, sève indrienne, devient un foudre gagnant mille (prix),/ dès que l'hymne sur lui prend naissance.",
   "09.047.04": "De lui-même le (soma) poète désire répartir le trésor (destiné) à l'orateur-inspiré,/ quand il nettoie avec force les pensées-poétiques.",
   "09.047.05": "(O soma), tu es celui qui cherche à gagner des richesses pour ceux qui ont vaincu dans les combats,/ comme (on le cherche) pour les coursiers (qui ont vaincu) dans les (compétitions comportant des) prix.",
   "09.048.01": "Toi qui portes les forces-viriles (jusque) dans les séjours du grand ciel,/ nous t'implorons, toi plaisant (soma), par (cette) bonne œuvre (poétique),",
   "09.048.02": "(toi) qui renverses (l'ennemi) audacieux, toi digne-de-l'hymne, grand (exécuteur) des grands vœux, ivresse/ apte à briser cent forteresses.",
   "09.048.03": "C'est de ce ciel que l'aigle t'a apporté (ici) en vue de la richesse, toi qui es roi,/ ô (soma) à la bonne force-inspirante, qui (marches) sans errements.",
   "09.048.04": "Pour tout (être humain), en sorte qu'il voie le soleil, l'oiseau a apporté, (à titre de) bien commun,/ le (soma) qui traverse l'espace, gardien du R̥ta.",
   "09.048.05": "Dès qu'il fut mis en branle, il a atteint la puissance indrienne (la) plus forte,/ lui qui fait (preuve de sa) supériorité, lui qui circule au loin.",
   "09.049.01": "Te clarifiant (donne) nous donc la pluie, la vague des eaux (venue) du ciel,/ les jouissances délivrant de la maladie, puissantes!",
   "09.049.02": "Clarifie toi grâce à cette coulée (même) par laquelle les vaches de l'étranger/ accèderont à notre maison !",
   "09.049.03": "Clarifie toi (en donnant) du beurre-fondu avec (ta) coulée, toi qui pour les sacrifices es l'invitant de dieux par excellence ;/ pour nous-mêmes, donne-en-te-clarifiant la pluie !",
   "09.049.04": "Tel (étant), cours en sorte de nous (donner) la vigueur-nourricière, (cours) à travers le tamis (en poils) de brebis, avec (ta) coulée !/ Puissent les dieux entendre, n'est-ce pas ?",
   "09.049.05": "Pavamāna s'est écoulé, re(foulant et) frappant avec force les démonialités,/ faisant briller les brillances selon le mode-antique.",
   "09.050.01": "Tes énergies s'élèvent comme la rumeur (née) de la vague du fleuve./ Aiguise la pointe de la parole-rythmée !",
   "09.050.02": "A ton impulsion s'élèvent les trois paroles généreuses,/ quand tu vas sur le dos (du tamis en poils) de brebis.",
   "09.050.03": "Sur le (tamis en) poil(s) de brebis, (les officiants) tout autour mettent en branle le cher (soma), l'alezan, à l'aide des pierres,/ Pavamāna qui dégoutte de liqueur.",
   "09.050.04": "= 25,6.",
   "09.050.05": "Tel (étant), clarifie toi, ô très enivrant, qui es oint de (lait des) vaches (comme) d'onguents,/ ô suc-de-soma, pour Indra, pour qu'il boive !",
   "09.051.01": "O officiant-manuel, laisse le soma pressé couler à l'aide des pierres sur le filtre,/ clarifie le pour Indra, pour qu'il boive !",
   "09.051.02": "La crème du ciel, la meilleure, le soma riche en miel,/ pressez le pour Indra le porte-foudre !",
   "09.051.03": "De ton doux jus, ô suc-de-soma, ces-célèbres dieux consomment,/ (ces) Marut, (ô toi qui es) Pavamāna.",
   "09.051.04": "C'est toi en effet, ô soma qui, pressé pour l'ivresse frémissante, invigores,/ ô taureau, le laudateur afin qu'il soit favorisé.",
   "09.051.05": "Coule, ô toi qui regardes au loin, vers le filtre avec (ton) jet, (soma) pressé,/ pour (apporter) le prix-de-victoire ainsi que le renom !",
   "09.052.01": "Puisse (le soma) résidant au ciel, gagneur de richesses, nous apporter le prix-de-victoire grâce à (son) jus !/ (Une fois) pressé, coule tout autour sur le filtre !",
   "09.052.02": "Par tes chemins antiques, sur le (tamis en) poil(s) de brebis, que le (soma) aimé aille/ tout autour, en mille coulées, continuement !",
   "09.052.03": "Celui qui est pareil à un pot, ébranle le, ô suc-de-soma, ébranle pour ainsi dire le don (lui-même) ;/ ô toi (soma) qui donnes des coups-mortels, ébranle par des coups-mortels (celui qui ne donne pas) !",
   "09.052.04": "O suc-de-soma tant invoqué, ra(bats) l'énergie de ces gens,/ (de celui notamment) qui nous dresse des embûches !",
   "09.052.05": "Avec (tes) cent assistances, ô suc-de-soma, ou (ton) millier de brillantes (assistances),/ clarifie toi pour nous, toi qui donnes-libéralement la richesse !",
   "09.053.01": "Tes énergies se sont dressées, pourfendant le démon, ô (soma) qui possèdes les pierres (à presser)./ Chasse les inimitiés tout autour !",
   "09.053.02": "Avec ce (chant) je veux louer (Soma) d'un cœur impavide, (en sorte d'être celui) qui d'une force-formidable abat-et-frappe/ dans la mêlée des chars, quand est mis l'enjeu (de la lutte).",
   "09.053.03": "Les volontés de ce Pavamāna sont hors de l'atteinte-agressive d'un (homme) mal intentionné./ Brise (ô soma) celui qui te fait la guerre !",
   "09.053.04": "Ce (soma) alezan, qui meut l'ivresse, (les officiants) le mettent en branle pour (qu'il atteigne) les rivières, (ce soma) gagnant-du-prix,/ suc enivrant, pour Indra.",
   "09.054.01": "Conformément à son éclat antique, (les officiants) ont trait pour eux-mêmes le clair (soma), impavides,/ (le soma pareil à du) lait, (le puisant au) Prophète qui gagne mille (biens).",
   "09.054.02": "Ce (soma-) ci est sous la vue comme le soleil, ce (soma)-ci court aux étangs,/ aux sept étendues-déclives, (jusqu')au ciel ;",
   "09.054.03": "ce (soma-) ci se tient-debout, se clarifiant, au-dessus de tous les mondes,/ le soma, pareil au dieu Soleil.",
   "09.054.04": "Autour de nous, pour l'invite aux dieux, tu répands les prix-de-victoire consistant en vaches,/ te clarifiant ô suc-de-soma toi qui aimes Indra.",
   "09.055.01": "Répands autour de nous, grâce à (ton) jus, orge après orge, floraison après floraison,/ ô soma, ainsi que toutes choses bénéfiques !",
   "09.055.02": "O suc-de-soma, puisque ta louange (est à pied d'œuvre), puisqu’il y a (eu) naissance de ton jus,/ assieds toi sur la litière aimée !",
   "09.055.03": "O toi qui procures des vaches, qui procures des chevaux, clarifie toi donc pour nous, ô soma, avec (ton) jus,/ par les jours les plus proches (à venir) !",
   "09.055.04": "(En tant qu’un être) qui force (la victoire) sans être (lui-même) forcé, (qui) frappe l'ennemi (l’)ayant attaqué,/ tel (étant), clarifie toi, (ô soma) qui conquiers mille (biens) !",
   "09.056.01": "Tout autour le soma répand l'Ordre puissant, (lui qui est un coursier) rapide, (coulant) dans le filtre,/ dis(persant et) frappant les démonialités, cherchant les dieux,",
   "09.056.02": "quand le soma coule (vers) le prix-de-victoire, (en) cent jets actifs,/ pénétrant l'amitié d'Indra.",
   "09.056.03": "Vers toi les dix jeunes-femmes [les doigts] ont crié-d'allégresse comme une jeune-fille (vers son) amant./ Tu es nettoyé, ô soma, pour gagner (des prix).",
   "09.056.04": "Toi qui es doux au goût, ô suc de soma, pour Indra, pour Viṣṇu coule tout autour !/ Les maîtres, les laudateurs, garde les de l'angoisse !",
   "09.057.01": "Elles s'avancent intarissables, tes coulées, comme les pluies du ciel,/ en direction du prix-de-victoire milluple.",
   "09.057.02": "Regardant en direction de tous les arts-poétiques aimés (le soma) coule,/ l'alezan, brandissant les armes.",
   "09.057.03": "Nettoyé puissamment par les Āyu comme un Roi suzerain, aux vœux favorables,/ il s'assied comme un faucon dans les (cuveaux de) bois.",
   "09.057.04": "Tel (étant), tous les biens-matériels (qui émanent) du ciel et aussi de la terre,/ en te clarifiant, ô suc-de-soma, apporte les nous !",
   "09.058.01": "En traversant (les eaux), ce (dieu) enivrant court, coulée de jus pressé ;/ en traversant (les eaux), ce (dieu) enivrant court.",
   "09.058.02": "L'Aurore connaît les biens-matériels du mortel, la déesse (connaît comment lui octroyer sa) faveur./ En traversant, etc.",
   "09.058.03": "De (la part de) Dhvasra, de Puruṣanti, nous recevons (en honoraires) des milliers (de vaches)./ En traversant, etc.",
   "09.058.04": "(Eux deux) de qui nous recevons continuement trente et mille (vaches).../ En traversant, etc.",
   "09.059.01": "Clarifie toi, toi qui conquiers des vaches, qui conquiers des chevaux, qui conquiers tous (biens), ô soma, qui conquiers des choses plaisantes ;/ apporte un trésor consistant en descendance !",
   "09.059.02": "Clarifie toi pour les eaux, toi qui es impossible à tromper, clarifie toi pour les plantes,/ clarifie toi pour les inspirations (des humains) !",
   "09.059.03": "Toi, ô soma qui es Pavamāna, traverse tous les mauvais passages ;/ Poète, assieds toi sur la litière (rituelle) !",
   "09.059.04": "O Pavamāna, procure le soleil! (Dès que tu) naquis, tu fus grand :/ ô suc-de-soma, (aujourd'hui) tu es en vérité au-dessus de tous (les êtres).",
   "09.060.01": "Entonnez en rythme-de-gāyatrī un chant pour Pavamāna (le dieu) qui circule au loin,/ le suc-de-soma aux mille regards !",
   "09.060.02": "C'est toi, (dieu) aux mille regards et aux mille bénéfices, (que les officiants) ont clarifié-à-l'instant par-delà le (tamis en) poil(s de brebis).",
   "09.060.03": "Pavamāna s'est écoulé par-delà (le tamis en) poils (de brebis) ; il court vers les récipients,/ en pénétrant le cœur d 'Indra.",
   "09.060.04": "Pour qu'Indra soit généreux, ô soma, pour (notre) salut, clarifie toi, ô toi qui circules au loin ;/ apporte le sperme porteur de descendance !",
   "09.061.01": "Grâce à cette invite (aux dieux), coule (ô soma) tout autour (d'Indra) qui dans tes ivresses, ô suc-de-soma/ frappa (et) abattit neuf et nonante",
   "09.061.02": "forteresses en un même jour au bénéfice de Divodāsa dont la pensée était (fixée) ainsi (qu'il convient; qui frappa et abattit) Śambara,/ enfin (qui sauva) ce-célèbre Turvaśa (accompagné de) Yadu.",
   "09.061.03": "Répands tout autour pour nous (la possession du) cheval, toi qui procures les chevaux, la possession de vaches, ô suc-de-soma,/ la possession d'or, les jouissances milluples !",
   "09.061.04": "De toi Pavamāna nous (autres) voulons l'amitié,/ cependant-que-tu-inondes le filtre.",
   "09.061.05": "Tes vagues qui se répandent vers le filtre en coulée (continue),/ (au nom) d'elles sois nous pitoyable, ô soma !",
   "09.061.06": "Tel (étant), te clarifiant, apporte nous la richesse, la jouissance faite d'hommes-utiles,/ toi qui le peux, ô soma, (en sorte qu'elle arrive) de toutes parts !",
   "09.061.07": "Le voici, ce-célèbre (soma que) les dix doigts nettoient, lui qui a les fleuves pour mères ;/ on l'a compté au nombre des Āditya.",
   "09.061.08": "Il s'associe à Indra ainsi qu'à Vāyu, (le soma) pressé, (quand il va) dans le filtre ;/ il s'as(socie) aux rayons du soleil.",
   "09.061.09": "Tel (étant), clarifie toi pour nous, toi qui es plein de miel pour Bhaga, pour Vāyu, pour Pūṣaṇ,/ plaisant pour Mitra et pour Varuṇa !",
   "09.061.10": "En haut est la naissance de ta plante ; étant au ciel, c'est sur terre (qu'elle) a reçu/ protection formidable (et) grand renom.",
   "09.061.11": "Grâce au (soma) nous voulons-gagner à nous tous les prestiges (pris) à l'Étranger,/ (ceux) des humains (en général), en cherchant à vaincre.",
   "09.061.12": "Tel (étant), pour Indra — (ce dieu) digne qu'on lui sacrifie —, pour Varuṇa, pour les Marut,/ coule tout autour, toi qui procures le large-espace !",
   "09.061.13": "Vers le suc-de-soma (qui, une fois) né, traverse les eaux, brise (la résistance), s'environne (du lait) des vaches,/ les dieux se sont approchés.",
   "09.061.14": "Ce (soma), en vérité, que nos chants l'invigorent, tels (des vaches) ayant-un-rejeton-commun (invigorent leur) veau,/ (ce soma) qui gagne le cœur d'Indra !",
   "09.061.15": "Coule, ô soma, pour le salut (de) nos vache(s), donne-pour-lait une jouissance gonflante,/ accroîs l'océan (sômique) digne de l'hymne !",
   "09.061.16": "Pavamāna a engendré la haute lumière propre à (Agni) Vaiśvānara,/ comme (les dieux ont engendré) le tonnerre éclatant du ciel.",
   "09.061.17": "Ta sève, à toi Pavamāna, ivresse qui écarte l'infortune, ô Roi,/ elle coule à travers le (tamis en) poil(s) de brebis.",
   "09.061.18": "O Pavamāna, ta sève brille au loin, efficace, éclatante,/ lumière (permettant à) tout (homme) de voir le soleil.",
   "09.061.19": "Ton ivresse délectable, clarifie t'en avec ce jus (tien),/ toi qui invites les dieux, qui frappes ceux aux paroles méchantes.",
   "09.061.20": "(Tu es) le frappeur de Vr̥tra l'hostile, le gagneur du prix-de-victoire, jour après jour,/ tu es (aussi) gagnant de vaches et gagnant de chevaux.",
   "09.061.21": "(Soma) couleur-d'or, sois (celui) qui se mélange aux (laits des) vaches-laitières, comme à (des femmes au) beau giron,/ t'asseyant comme un faucon en (ton) séjour-natal !",
   "09.061.22": "Tel (étant), clarifie toi, toi qui assistas Indra pour tuer Vr̥tra,/ lequel bloquait les eaux puissantes !",
   "09.061.23": "(Devenant grâce à toi), ô soma généreux, pourvus d'hommes-utiles, puissions-nous conquérir des trésors !/ Te clarifiant, invigore nos chants !",
   "09.061.24": "Favorisés par toi, (munis) de ton assistance, puissions-nous être ceux qui vainquent les agressions !/ O soma, veille sur les vœux !",
   "09.061.25": "Frappant (et) re(foulant) les ennemis, re(foulant) les impies, le soma se clarifie,/ en allant au rendez-vous d'Indra.",
   "09.061.26": "Apporte nous de grandes richesses, ô Pavamāna, frappe les ennemis,/ octroie, ô suc-de-soma, la gloire faite d'hommes-utiles !",
   "09.061.27": "Même cent fourberies ne sauraient te perdre, (quand) tu cherches à donner un bienfait,/ vu qu'en te clarifiant, tu te-montres-généreux.",
   "09.061.28": "Clarifie toi, ô suc-de-soma (qui es) un taureau, (soma) pressé ; rends nous glorieux parmi les gens ;/ frappe (et) re(foule) toutes inimitiés !",
   "09.061.29": "Dans cette amitié tienne, dans ton éclat éminent, ô suc-de-soma, puissions-nous/ triompher de ceux qui (nous) attaquent !",
   "09.061.30": "Tes armes redoutables, acérées, qui sont (aptes) à blesser,/ (avec elles) protège nous de l'hostilité quelle qu'elle soit !",
   "09.062.01": "Les voici (qui) ont été lâchés à travers le filtre, les sucs-de-soma, (chevaux) rapides,/ pour (atteindre) toutes choses bénéfiques,",
   "09.062.02": "détruisant les maints mauvais passages, faisant de bons passages pour (nos) enfant(s),/ (ces soma) gagnants-du-prix, pour (nos) coursier(s), continuement,",
   "09.062.03": "faisant un large-espace pour (nos) vache(s), (les soma) coulent pour (recevoir notre) eulogie,/ (pour nous assurer) à nous-mêmes une bénédiction constante.",
   "09.062.04": "La tige (de soma) a été pressée pour l'ivresse dans les eaux, (la tige) efficace, sise sur la montagne ;/ elle s'est installée comme un faucon en (son) séjour-natal.",
   "09.062.05": "La belle plante aimée des dieux, (le soma) lavé dans les eaux, pressé par les maîtres,/ les vaches (l’)assaisonnent de laits.",
   "09.062.06": "Alors, tels les gens-incitant (à la course) un cheval, (les officiants) ont embelli le (soma) pour (Indra) immortel,/ la sève de liqueur pour le breuvage-en-commun.",
   "09.062.07": "Tes coulées dégouttant de liqueur qui se sont répandues, ô suc-de-soma, pour (nous) favoriser,/ avec elles tu t'es installé sur le filtre.",
   "09.062.08": "Tel (étant), coule pour Indra, pour qu'il boive, à travers (le tamis en) poils de brebis,/ t'asseyant dans (ton) séjour-natal, (à savoir) dans les (cuves de) bois.",
   "09.062.09": "Toi, ô suc-de-soma, coule tout autour, toi qui es le plus agréable (au goût), pour les Aṅgiras’,/ toi qui procures le large-espace, (en apportant) beurre-fondu (et) lait !",
   "09.062.10": "Voici (le soma) marchant au loin, mis en place (par les officiants), (voici) Pavamāna : il se signale,/ mettant en branle son alliance puissante.",
   "09.062.11": "Voici le taureau, à la volonté de taureau, Pavamāna, destructeur des récitations mauvaises ;/ qu'il fasse des biens-matériels pour l'adorateur !",
   "09.062.12": "Donne-en-te-clarifiant la richesse milluple, faite de vaches, faite de chevaux,/ très lumineuse, très désirable !",
   "09.062.13": "Le voici ce célèbre (soma qui) se déverse tout autour, étant puissamment nettoyé par les Āyu,/ (ce dieu) à la vaste démarche, à l'inspiration d'un poète.",
   "09.062.14": "Lui qui (donne) mille faveurs, cent bienfaits, qui mesure l'espace, (ce) Poète/ se clarifie pour Indra; (il est) l'ivresse.",
   "09.062.15": "Né sur la montagne, loué ici (même), le suc-de-soma est mis en place pour Indra/ comme l'oiseau en (son) séjour-natal, (à savoir, son) nid.",
   "09.062.16": "Pavamāna pressé par les maîtres, le soma s'est avancé comme vers le prix-de-victoire,/ pour s'asseoir dans les cuves selon (sa) capacité.",
   "09.062.17": "C'est lui que (les officiants) attellent au char à trois dos, à trois caissons, afin qu'il roule,/ à l'aide des sept pensées-poétiques des Prophètes.",
   "09.062.18": "Ce (soma), ô presseurs, (ce) coursier gagnant l'enjeu, (ce dieu) alezan,/ mettez le en branle afin qu'il coure, (ce dieu) vainqueur-des-prix !",
   "09.062.19": "En pénétrant dans la cuve, (le soma) pressé, coulant pour (procurer) tous prestiges,/ se tient, tel un héros, parmi les vaches.",
   "09.062.20": "O suc-de-soma, les Āyu traient de toi le lait pour l'ivresse,/ les dieux (traient) la liqueur pour les dieux.",
   "09.062.21": "Laissez couler pour nous le soma dans le filtre, (le soma) tout plein de liqueur,/ pour les dieux, lui qui est le mieux entendu des dieux !",
   "09.062.22": "Voici les soma (qui) ont été lâchés, eux qui sont chantés en vue d'un grand renom,/ (accompagnés) de la coulée du plus enivrant (soma).",
   "09.062.23": "Pour (procurer) des biens-consistant-en-vaches, pour (répondre à) l'invite (des dieux), pour (assurer) des forces-viriles, tu coules en te clarifiant ;/ coule tout autour, toi qui gagnes le prix-de-victoire !",
   "09.062.24": "Et encore : répands nous les jouissances consistant en vaches, toutes (jouissances), environnées de rythmes,/ (toi-même étant) chanté par Jamadagni !",
   "09.062.25": "Clarifie toi, ô soma (qui vas) en tête de la parole, avec (tes) assistances éclatantes,/ en vue de (nous procurer) tous pouvoirs-poétiques!",
   "09.062.26": "Toi qui suscites les eaux océaniennes (ainsi que) les paroles, (allant toi-même) en tête (de la parole),/ clarifie toi, ô toi qui mets en mouvement toutes choses !",
   "09.062.27": "C'est pour toi, ô Poète, que ces mondes se sont disposés, pour (honorer ta) grandeur, ô soma !/ Pour toi coulent les fleuves.",
   "09.062.28": "Vont en avant tes coulées, telles les pluies du ciel, intarissables,/ en direction (du lait leur servant de) clair soubassement.",
   "09.062.29": "Pour Indra clarifiez le suc-de-soma formidable, qui donne-succès à la force-agissante,/ (clarifiez le soma) puissant, qui invite au bienfait !",
   "09.062.30": "Pavamāna, R̥ta (incarné), Poète, le soma s'est assis sur le filtre,/ conférant au laudateur abondance d'hommes-utiles.",
   "09.063.01": "Donne-en-te-clarifiant la richesse milluple, ô soma, l'abondance en hommes-utiles,/ maintiens en nous les renommées !",
   "09.063.02": "Tu gonfles ta jouissance et ta force-nourricière pour Indra, toi (ô soma, qui es) le plus enivrant ;/ tu te déposes dans les cuves.",
   "09.063.03": "Pressé pour Indra, pour Viṣṇu, le soma a coulé dans le vase./ Qu'il soit plein de miel pour Vāyu !",
   "09.063.04": "Voici les rapides (chevaux, qui) ont été lâchés par-delà les obstacles, (ces) soma/bruns, avec (leur) coulée de R̥ta,",
   "09.063.05": "invigorant Indra, traversant les eaux, rendant toute chose âryenne,/ frappant (et) re(foulant) les impies.",
   "09.063.06": "Pressés, (les soma) coulent le long de leur espace propre, les (soma) bruns,/ les sucs, en se dirigeant vers Indra.",
   "09.063.07": "Clarifie toi par cette coulée (même) par laquelle tu fis briller le soleil,/ en mettant-en-branle les eaux humaines !",
   "09.063.08": "Pavamāna a attelé (le cheval) Etaśa au soleil, pour qu'il aille du (domaine de) Manu (au ciel) à travers l'espace-médian ;",
   "09.063.09": "en outre, ces-célèbres dix (juments) alezanes du soleil, il les a attelées pour qu'elles aillent (à travers l'espace),/ lui le suc-de-soma, en disant « c'est bien (pour aller) à Indra ».",
   "09.063.10": "Tout autour (en partant) d'ici, versez pour Vāyu (le soma) pressé, (émettez) les chants, (versez le soma) enivrant/ pour Indra dans (le tamis en) poils de brebis.",
   "09.063.11": "O Pavamāna, procure nous la richesse difficile à dépasser, ô soma,/ qui soit hors d'atteinte pour l'ennemi !",
   "09.063.12": "Répands sur (nous) la richesse milluple, consistant en vaches, en chevaux,/ pour (atteindre) le prix-de-victoire et le renom!",
   "09.063.13": "Le soma, tel le dieu Soleil, se clarifie à l'aide des pierres (le soma) pressé,/ recevant la sève dans le vase.",
   "09.063.14": "Ces (soma) clairs, en (leur) coulée de R̥ta, (ont occupé) les positions âryennes,/ ils ont coulé pour (atteindre) le prix-de-victoire fait de vaches.",
   "09.063.15": "Pressés pour Indra porte-foudre, mélangés de lait-sûri, les soma/ ont coulé par-delà le filtre.",
   "09.063.16": "En avant, ô soma qui es tout plein de liqueur, coule pour la richesse dans le filtre,/ toi qui es l'ivresse invitante de dieux par excellence.",
   "09.063.17": "C'est (ce dieu) alezan que nettoient les Āyu dans les rivières, le suc-de-soma/ qui gagne-les-prix, qui est enivrant pour Indra.",
   "09.063.18": "Donne-en-te-clarifiant la possession d'or, la possession de chevaux, ô soma, la possession d'hommes-utiles ;/ apporte le prix-de-victoire fait de vaches !",
   "09.063.19": "Tout autour, sur (le tamis en) poils de brebis, ainsi qu' (on asperge) pour le prix-de-victoire (le cheval) qui aspire au prix, aspergez/ (le soma) tout plein de liqueur pour Indra !",
   "09.063.20": "Le Poète digne d'être nettoyé, ils le nettoient par des pensées-poétiques, (ces) orateurs-inspirés, cherchant-faveur ;/ taureau mugissant avec force, (le soma) coule.",
   "09.063.21": "Le taureau soma qui, à l'aide des pensées-poétiques, traverse les eaux avec (sa) coulée de R̥ta,/ les orateurs-inspirés l'ont chanté ensemble avec les poèmes.",
   "09.063.22": "Clarifie toi, ô dieu, qui es lié aux Āyu ; que ton ivresse aille vers Indra,/ gravis Vāyu selon (ton) comportement-naturel !",
   "09.063.23": "O Pavamāna, tu verses-à-profusion la richesse digne de renom, ô soma ;/ entre en (être) aimé dans l'océan (de lait) !",
   "09.063.24": "Re(foulant et) frappant les inimitiés, tu te clarifies, ô soma, qui procures la force-inspirante, qui enivres ;/ chasse la gent impie !",
   "09.063.25": "Les Pavamāna ont été lâchés, les soma clairs, les sucs,/ pour (atteindre) tous pouvoirs-poétiques ;",
   "09.063.26": "les Pavamāna, (coursiers) rapides, beaux sucs-de-soma, ont été lâchés,/ re(foulant et) frappant toutes hostilités ;",
   "09.063.27": "les Pavamāna, du (haut du) ciel, de l'espace médian ont été lâchés/ sur le dos de la terre.",
   "09.063.28": "Te clarifiant, ô soma, d'une coulée, ô suc, re(foulant) toutes nocivités, frappe les démonialités, ô dieu de bonne force-inspirante !",
   "09.063.29": "Re(foulant et) frappant les démons, ô soma, coule, en mugissant avec force, pour/ (atteindre) l'énergie éclatante, éminente !",
   "09.063.30": "Fais nous tenir des biens-matériels, ô soma, célestes (aussi bien que) terrestres,/ ô suc, (bref) , toutes choses délectables!",
   "09.064.01": "Tu es, ô soma, un taureau éclatant, un taureau, ô dieu, à la volonté-de-taureau ;/ en taureau tu as fondé (tes) comportements-naturels.",
   "09.064.02": "De toi taureau la force est celle d'un taureau, taureau (est la cuve de) bois, taureau l'ivresse ;/ vraiment, ô taureau, tu es un taureau.",
   "09.064.03": "Tel un cheval, fais mugir ensemble, (toi qui es aussi) un taureau, les vaches, ô suc de soma, ensemble (fais hennir) les coursiers ;/ ouvre nous les portes vers la richesse !",
   "09.064.04": "Ils ont été lâchés, les soma gagnants-du-prix, par désir (de conquérir) des vaches, des chevaux,/ les clairs (soma) rapides, par désir (de conquérir) des hommes-utiles.",
   "09.064.05": "Embellis par les (officiants) voués-au-R̥ta, nettoyés entre (leurs) bras,/ ils se clarifient dans (le tamis en) poil(s) de brebis.",
   "09.064.06": "Ces soma, qu'à l'adorateur ils confèrent-en-se-clarifiant tous les biens-matériels, célestes,/ terrestres (aussi bien que) ceux de l'espace-médian !",
   "09.064.07": "De toi Pavamāna qui connais tout, les lâchers (de liquide) ont été lâchés en avant,/ tels les rayons du soleil.",
   "09.064.08": "Faisant (comme) une bannière, du (haut du) ciel tu coules pour (atteindre) toutes les formes-concrètes ;/ (étant) océan, ô soma, tu gonfles.",
   "09.064.09": "(Une fois) mis en branle, tu lances la parole, ô Pavamāna, pour qu'elle se répande au loin ;/ tu as henni comme le dieu Soleil.",
   "09.064.10": "Le suc-de-soma s'est clarifié, (le suc) signalé, aimé, par l'œuvre-spirituelle des poètes ;/ qu'il lance (la vague) comme le cocher-du-char (lance) le cheval,",
   "09.064.11": "ta vague qui dans le filtre a coulé tout autour, invitant les dieux,/ s'asseyant au séjour-natal du R̥ta !",
   "09.064.12": "Tel (étant), coule pour nous dans le filtre, toi, ivresse invitante de dieux par excellence,/ ô suc-de-soma, pour Indra, pour qu'il boive !",
   "09.064.13": "Pour (procurer) la jouissance, clarifie toi avec (ta) coulée, étant nettoyé par les (opérateurs) qui-savent-le-sens ;/ ô suc-de-soma, avec (ton) éclat va vers les vaches !",
   "09.064.14": "En te clarifiant, crée l'espace-large, la force-nourricière pour l'homme, ô toi qui aimes le chant;/ ô alezan, étant lâché sur le mélange (de soma et de lait) !",
   "09.064.15": "Te clarifiant pour l'invite aux dieux, va au rendez-vous d'Indra,/ brillant, tenu-en-mains par les gagnants-du-prix !",
   "09.064.16": "(Une fois) mis en branle, les sucs-de-soma rapides ont été lancés en avant / vers l'océan, ayant été mobilisés par la pensée-poétique.",
   "09.064.17": "Nettoyés puissamment, les vivaces sucs-de-soma sont allés de leur gré/ vers l'océan, vers le séjour-natal du R̥ta.",
   "09.064.18": "Toi qui nous es dévoué, entoure tous nos biens-matériels avec (ta) force-formidable,/ veille sur notre protection consistant en hommes-utiles !",
   "09.064.19": "Il hennit, Etaśa, le cheval-d'attelage, quand, attelé par les chantres, il a été placé/ en avant, en (son) séjour, (à savoir) sur l'océan.",
   "09.064.20": "Quand (le dieu) rapide s'installe au séjour-natal, doré, du R̥ta,/ il laisse-en-arrière les (humains) dénués de prévoyance.",
   "09.064.21": "Vers lui les Vigilants ont crié-d'allégresse, eux prévoyants, (qui) cherchent à atteindre (Soma) ;/ plongent (dans les ténèbres) ceux qui sont incompréhensifs.",
   "09.064.22": "Pour Indra accompagné des Maruts, ô suc-de-soma, clarifie toi, (toi qui es) très riche en liqueur, / pour t'installer au séjour-natal du R̥ta !",
   "09.064.23": "C'est toi que les orateurs-inspirés, eux qui savent la parole, équipent entièrement, (ces) ordonnateurs (du culte) ;/ ils te nettoient pleinement, (ces) Āyu.",
   "09.064.24": "Ta sève, Mitra, Aryamaṇ, Varuṇa la boivent, ô Poète,/ les Marut (aussi, à toi) Pavamāna.",
   "09.064.25": "Toi, ô soma, en te clarifiant tu lances la parole qui comprend l'inspiration ;/ ô suc-de-soma, (la parole) comportant mille bénéfices ;",
   "09.064.26": "oui, la parole comportant mille bénéfices, ô soma, la munificente,/ te clarifiant, ô suc-de-soma, amène la ici !",
   "09.064.27": "Te clarifiant, ô suc-de-soma, ô toi très invoqué des gens que voici,/ (suc) aimé, pénètre dans l'océan (de lait) !",
   "09.064.28": "D'un éclat fortement illuminant, d'une structure environnée de rythmes,/ (tels sont) les soma clairs, mélangés (du lait) des vaches.",
   "09.064.29": "Aiguillonné par les aiguillonneurs, tenu-en-mains, (le soma) gagnant-du-prix a marché vers le prix-de-victoire,/ (s'asseyant au séjour du R̥ta) comme les dévots qui s'(y) asseoient.",
   "09.064.30": "O Soma, toi qui, comme il sied, as été uni (au sacrifice) pour le bien-être (des hommes), toi, le Poète du ciel,/ clarifie toi pour être vu (par tous comme) le soleil !",
   "09.065.01": "Les aurores mettent en branle le soleil, les sœurs germaines (mettent en branle leur) époux,/ le suc-de-soma puissant, en manifestant leur force.",
   "09.065.02": "O Pavamāna, avec (ton) éclat (succédant à un autre) éclat, dieu (émanant) des dieux,/ pénètre tous les biens-matériels !",
   "09.065.03": "O Pavamāna, donne-en-te-clarifiant l'eulogie, la pluie, l'hommage aux dieux,/ pour (nous assurer) la jouissance, de façon constante !",
   "09.065.04": "Tu es en effet un taureau : toi qui brilles avec (ton) rayon, nous t'invoquons,/ ô Pavamāna, nous qui avons de bonnes intentions.",
   "09.065.05": "Donne-en-te-clarifiant l'abondance en hommes-utiles, t'enivrant, (toi, ô soma) bien armé ;/ ici même, ô suc-de-soma, arrive !",
   "09.065.06": "Quand tu es inondé d'eaux, étant nettoyé entre les deux bras (de l'opérateur),/ tu atteins le siège-commun (fait) de bois.",
   "09.065.07": "Pour Soma Pavamāna entonnez le chant comme (fit jadis) Vyaśva,/ pour le puissant (Soma) aux mille regards !",
   "09.065.08": "(Le soma) dont (les officiants) mettent en branle à l'aide des pierres la couleur alezane, dégouttante de liqueur,/ (ce) suc-de-soma, pour Indra, pour qu'il boive,",
   "09.065.09": "c'est toi, gagnant-du-prix, ayant conquis tous les enjeux,/ de qui nous voulons l'amitié.",
   "09.065.10": "Clarifie toi en taureau, avec (ta) coulée, (toi qui es) enivrant pour (les Marut et pour Indra) accompagné des Marut,/ toi qui assumes toutes choses avec (ta) force-formidable !",
   "09.065.11": "C'est toi, ô Pavamāna, mainteneur (du ciel), qui vois le soleil, qui gagnes-les-prix,/ toi que je mets en branle à l'aide des deux bras, pour (atteindre) les prix-de-victoire.",
   "09.065.12": "T'éveillant ainsi, grâce à cette parole-inspirée (mienne, ô soma) alezan, clarifie toi avec (ta) coulée,/ éperonne (Indra ton) allié pour (gagner) les prix-de-victoire !",
   "09.065.13": "Donne-nous-en-te-clarifiant, ô suc-de-soma, la jouissance puissante, toi qui es visible pour tous, / (donne la) nous, ô soma, qui procures l'issue (heureuse) !",
   "09.065.14": "Les vases ont crié-d'allégresse, ô suc-de-soma, avec les coulées (de soma), en (leur) force-formidable ;/ pénètre (en Indra) pour qu'Indra boive!",
   "09.065.15": "Toi dont (les officiants) traient la sève enivrante, violente, avec des pierres,/ clarifie toi, toi qui frappes les dresseurs-d'embûches !",
   "09.065.16": "Le roi (Soma) s'avance à l'aide des pensées-sages (des poètes), (ce) Pavamāna (qui réside) chez l'homme,/ pour aller à travers l'espace-médian (jusqu'au ciel).",
   "09.065.17": "O suc-de-soma, amène nous une floraison centuple de vaches, comportant (aussi) abondance de chevaux,/ un don de chance à (titre de) faveur !",
   "09.065.18": "Apporte nous, ô soma, la force-dominante, la vitesse, comme (on ajoute) la forme-concrète pour (donner) l'éclat (à une idée),/ une fois pressé, pour l'invite aux dieux !",
   "09.065.19": "Coule, ô soma, qui es très éclatant, vers les cuveaux-de-bois, en mugissant avec force,/ t’installant comme un faucon en (ton) séjour-natal !",
   "09.065.20": "Lui qui gagne les eaux, (ce) soma coule pour Indra, pour Vāyu, pour Varuṇa,/ pour les Marut, pour Viṣṇu.",
   "09.065.21": "Conférant la jouissance à notre progéniture, à nous-mêmes, ô soma, entièrement,/ donne-en-te-clarifiant (cette jouissance) milluple!",
   "09.065.22": "Les soma qui sont pressés dans un domaine-lointain, ceux qui (le sont) dans un domaine-proche,/ ou ceux qui (le sont) là bas au Śaryāṇavat,",
   "09.065.23": "ceux (qui le sont) chez les Ārjika, les Kr̥tvan, ceux qui le sont) au milieu des fleuves,/ ou ceux qui (le sont) parmi les cinq (espèces d') hommes,",
   "09.065.24": "qu'ils nous donnent-en-se-clarifiant la pluie (venue) du (haut du) ciel, l'abondance en hommes-utiles,/ ces sucs-de-soma pressés, (ces) dieux !",
   "09.065.25": "Il se clarifie, le (soma) désirable, l'alezan, chanté par Jamadagni,/ mis en branle sur la peau de bœuf.",
   "09.065.26": "Les (soma) clairs, mûs par une force-juvénile, tels des chevaux-d'attelage aiguillonnés, (vont) en avant,/ renforcés-par-le-mélange (avec le lait) ; ils sont lavés dans les eaux.",
   "09.065.27": "C'est toi que mettent en branle les (officiants) actifs dans les (sacrifices de soma's) pressés, pour la fonction des dieux./ Tel (étant), clarifie toi avec cet éclat (qui t'est propre) !",
   "09.065.28": "Nous voulons aujourd'hui ta force-agissante salutaire, (tel) un cheval-d'attelage,/ et le breuvage très souhaité,",
   "09.065.29": "et enivrant et délectable et inspirant et sachant-le-sens,/ et le breuvage très souhaité,",
   "09.065.30": "et la richesse et l'heureux signal, ô (soma) à la bonne force-d'inspiration, pour nos corps,/ et le breuvage très souhaité.",
   "09.066.01": "Clarifie toi, ô (soma qui t'es répandu) sur tous les peuples, pour (atteindre) tous pouvoirs-poétiques,/ en ami, propre à être invoqué par les amis !",
   "09.066.02": "Avec ces deux formes, (la pure et la mélangée), qui se tiennent face (à nous), ô soma,/ tu règnes sur toutes choses, ô Pavamāna ;",
   "09.066.03": "les formes (pl.) qui sont tiennes, tu les entoures, ô soma, de toutes parts,/ ô Pavamāna, au moyen des temps-rituels, ô Poète.",
   "09.066.04": "Clarifie toi, engendrant des jouissances, pour (atteindre) toutes choses délectables,/ en ami, pour les amis, pour (leur donner ta) faveur !",
   "09.066.05": "Tes clairs rayons s'étendent sur le dos du ciel,/ (atteignant) le filtre, ô soma, avec (tes) formes (successives).",
   "09.066.06": "Ces sept fleuves coulent selon ton instruction, ô soma;/ pour toi courent les vaches-laitières.",
   "09.066.07": "O soma, avance avec (ta) coulée, (soma) pressé, enivrant pour Indra,/ qui reçois un renom impérissable !",
   "09.066.08": "Ensemble les sept (sœurs) germaines t'ont chanté par des prières, en (te) mettant en branle,/ toi l'inspiré, dans l'arène de Vivasvant.",
   "09.066.09": "Te nettoient ensemble les vierges dans le (tamis en poils de) brebis, dans (l'eau) vive, parmi le bruit,/ quand (toi-même, en tant que) barde, es oint dans (la cuve de) bois.",
   "09.066.10": "De toi Pavamāna, ô Poète, ô porteur-du-prix, les lâchers (de liquide) ont été lâchés,/ comme des coursiers aspirant au renom.",
   "09.066.11": "Vers la cuve dégouttante de liqueur ils ont été lâchés, sur le (tamis en) poil(s) de brebis;/ les prières ont mugi.",
   "09.066.12": "Vers l'océan les sucs-de-soma sont allés comme des vaches laitières/ en leur demeure, (c'est-à-dire) dans le séjour-natal du R̥ta.",
   "09.066.13": "O suc-de-soma, pour notre grande joie les eaux coulent en avant, les fleuves,/ quand tu es revêtu (du lait) des vaches.",
   "09.066.14": "C'est pour cette amitié que, désirant atteindre (des biens), favorisés par toi,/ ô suc-de-soma, nous voulons ton amitié.",
   "09.066.15": "Clarifie toi pour la quête des vaches, pour la grande (joie), ô soma, pour (le dieu Soma) qui a un regard de maître ;/ pénètre dans le ventre d'Indra !",
   "09.066.16": "Tu es puissant, ô soma, le plus fort, le plus formidable, ô suc-de-soma, des formidables./ Étant un combattant, tu as perpétuellement vaincu.",
   "09.066.17": "Toi qui es plus formidable que les (êtres) formidables eux-mêmes, plus héros que les héros eux-mêmes,/ plus généreux que ceux-là même qui donnent beaucoup,",
   "09.066.18": "c'est toi, ô soma, (qui t'es préparé) pour la conquête du soleil, de(s) jouissance(s), de la progéniture, pour nous-mêmes./ Nous (te) voulons pour l'amitié, nous (te) voulons pour l'alliance.",
   "09.066.19": "O Agni, tu donnes-en-te-clarifiant les durées-de vie ; suscite nous la force-nourricière et la jouissance ;/ au loin repousse l'infortune!",
   "09.066.20": "Agni est le Prophète, le Pavamāna, le chapelain propre aux cinq-espèces-d'hommes :/ nous l'implorons (pour obtenir) un grand train-de-vie.",
   "09.066.21": "O Agni, clarifie toi, (dieu) aux bonnes œuvres, nous (apportant) prestige (et) abondance en hommes-utiles,/ toi qui me confères richesse (et) prospérité !",
   "09.066.22": "Pavamāna coule au-delà des nocivités pour (procurer) l'eulogie,/ lui qui, comme le soleil, est visible pour tous.",
   "09.066.23": "Nettoyé avec force par les Āyu, portant la satisfaction (rituelle), mis en place pour la (dite) satisfaction,/ le suc-de-soma (est) un coursier regardant au loin.",
   "09.066.24": "Pavamāna a engendré le haut R̥ta, la Lumière claire,/ frappant avec force les noires ténèbres.",
   "09.066.25": "De Pavamāna qui frappe avec force (les ténèbres), de l'alezan les (coulées de soma) lumineuses ont été lâchées,/ les rapides, à l'éclat vivace;",
   "09.066.26": "Pavamāna est le meilleur des cochers ; par rapport aux (êtres) beaux, il est le plus célébré (quant à son fait d'être) beau ;/ il est brillant (comme) l'or, escorté des Marut ;",
   "09.066.27": "que Pavamāna traverse (l'espace) avec (ses) rayons, lui qui gagne les prix par excellence,/ conférant au laudateur l'abondance en hommes-utiles !",
   "09.066.28": "(Une fois) pressé, le suc-de-soma s'est écoulé en avant par-dessus le filtre (en poils) de brebis ;/ se clarifiant, le suc (se dirige) vers Indra.",
   "09.066.29": "Voici le soma (qui) sur la peau de vache joue avec les pierres,/ appelant à grands cris Indra pour l'ivresse.",
   "09.066.30": "Toi de qui le lait éclatant, ô Pavamāna, fut apporté du (haut du) ciel,/ fais nous grâce avec cela, pour que (nous) vivions !",
   "09.067.01": "Toi, ô soma, tu es le mainteneur enivrant, le plus formidable (des dieux) quant au rite ;/ clarifie toi, toi qui fais largesse de richesses !",
   "09.067.02": "Toi, (soma) pressé, enivreur d'hommes, (tu as) couru, (dieu) très enivrant,/ pour Indra, (toi qui es) un patron-généreux, avec (ta) plante.",
   "09.067.03": "Toi, (une fois) pressé à l'aide des pierres, coule en hurlant puissamment,/ pour (atteindre) l'énergie éclatante, éminente !",
   "09.067.04": "Le suc-de-soma, mis en branle, coule à travers le (tamis en) poils de brebis ;/ l'alezan a henni vers le prix-de-victoire.",
   "09.067.05": "O suc-de-soma, tu coules à travers (le tamis en poils) de brebis, vers les renoms, vers les choses-bénéfiques,/ vers les prix-de-victoire, ô soma, qui consistent en vaches.",
   "09.067.06": "Apporte nous, ô suc-de-soma, la richesse centuple, faite de vaches, faite de chevaux,/ ô soma, (la richesse) milluple !",
   "09.067.07": "Les Pavamāna, les sucs-de-soma, (passant) à travers le filtre, rapides,/ ont atteint Indra dans leurs trajets.",
   "09.067.08": "Cime, sève sômique, suc (fait) pour Indra, (soma) primordial,/ l'Āyu se clarifie pour l'Āyu.",
   "09.067.09": "Les aurores mettent en branle le soleil ; le Pavamāna dégouttant de liqueur, /elles ont ensemble retenti vers (lui) à l'aide du chant.",
   "09.067.10": "Notre soutien est Pūṣaṇ), (le dieu) qui a des boucs pour chevaux, (qui va de) trajet en trajet ;/ qu'il nous donne part aux jeunes-filles !",
   "09.067.11": "Voici le soma (qui) se clarifie pour le (dieu) porteur de tresses, comme (se clarifie) le beurre-fondu doux (au goût) ;/ qu'il nous donne...",
   "09.067.12": "Voici le (soma) pressé pour toi, ô (dieu) saisisseur, (qui) se clarifie comme le beurre-fondu pur ;/ qu'il nous donne...",
   "09.067.13": "Rejeton de la parole des poètes, clarifie toi, ô soma, avec (ta) coulée !/ Tu es parmi les dieux celui qui confère les trésors.",
   "09.067.14": "Dans les vases accourt le faucon, il plonge dans (le récipient, sa) cuirasse,/ mugissant avec force en direction des cuveaux-de-bois.",
   "09.067.15": "Ta sève, ô soma, a été répandue tout autour dans le vase, (la sève) pressée ;/ elle coule comme un faucon qui fonce.",
   "09.067.16": "Clarifie toi, ô soma, enivrant pour Indra, toi qui es plein de liqueur !",
   "09.067.17": "(Les sucs) ont été lâchés pour l'invite aux dieux, comme des chars qui vont-au-prix-de-victoire ;",
   "09.067.18": "ces (soma) pressés, très enivrants, purs, ont été lâchés vers Vāyu.",
   "09.067.19": "Frappé par la pierre, ô soma qui es célébré, tu vas vers le filtre,/ conférant au laudateur l'abondance en hommes-utiles.",
   "09.067.20": "Le voici (donc), frappé (par les pierres, ce soma) célébré, il plonge à travers le filtre,/ (ce) frappeur de démons, (à travers le filtre en) poil(s) de brebis.",
   "09.067.21": "(Tout) péril, soit près, soit loin, qui me rencontre ici,/ ô Pavamāna, dis(perse le en le) frappant!",
   "09.067.22": "Ce Pavamāna aujourd'hui qui circule au loin, qui est un clarificateur,/ qu'il nous clarifie avec le filtre !",
   "09.067.23": "le filtre qui a été tendu dedans ta flamme, ô Agni,/ clarifies en notre Formule !",
   "09.067.24": "ton filtre, ô Agni, muni de flammes, clarifie nous en,/ clarifie nous avec les produits de la Formule !",
   "09.067.25": "Avec (ces) deux (choses, à savoir) le filtre et le produit (de la Formule), ô dieu Savitr̥,/ clarifie moi de toutes parts !",
   "09.067.26": "Toi-même, ô dieu Savitr̥, avec les trois positions les plus éminentes, ô soma,/ ô Agni, avec les forces-décisives clarifie nous !",
   "09.067.27": "Que me clarifie la gent divine, (me) clarifient les Vasu grâce à (ma) prière,/ ô Tous dieux, clarifiez moi, ô Jātavedas, clarifie moi!",
   "09.067.28": "Gonfle toi en avant, coule en avant, ô soma, avec toutes (tes) tiges,/ oblation suprême pour les dieux !",
   "09.067.29": "Nous ap(prochant du soma) aimé, (ce) merveilleux jeune-homme que renforce l'oblation,/ nous avons marché, portant l'hommage.",
   "09.067.30": "D'Alāyya la hache s'est égarée : amène-la-en-te-clarifiant, ô dieu soma, (elle qui est) tout comme une taupe, ô dieu soma !",
   "09.067.31": "Celui qui sait-par-cœur les versets à Pavamāna, sève accumulée par les Prophètes,/ il mange toute (sa nourriture) purifiée, assaisonnée par Mātariśvan ;",
   "09.067.32": "celui qui sait-par-cœur les versets à Pavamāna, sève accumulée par les Prophètes,/ à celui-là Sarasvatī donne-pour-traite le lait, la graisse, le miel, l'eau."
}