{
   "10.129.01": "Non-being then existed not nor being: There was no air, nor sky that is beyond it. What was concealed? Wherein? In whose protection? And was there deep unfathomable water?",
   "10.129.02": "Death then existed not nor life immortal; Of neither night nor day was any token. By its inherent force the One breathed windless: No other thing than that beyond existed.",
   "10.129.03": "Darkness there was at first by darkness hidden; Without distinctive marks, this all was water. That which, becoming, by the void was covered. That One by force of heat came into being.",
   "10.129.04": "Desire entered the One in the beginning: It was the earliest seed, of thought the product. The sages searching in their hearts with wisdom, Found out the bond of being in non-being.",
   "10.129.05": "Their ray extended light across the darkness: But was the One above or was it under? Creative force was there, and fertile power: Below was energy, above was impulse.",
   "10.129.06": "Who knows for certain? Who shall here declare it? Whence was it born, and whence came this creation? The gods were born after this world's creation: Then who can know from whence it has arisen?",
   "10.129.07": "None knoweth whence creation has arisen; And whether he has or has not produced it: He who surveys it in the highest heaven, He only knows, or haply he may know not.",
   "07.088.01": "Present to Varuṇa the gracious giver A hymn, Vasiṣṭha, bright and very pleasant, That he may bring to us the lofty, holy And mighty steed that grants a thousand bounties.",
   "07.088.02": "Now having come to Varuṇa's full aspect, I think his countenance like that of Agni; May he, the lord, lead me to see the marvel: The light and darkness hidden in the cavern.",
   "07.088.03": "When Varuṇa and I the boat have mounted And have propelled it to the midst of ocean; When we shall move across the waters' ridges We'll waver in the swing to raise its lustre.",
   "07.088.04": "Varuna has placed Vasiṣṭha in the vessel; The sage benignant by his mighty power His praiser in prosperity has settled, As long as days endure, as long as mornings.",
   "07.088.05": "What has become of those our former friendships, When we two held erstwhile unbroken converse? O sovereign Varuṇa, thy lofty mansion, Thy home, I entered, with its thousand portals.",
   "07.088.06": "Who is, O Varuṇa, thy constant kinsman. Once dear, though sinful now, he daims thy friendships. As guilty may we not, O wizard, suffer: Do thou, O sage, grant shelter to thy praiser.",
   "07.088.07": "O may we, in these fixed abodes abiding. Now from the lap of Aditi find favour. May from his noose king Varuṇa release us. Ye gods protect us evermore with blessings.",
   "03.059.01": "Mitra stirs men to action when he calls them; Mitra supported both the Earth and Heaven; Mitra with steady eye regards the people: To Mitra offer now with ghee oblation.",
   "03.059.02": "Let him who, Mitra, brings thee food be foremost. Who to thy law, O Āditya, pays homage. Aided by thee no man is slain or vanquished; To him from near or far no trouble reaches.",
   "03.059.03": "Free from disease, in sacred food delighting. With knees set firm upon the earth's wide surface, In this Āditya's sacred law abiding, May we remain in the good will of Mitra.",
   "03.059.04": "This Mitra, worshipped and most propitious, Is born to wield fair sway, a king, disposer. May we rest in the grace of him the holy, May we abide in his most kindly favour.",
   "03.059.05": "The great Āditya to be served with homage, Who stirs mankind, to singers most propitious: To him most highly to be praised, to Mitra, In fire present acceptable oblations.",
   "03.059.06": "The grace of Mitra, the divine Supporter of mankind, brings gain And splendour with most brilliant fame,",
   "03.059.07": "Mitra, whose fame is spread abroad, In greatness who transcends the sky, And in renown transcends the earth:",
   "03.059.08": "The peoples five submission yield To Mitra ever strong to aid 'Tis he who all the gods sustains.",
   "03.059.09": "Mitra, among both gods and men, For him who strews the sacred grass Has furnished food fixed by his will.",
   "07.061.01": "The beauteous eye of Varuna and Mitra, The Sun, now rises up, his light extending. Who with his gaze looks down upon all creatures: He ever notes the burning zeal of mortals.",
   "07.061.02": "This pious priest, heard far away, here utters His hymn for you, O Varuṇa and Mitra: Do ye, O sages, treat his prayers with favour. And may his autumns be replete with wisdom.",
   "07.061.03": "From wide-spread earth, O Varuṇa and Mitra, Ye bounteous gods, and from the lofty heaven. Ye have disposed your wandering spies in dwellings And plants, ye who with watchful eye protect us.",
   "07.061.04": "Praise thou the law of Varuṇa and Mitra: Their force the two worlds keeps with might asunder. The months of impious men shall pass by sonless; May those on worship bent increase their homestead.",
   "07.061.05": "Ye both are wise, O mighty ones, for you two These lauds are sung without deceit or magic. Avenging spies pursue men's falsehoods closely: There are no secrets that ye cannot fathom.",
   "07.061.06": "With reverence I will consecrate your offering; With zeal I call you, Varuṇa and Mitra. These novel thoughts to praise you are intended: May these the prayers that I have offered please you.",
   "07.061.07": "For you, O gods, this service has been rendered At sacrifices, Varuṇa and Mitra, Across all dangers do ye safely take us. Ye gods protect us evermore with blessings.",
   "02.027.01": "These songs that drip with butter, with the ladle I ever to the kings, Ādityas, offer. May Mitra, Aryaman, and Bhaga hear us, Dakṣa, the mighty Varuṇa, and Aṃśa.",
   "02.027.02": "This praise of mine may Aryaman and Mitra And Varuṇa to-day accept united: The radiant Ādityas, like sword-blades shining, From guile and falsehood free, unscathed, and blameless.",
   "02.027.03": "These Ādityas are deep and far-extending, With many eyes, deceived not, but deceiving. They look within, and see the straight and crooked. Nigh to the kings is all, even what is farthest.",
   "02.027.04": "The Ādityas support what's fixed and moving; These gods are guardians of the whole creation: Far-sighted, cherishing their spirit-power, Observing holy law and guilt chastising.",
   "02.027.05": "May I, O Ādityas, meet with your favour, Which even in danger, Aryaman, brings comfort. Guided by you, O Varuṇa and Mitra, May I avoid all troublous times, like pitfalls.",
   "02.027.06": "Smooth is your path, O Aryaman and Mitra; It is straightforward, Varuṇa, and thornless. On that, O Ādityas, speak in our favour; Bestow on us invincible protection.",
   "02.027.07": "May Aryaman, may Aditi, kings' mother, By easy paths through enmities transport us. We would unscathed, possessed of many heroes, Win Varuṇa's and Mitra's high protection.",
   "02.027.08": "Three earths, three heavens, too, these gods supported, Three are their services within our synod. By Law is mighty, Ādityas, your greatness And fair, Aryaman, Varuṇa and Mitra.",
   "02.027.09": "Of golden aspect, radiant, bright, as sword-blades, They have upheld the three light realms of heaven. They slumber not, nor close their eyes, unfailing They rule afar to help the truthful mortal.",
   "02.027.10": "Thou art, O Varuṇa, of all the sovereign, Both of the gods, O Asura, and mortals. To us vouchsafe to see a hundred autumns: May we attain to lives prolonged and happy.",
   "02.027.11": "Neither the right nor left can I distinguish. Neither before nor yet behind, Ādityas. May I by you directed, reach with safety. Bright gods, the light by innocence or wisdom.",
   "02.027.12": "Who to the kings that lead the law pays worship, And whom thus constant blessings cause to flourish, He, affluent, rides foremost in his chariot. Bestowing gifts and in assemblies lauded.",
   "02.027.13": "He pure, unhurt by guile, with many heroes, Robust, abides by waters rich in pasture. Either from near or from afar none slay him Who lives beneath the Ādityas' direction.",
   "02.027.14": "O Aditi and Varuṇa and Mitra, Forgive us any sin we have committed. May I obtain the light, secure and spacious, O Indra; may long darkness never reach us.",
   "02.027.15": "Both worlds, combined, for him shed in abundance The rain of heaven; fortunate and thriving He goes to battle, both the mansions winning. For him the world's two halves remain propitious.",
   "02.027.16": "Your wiles, intended, holy gods, for plotters. Your nooses, Ādityas, for foes unloosened: These would I pass, as with his car a driver; May we unscathed be in your wide protection.",
   "02.027.17": "May I not ever lack a friendly patron, Nor, Varuṇa, an open-handed comrade. May I, O King, not want well-managed riches, May we speak loud, with heroes, in the synod.",
   "01.115.01": "The gods' refulgent countenance has risen, The eye of Mitra, Varuṇa and Agni. He has pervaded air, and earth, and heaven: The soul of all that moves and stands is Sūrya.",
   "01.115.02": "The Sun pursues the Dawn, the gleaming goddess. As a young man a maiden, to the region Where god-devoted men lay on the harness Of brilliant offerings for the brilliant godhead.",
   "01.115.03": "The brilliant steeds, bay coursers of the sun-god. Refulgent, dappled, meet for joyful praises, Wafting our worship, heaven's ridge have mounted, And in one day round earth and sky they travel.",
   "01.115.04": "This is the Sun's divinity, his greatness: In midst of action he withdraws the daylight. When from their stand he has withdrawn his coursers, Then straightway night for him spreads out her garment.",
   "01.115.05": "This form the Sun takes in the lap of heaven, That Varuṇa and Mitra may regard him. One glow of his appears unending, splendid; His bay steeds roll the other up, the black one.",
   "01.115.06": "To-day, O gods, do ye at Sūrya's rising Release us from distress and from dishonour: This boon may Varuṇa and Mitra grant us. And Aditi and Sindhu, Earth and Heaven.",
   "01.050.01": "Aloft his beams now bring the god Who knows all creatures that are born, That all may look upon the Sun.",
   "01.050.02": "Away like thieves the stars depart, By the dark nights accompanied, At the all-seeing Sun's approach.",
   "01.050.03": "His beams, his rays, have shone afar Athwart the many homes of men, Flaming aloft like blazing fires.",
   "01.050.04": "Swift-moving, visible to all, Maker of light thou art, O Sun, Illuming all the shining space.",
   "01.050.05": "Thou risest toward the host of gods And toward the race of men: toward all. That they may see the heavenly light.",
   "01.050.07": "The broad air traversing, the sky, Thou metest, Sun, the days with nights, Seeing all creatures that are born.",
   "01.050.08": "The seven bay mares that draw thy car, Bring thee to us, far-seeing god, O Sūrya of the gleaming hair.",
   "01.050.09": "The Sun has yoked the seven bright mares, The shining daughters of his car: With that self-yoking team he speeds.",
   "01.050.10": "Athwart the darkness gazing up, To him the higher light, we now Have soared to Sūrya, the god Among the gods, the highest light.",
   "01.042.01": "O Pūṣan pass along the roads, Free us, son of release, from care. Guide us, going before, O god.",
   "01.042.02": "The wicked, ill-intentioned wolf, Pūṣan, that lies in wait for us. Him from our path smite thou away.",
   "01.042.03": "The robber lurking round our path, Who there against us mischief plots. Far from the track drive him away.",
   "01.042.04": "Tread under foot the burning brand Of crafty and malignant men, The miscreants whoe'er they be.",
   "01.042.05": "Pūṣan, that help of thine we claim, O wonder-working, sapient god, Wherewith our fathers thou didst aid.",
   "01.042.06": "Thou, lord of all prosperity, Best wielder of the golden axe. Make easy wealth for us to gain.",
   "01.042.07": "Past our pursuers lead us, make Fair paths, easy for us to tread. Thus, Pūṣan, show in us thy might.",
   "01.042.08": "Lead us to pastures rich in grass, Send on the road no early heat. Thus, Pūṣan, show in us thy might.",
   "01.042.10": "We wrangle not with Pūṣan, him We call upon with songs of praise: For wealth we seek the wondrous god.",
   "06.071.01": "God Savitar, the dexterous, has stretched aloft His arms, that he may stimulate all things to life. Young, vigorous, most skilled, with fatness he His hands besprinkles in the wide expanse of air.",
   "06.071.02": "May we possess god Savitar's most excellent Impulsion, and enjoy his lavish gifts of wealth. Thou art the god who sends to rest and wakes in turn To life the whole two-footed and four-footed world.",
   "06.071.03": "With guards that never fail, auspicious, Savitar, Protect our habitation all around to-day. God of the golden tongue, for welfare ever new Preserve us: let no plotter hold us in his grasp.",
   "06.071.05": "Like one who rouses, Savitar has stretched out His golden arms that are so fair of aspect. The heights of heaven and earth he has ascended, And made each flying monster cease from troubling.",
   "06.071.06": "To-day wealth, Savitar, and wealth to-morrow. Bring wealth to us each day by thine impulsion; For over ample wealth, O god, thou rulest: Through this our hymn may we of wealth be sharers.",
   "01.154.01": "I will proclaim the mighty deeds of Viṣṇu, Of him who measured out the earthly spaces; Who, firmly propping up the higher station, Strode out in triple regions, widely pacing.",
   "01.154.02": "Because of this his mighty deed is Viṣṇu Lauded, like some fierce beast that is much dreaded, That wanders as it lists, that haunts the mountains: He in whose three wide strides abide all creatures.",
   "01.154.03": "Let my inspiring hymn go forth to Viṣṇu, The mountain-dwelling bull, the widely pacing, Him who has measured out with but three footsteps, Alone, this long and far-extended station;",
   "01.154.04": "Him whose three footsteps filled with mead, un-failing. Revel in blissful joy; who has supported Alone the universe in three divisions: The earth and sky and all created beings.",
   "01.154.05": "I would attain to that his dear dominion Where men devoted to the gods do revel. In the wide-striding Viṣṇu's highest footstep There is a spring of mead: such is our kinship.",
   "01.154.06": "We long to go to those your dwelling-places Where are the kine with many horns, the nimble: For thence, indeed, the highest step of Viṣṇu, Wide-pacing-bull, shines brightly down upon us.",
   "01.092.04": "She throws gay garments round her like a dancing girl; E'en as a cow her udder, she displays her breast. Creating light for all the world, Dawn has unbarred The gates of darkness as when cows break from their stall.",
   "01.092.05": "Her radiant shimmer has appeared before us; It spreads, and drives away the swarthy monster. As one anoints the post at sacrifices The daughter of the sky extends her lustre.",
   "01.092.06": "We have crossed to the farther shore of darkness: Dawn shining forth, her webs of light is weaving. She smiles for glory, radiant, like a lover. To show good will she, fair of face, has wakened.",
   "01.092.07": "The radiant leader of rich gifts, the daughter Of Heaven by the Gotamas is lauded. Mete out to us, O Dawn, largesses: offspring, Brave men, conspicuous wealth in cows and horses.",
   "01.092.08": "May I attain that wealth renowned and ample, With many heroes, troops of friends, and horses, O Dawn, that shinest forth with wondrous glory. Urged on by mighty strength, auspicious lady.",
   "01.092.09": "Looking on all created things, the goddess Shines far and wide, facing the eye of Sūrya. Awaking every living soul to motion, She has aroused the voice of every thinker.",
   "01.092.10": "Born newly again and again though ancient, Herself adorning with the selfsame colour, The goddess wears away the life of mortals, Like stakes diminished by a skilful gambler.",
   "01.092.11": "The ends of heaven disclosing, she awakens; To distance far she banishes her sister. Diminishing the years of life, the maiden Flushes afar with the light of her lover.",
   "01.092.12": "Gracious and bright, spreading her rays like cattle, As a river its flood, afar she glimmers. Infringing not the gods' unchanging statutes, She flushes radiant with the beams of Sūrya.",
   "01.092.13": "O Dawn, bring us that brilliant wealth, O thou that bearest rich rewards, Whereby both sons and grandsons we may well maintain.",
   "01.092.14": "Refulgent Dawn, to-day and here, Thou that art rich in kine and steeds, Shine forth on us abundant wealth, goddess benign.",
   "01.092.15": "Yoke, Dawn, to-day thy ruddy steeds, O thou that bearest rich rewards: Then on thy car to us all fortune's gifts convey.",
   "01.113.01": "This light has come, of all the lights the fairest: The brilliant brightness has been born effulgent. Urged onward for god Savitar's uprising, Night now has yielded up her place to morning.",
   "01.113.02": "Bringing a radiant calf she comes resplendent: To her the Black one has given up her mansions. Akin, immortal, following each the other, Morning and Night fare on, exchanging colours.",
   "01.113.03": "The sisters' pathway is the same, unending: Taught by the gods alternately they tread it. Fair-shaped, of form diverse, yet single-minded, Morning and Night clash not, nor do they tarry.",
   "01.113.04": "Bright leader of glad sounds she shines effulgent: Widely she has unclosed for us her portals. Pervading all the world she shows us riches: Dawn has awakened every living creature.",
   "01.113.05": "Men lying on the ground she wakes to action: Some rise to seek enjoyment of great riches, Some, seeing little, to behold the distant: Dawn has awakened every living creature.",
   "01.113.06": "One for dominion, and for fame another; Another is aroused for winning greatness; Another seeks the goal of varied nurture: Dawn has awakened every living creature.",
   "01.113.07": "Daughter of Heaven, she has appeared before us, A maiden shining in resplendent raiment. Thou sovereign lady of all earthly treasure, Auspicious Dawn, shine here to-day upon us.",
   "01.113.08": "The path of those that have gone by she follows, The first of endless dawns to come hereafter. The living at her rising she arouses; The dead she never wakens from their slumber.",
   "01.113.09": "O Dawn, since thou hast made them kindle Agni, Since thou hast shone forth with the light of Sūrya, Since thou the sacrificer hast awakened: Thou hast performed among the gods good service.",
   "01.113.10": "How distant is the time when she comes midway Between the past and those to shine in future? The earlier dawns right willingly she follows. Expected, she fulfils the later's wishes.",
   "01.113.11": "Gone are those mortals who in former ages Beheld the flushing of the early morning; We living men now look upon her shining: Those will be born who shall hereafter see her.",
   "01.113.12": "Dispelling foes, observer of world order, Born in due season, giver of enjoyment, Wafting oblations, bringing wealth and fortune, Shine brightly here to-day, O Dawn, upon us.",
   "01.113.13": "The goddess Dawn has flushed in former ages, And here to-day the bounteous maiden flushes: So also may she flush in days hereafter. With powers her own she fares, immortal, ageless.",
   "01.113.14": "In the sky's framework she has gleamed with brightness; The goddess has cast off the robe of darkness. Rousing the world from sleep, with ruddy horses. Dawn in her well-yoked chariot is arriving.",
   "01.113.15": "She brings upon it many bounteous blessings; Brightly she shines and spreads her brilliant lustre. Last of innumerable morns departed. First of bright morns to come, has Dawn arisen.",
   "01.113.16": "Arise! The vital breath again has reached us: Darkness has gone away and light is coming. She leaves a pathway for the sun to travel: We have arrived where men prolong existence.",
   "01.113.17": "The singer lauding the refulgent mornings, Like charioteer with reins, sends forth his message: To-day this grant thy praiser, bounteous goddess: Life rich in offspring shine-thou down upon us.",
   "01.113.18": "The dawns that shine forth for the pious mortal, Bestowing kine and steeds and many heroes: May these be gained by zealous Soma-pressers, When joyous songs break forth like gusty breezes.",
   "01.113.19": "Mother of gods and Aditi's effulgence, Banner of sacrifice, shine forth exalted. Shine forth and look upon our prayer with favour: Bounteous, cause fruitfulness among the people.",
   "01.113.20": "What brilliant wealth the dawns convey, auspicious, To bless the zealous offerer of worship, All that may Varuṇa and Mitra grant us, And Aditi and Sindhu, Earth and Heaven.",
   "10.127.01": "When night comes on, the goddess shines In many places with her eyes: All glorious she has decked herself.",
   "10.127.02": "Immortal goddess far and wide, She fills the valleys and the heights: Darkness she drives away with light.",
   "10.127.03": "The goddess now, as she comes on, Is turning out her sister, Dawn: Far off the darkness hastes away.",
   "10.127.04": "So, goddess, come to-day to us: At thy approach we seek our homes. As birds their nests upon the tree.",
   "10.127.05": "The villagers have gone to rest And footed beasts and wingèd birds; The hungry hawk himself is still.",
   "10.127.06": "Ward off from us she-wolf and wolf, Ward off the robber, goddess Night: So take us safe across the gloom.",
   "10.127.07": "The darkness, thickly painting black, Has, palpable, come nigh to me: Like debts, O Dawn, clear it away.",
   "10.127.08": "I have brought up a hymn, like kine, For thee, as one who wins a fight: This, Heaven's daughter, Night, accept.",
   "08.071.01": "Night hastens far away from Dawn, her sister; The Black one yields the ruddy god a pathway. We call on you two rich in kine and horses: By day and night ward off from us the arrow.",
   "08.071.02": "Come to the pious mortal bringing bounty, O Aśvins, hither with your chariot speeding. Do ye ward off from us disease and weakness. By day and night, lovers of sweetness, guard us.",
   "08.071.03": "May your propitious coursers whirl your chariot Toward us at the dawn now flushing on us. Bring it, by traces drawn and fraught with riches, Hither with horses yoked by Order, Aśvins.",
   "08.071.04": "That car, three-seated, lords of men, that bears you With riches laden well, drives forth at daybreak: On it, O Nāsatyas, to us come onward, That, with all nurture fraught, it may approach us.",
   "08.071.05": "Once from old age ye two released Chyavāna; With a swift courser ye presented Pedu; Ye rescued Atri from distress and darkness; The fettered Jāhusha ye placed in freedom.",
   "08.071.06": "To you this thought, this song is offered, Aśvins, This hymn of praise enjoy, ye mighty heroes. From us these prayers have gone, to you directed. Ye gods protect us evermore with blessings.",
   "01.032.01": "I will proclaim the manly deeds of Indra, The first that he performed, the lightning-wielder. He slew the serpent, then discharged the waters, And cleft the caverns of the lofty mountains.",
   "01.032.02": "He slew the serpent lying on the mountain: For him the whizzing bolt has Tvaṣṭar fashioned. Like lowing cows, with rapid current flowing, The waters to the ocean down have glided.",
   "01.032.03": "Impetuous like a bull he chose the Soma, And drank in threefold vessels of its juices. The bounteous god grasped lightning for his missile; He struck down dead that first-born of the serpents.",
   "01.032.04": "When thou hadst slain the first-born of the serpents, And thwarted all the wiles of crafty schemers, Anon disclosing sun, and dawn, and heaven, Thou truly foundest not a foe, O Indra.",
   "01.032.05": "Indra slew Vṛtra and one worse than Vṛtra, Vyaṃsa, with lightning, his resistless weapon: Like trunks of trees, with axes hewn in pieces, The serpent clinging to the earth lay prostrate.",
   "01.032.06": "He like a drunken coward challenged Indra, The headlong, many-crushing, mighty hero. He parried not the onset of the weapons: The foe of Indra, falling, crushed the channels.",
   "01.032.07": "Footless and handless he with Indra battled, Who smote him then upon his back with lightning. But, impotent, he strove to match the hero: He lay with scattered limbs in many places.",
   "01.032.08": "As thus he lay, like broken reed, the waters, Now courage taking, surge across his body. He lies beneath the very feet of rivers Which Vṛtra with his might had close encompassed.",
   "01.032.09": "The strength began to fail of Vṛtra's mother, For Indra had cast down his bolt upon her. Above the mother was, the son was under; And like a cow beside her calf lies Dānu.",
   "01.032.10": "The waters deep have hidden Vṛtra's body, Plunged in the midst of never-ceasing torrents That stand not still, but ever hasten onward: Indra's fierce foe sank down to lasting darkness.",
   "01.032.11": "Enclosed by demons, guarded by a serpent, The waters stood like cows by Paṇi captured. The waters' orifice that was obstructed. When Vṛtra he had smitten, Indra opened.",
   "01.032.12": "A horse's tail thou didst become, O Indra, When, on his spear impaled, as god unaided, The cows, O hero, thou didst win and Soma, And free the seven streams to flow in torrents.",
   "01.032.13": "Him lightning then availèd not nor thunder, Nor mist, nor hailstorm which around he scattered: When Indra and the serpent fought in battle, The bounteous god gained victory for ever.",
   "01.032.14": "Whom saw'st thou as avenger of the serpent, As terror seized thy heart when thou hadst slain him, And thou didst cross the nine and ninety rivers And air's broad spaces, like a hawk affrighted?",
   "01.032.15": "Indra is king of all that's fixed and moving, Of tame and horned beasts, the thunder-wielder. He truly rules, as king of busy mortals; Them he encompasses as spokes the felly.",
   "02.012.01": "He who just born as chief god full of spirit Went far beyond the other gods in wisdom: Before whose majesty and mighty manhood The two worlds trembled: he, O men, is Indra.",
   "02.012.02": "Who made the widespread earth when quaking steadfast, Who set at rest the agitated mountains, Who measured out air's middle space more widely, Who gave the sky support: he, men, is Indra.",
   "02.012.03": "Who slew the serpent, freed the seven rivers, Who drove the cattle out from Vala's cavern. Who fire between two rocks has generated, A conqueror in fights: he, men, is Indra.",
   "02.012.04": "He who has made all earthly things unstable, Who humbled and dispersed the Dāsa colour, Who, as the player's stake the winning gambler, The foeman's fortune gains: he, men, is Indra.",
   "02.012.05": "Of whom, the terrible, they ask, \"Where is he?\" Of him, indeed, they also say, \"He is not.\" The foemen's wealth, like players' stakes, he lessens. Believe in him: for he, O men, is Indra.",
   "02.012.06": "He furthers worshippers, both rich and needy, And priests that supplicate his aid and praise him. Who, fair-lipped, helps the man that presses Soma, That sets the stones at work: he, men, is Indra.",
   "02.012.07": "In whose control are horses and all chariots, In whose control are villages and cattle; He who has generated sun and morning, Who leads the waters: he, O men, is Indra.",
   "02.012.08": "Whom two contending armies vie in calling, On both sides foes, the farther and the nearer; Two fighters mounted on the self-same chariot Invoke him variously: he, men, is Indra.",
   "02.012.09": "Without whose aid men conquer not in battle, Whom fighting ever they invoke for succour, Who shows himself a match for every foeman, Who moves what is unmoved: he, men, is Indra.",
   "02.012.10": "Who with his arrow slays the unexpecting Unnumbered crew of gravely guilty sinners; Who yields not to the boasting foe in boldness, Who slays the demons: he, O men, is Indra.",
   "02.012.11": "He who detected in the fortieth autumn Śambara dwelling far among the mountains; Who slew the serpent that put forth his vigour. The demon as he lay: he, men, is Indra.",
   "02.012.12": "Who with his seven rays, the bull, the mighty, Let loose the seven streams to flow in torrents; Who, bolt in arm, spurned Rauhiṇa, the demon, On scaling heaven bent: he, men, is Indra.",
   "02.012.13": "Both Heaven and Earth, themselves, bow down before him: Before his might the very mountains tremble, Who, famed as Soma-drinker, armed with lightning, Is wielder of the bolt: he, men, is Indra.",
   "02.012.14": "Who with his aid helps him that presses Soma, That bakes and lauds and ever sacrifices; Whom swelling prayer, whom Soma pressings strengthen, And now this offering: he, O men, is Indra.",
   "02.012.15": "Who, fierce, on him that bakes and him that presses Bestowest booty: thou, indeed, art trusted. May we, for ever dear to thee, O Indra, Endowed with hero sons address the synod.",
   "07.083.01": "Looking to you, O heroes, and your friendly aid, They with broad sabres armed and battle-eager marched; Then ye two smote the Dāsa and the Aryan foes: Ye favoured, Indra-Varuṇa, Sudās with help.",
   "07.083.02": "Where men with banners raised in fight together rush, In battle conflict where there is no pleasant thing, Where creatures fear the god who sees the heavenly light, O Indra-Varuṇa, be there our advocates.",
   "07.083.03": "Earth's ends appear enwrapt in dust, O Varuṇa And Indra; now the din has mounted to the sky; The onset of the warriors rolls close up to me: Come hither with your aid, O ye that hear my call.",
   "07.083.04": "O Varuṇa and Indra, Bheda ye attacked With weapons irresistibly, and helped Sudās. Ye heard his fighters' prayers when they called to you: Then was the Tṛtsus' priestly service justified.",
   "07.083.05": "My foes' malignities, O Indra-Varuṇa, My enemies' assaults press me on every side. Since ye control the property of friend and foe, Do ye then favour us on war's decisive day.",
   "07.083.06": "Both sides in battle-conflicts call upon you two, O Indra-Varuṇa, intent on gaining wealth, Where once ye helped Sudās with all his Tṛtsu host, When by the ten kings' hostile force hard pressed in fight.",
   "07.083.07": "Ten kings allied, who worshipped not, did not prevail Against Sudās in war, O Indra-Varuna; The lauds of heroes sitting at the feast came true: The gods were at their invocations on their side.",
   "07.083.08": "Ye gave Sudās hemmed in on every side your aid, When ten kings fought against him, Indra-Varuṇa, Where filled with thought the Tṛtsus, wearing braided hair And clad in white, with homage and devotion prayed.",
   "07.083.09": "The one in battle-conflicts slays the demon foes, The other evermore his sacred statutes guards. We call on you with well-turned hymns, O mighty ones: To us, O Indra-Varuṇa, protection grant.",
   "07.083.10": "May Indra, Mitra, Varuṇa and Aryaman, To us fair fame and great, far-reaching shelter grant. We think of the unfailing light of Aditi, Who loves the law, and of the call of Savitar.",
   "05.083.01": "Invoke the mighty god with songs of welcome; Parjanya praise: with homage seek to win him. He, roaring like a bull, with streams that quicken, A seed to germinate in plants deposits.",
   "05.083.02": "The trees he shatters and he smites the demon host: The whole world trembles at his mighty weapon's stroke, The guiltless man himself flees from the potent god, When miscreants Parjanya with his thunder strikes.",
   "05.083.03": "Like charioteer his horses lashing with a whip, The god makes manifest his messengers of rain. From far away the roaring of the lion sounds, What time Parjanya veils the firmament with rain.",
   "05.083.04": "The winds blow forth; to earth the quivering lightnings fall, The plants shoot up; with moisture streams the realm of light. For all the world abundant nourishment is born, When by Parjanya Earth is fertilized with seed.",
   "05.083.05": "O thou at whose behest the earth bows downward, O thou at whose behest hoofed creatures quiver, At whose behest by plants all shapes are taken: As such, Parjanya, grant to us strong shelter.",
   "05.083.06": "The rain of heaven bestow, O Maruts, on us, Of your strong steed pour forth the streams abundant. With this thy thundering roar do thou come hither, And shed the waters as our heavenly father.",
   "05.083.07": "With roar and thunder now the germ deposit, Fly round us with thy water-bearing chariot. Turn well thy water-skin unloosened downward, Make, with the waters, heights and hollows level.",
   "05.083.08": "Draw the great bucket up and pour it downward, And let the liberated streams flow forward. On all sides drench both heaven and earth with fatness; Let there be for the cows fair pools for drinking.",
   "05.083.09": "When, O Parjanya, roaring loud, Thou slay'st with thunder wicked men, This universe rejoices then, And everything that is on earth.",
   "05.083.10": "Thou hast shed rain; pray now withhold it wholly; Thou hast made passable all desert places. To serve as food thou hast made plants to flourish: And hast received the gratitude of creatures.",
   "02.033.01": "Let thy goodwill, O father of the Maruts, Light on us: part us not from Sūrya's vision. In mercy may the hero spare our horses: May we, O Rudra, have abundant offspring.",
   "02.033.02": "By thy most wholesome remedies, O Rudra, Thy gifts, I would attain a hundred autumns. Drive far away from us distress and hatred, Drive far away, wide-scattered, all diseases.",
   "02.033.03": "Of what is born thou art the chief in glory, Armed with the thunder, mightiest of the mighty. Transport us to the farther shore of trouble In safety; frustrate all attacks of mischief.",
   "02.033.04": "May we not anger thee with homage, Rudra, Nor with ill-praises, nor joint invocation. Raise up, O Bull, with remedies our heroes: I hear of thee as best of all physicians.",
   "02.033.05": "With invocations and oblations summoned Rudra I would appease with my laudations: May he, soft-hearted, easily appealed to, Brown-hued, fair-lipped, not to his wrath subject us.",
   "02.033.06": "The bull, escorted by the Maruts, gladdens Me who invokes, with his most forceful vigour. I, sound, would reach, as in the heat, a shelter: Rudra's good will I would desire to capture.",
   "02.033.07": "Where is that gracious hand of thine, O Rudra, That is so full of remedies and coolness? As the remover of all god-sent damage, Do thou, O Bull, now show compassion towards me.",
   "02.033.08": "Forth for the brown and whitish bull I utter A mighty panegyric of the mighty. I will adore the radiant god with homage. We praise the terrifying name of Rudra.",
   "02.033.09": "He, mighty, brown-hued, multiform, has decked out His stalwart limbs with jewels bright and golden, From Rudra, this great universe's ruler, Let not be severed his divine dominion.",
   "02.033.10": "Worthy, thou carriest thy bow and arrows, Worthy, thine honourèd and all-hued necklace Worthy, thou wieldest all this mighty power. Naught that exists is mightier than thou art.",
   "02.033.11": "Praise him the famed, who sits upon the car-seat The young, the fierce, like a dread beast, a slayer. When praised, be gracious, Rudra, to the singer Let thy darts pass us and lay low another.",
   "02.033.12": "I bow down like a son before his father, Who with good will comes nigh to him, O Rudra. I praise the true lord, of much wealth the giver: To us thou grantest remedies when lauded.",
   "02.033.13": "Those remedies of yours, the pure, O Maruts, That are most wholesome, mighty ones, and potent, That Manu chose in ancient days, our Father: Those I desire, and Rudra's balm and blessing.",
   "02.033.14": "May Rudra's missile turn aside and pass us, May the fierce Rudra's great ill-will go by us. Relax thy rigid bow to save our patrons; Spare, O thou god of bounty, child and grandchild.",
   "02.033.15": "So brown-hued, mighty Rudra, widely famous, Here to our invocations be attentive, As not, O god, to rise in wrath and slay us. May we speak loud with heroes in the synod.",
   "08.007.01": "When, Maruts, now for you the sage Pours out the threefold Soma draught, Ye shine forth on the mountain heights.",
   "08.007.02": "Whenever, bright ones, growing strong, You have decided on your course, The mountains bend and bow themselves.",
   "08.007.03": "Loud roaring with the winds, the sons Of Pṛśni raise themselves aloft: They have milked out the swelling draught.",
   "08.007.04": "The Maruts scatter mist abroad, They make the mountain ridges quake, When with the winds they go their way.",
   "08.007.05": "When mountains bow before your march, And rivers, too, before your rule, Before your mighty, roaring blast:",
   "08.007.06": "On you we call by night for aid On you we call aloud by day, On you while sacrifice proceeds.",
   "08.007.07": "They rise, of ruddy hue and bright, Upon their courses with a roar, Across the ridges of the sky.",
   "08.007.08": "With power they shoot a ray of light So that the sun may run his course; They with their beams spread far and wide.",
   "08.007.09": "Accept, O Maruts, this my song, Ṛbhukṣans, this my hymn of praise, Accept ye now this call of mine.",
   "08.007.10": "The dappled cows have milked three lakes, Mead for the wielder of the bolt, Out of the spring, the water-cask.",
   "08.007.11": "O Maruts, pray come here to us, Whenever, seeking your good will, We call you hither from the sky.",
   "08.007.12": "For, Rudras and Ṛbhukṣans, ye, O bounteous ones, are in our house And wise when ye enjoy the draught.",
   "08.007.13": "From heaven, Maruts, bring to us Abundant wealth distilling joy, With plenteous food all-nourishing.",
   "08.007.14": "When you, as if from mountain tops, Have, bright ones, willed to take your way, You in the drops distilled rejoice.",
   "08.007.15": "The mortal with his prayers should ask The favour and goodwill of that Great host of theirs invincible.",
   "08.007.16": "They who, like sparks, with showers of rain, Blow onward through both heaven and earth, And milk the spring that never fails:",
   "08.007.17": "The sons of Pṛśni rise aloft, With chariots and with rattling sounds, With rushing winds and songs of praise.",
   "08.007.18": "For riches, let us surely win Your help that aided Turvaśa, Yadu, Kaṇva, who gained great wealth.",
   "08.007.19": "Like butter swelling, may these draughts, Accompanied by Kāṇva's hymns. Increase your strength, ye bounteous ones.",
   "08.007.20": "Where, bounteous Maruts, do ye now Rejoice, for whom the straw is spread, What Brahman priest is serving you?",
   "08.007.21": "For ye, for whom the straw is spread. Do not, as once ye did for praise, Rejoice our sacrificers' ranks.",
   "08.007.22": "Together they have brought both worlds, The mighty waters, and the sun, And, joint by joint, the thunderbolt.",
   "08.007.23": "They joint by joint have Vṛtra rent, And rent the gloomy mountain clouds, Performing an heroic feat.",
   "08.007.24": "They reinforced the mighty strength And skill of Trita as he fought, And Indra in the Vṛtra-fray.",
   "08.007.25": "Celestial, lightnings in their hands, They wear gold helmets on their heads; For glory, bright, they deck themselves.",
   "08.007.26": "When eagerly from far ye came Nigh to the cavern of the bull, With fear, like Heaven, he roared aloud.",
   "08.007.27": "Brought by your golden-footed steeds Come hither, O ye gods, to us, To take from us our sacrifice.",
   "08.007.28": "When the red leader in their car The spotted deer directs, the bright Gods go: may they the waters free.",
   "08.007.30": "When will ye with your favours come, O Maruts, hither to the sage. The suppliant who calls you thus?",
   "08.007.31": "How is it now? Who are your friends, Since ye left Indra in the lurch? Who in your friendship counts to-day?",
   "08.007.32": "I praise, O Kaṇvas, Agni with The Maruts holding in their hands The bolt and wearing swords of gold.",
   "08.007.33": "I would draw sure for welfare new The mighty gods adorable All hither with their splendid spoil.",
   "08.007.34": "The very hills before them sink, Deeming themselves but side-ravines; The very mountains bow down low.",
   "08.007.35": "Their steeds that have a transverse course, Convey them flying through the air, To him that lauds them giving strength.",
   "08.007.36": "The ancient Agni has been born With brilliance like the shining sun; They with their beams spread far and wide.",
   "10.168.01": "Of Vāta's car I now will praise the greatness: Rending it speeds along; its noise is thunder. Touching the sky it flies, creating lightnings; Scattering dust it traverses earth's ridges.",
   "10.168.02": "The hosts of Vāta onward speed together: They haste to him as women to a concourse. The god with them upon the same car mounted, The king of all this universe speeds onward.",
   "10.168.03": "In air, along his pathways speeding onward, Never on any day he tarries resting. The first-born order-loving friend of waters: Where was he born, and whence has he arisen?",
   "10.168.04": "Of gods the breath, and of the world the offspring, This god according to his liking wanders. His sound is heard, his form is never looked on: That Vāta let us worship with oblation.",
   "07.049.01": "With ocean for their chief they flow unresting; From the aerial flood they hasten cleansing; For whom the mighty Indra's bolt cut channels, Here may those waters, goddesses, preserve me.",
   "07.049.02": "Waters that come from heaven or run in channels Dug out, or flow spontaneously by nature, That, clear and pure, have as their goal the ocean: Here may those waters, goddesses, preserve me.",
   "07.049.03": "In midst of whom king Varuṇa is moving, And looking down surveys men's truth and falsehood: Who, clear and purifying, drip with sweetness: Here may those waters, goddesses, preserve me.",
   "07.049.04": "In whom king Varuṇa, in whom, too, Soma, In whom the All-gods drink exalted vigour; Into whom Agni, friend of all, has entered: Here may those waters, goddesses, preserve me.",
   "02.035.01": "Desiring gain this eloquence I utter: May the streams' son accept my songs with gladness. Will he, the Son of Waters, of swift impulse, Perchance reward them well? He will enjoy them.",
   "02.035.02": "Now from our hearts we would this hymn well-fashioned Address to him: perchance he will regard it. The noble Son of Waters, by the greatness Of rule divine, all creatures has created.",
   "02.035.03": "Some flow together, some approach the ocean; The rivers thus fill up the common cistern. And him the pure, the shining Son of Waters, The waters pure on all sides have surrounded.",
   "02.035.04": "The waters, youthful maidens, never smiling, Making him bright, encompass him the youthful. He with clear flames, free-handedly upon us, Unfed with wood, shines decked with ghee in waters.",
   "02.035.05": "Three dames divine to him the god, the dauntless, Wish eagerly to offer food for nurture. He seems to seek their breasts within the waters: He drinks the milk of them that first are mothers.",
   "02.035.06": "The birthplace of this steed is earth and heaven. Our patrons do thou guard from harm and malice. Him not to be forgotten, far off dwelling In cloud-built forts, foes shall not reach nor false-hoods.",
   "02.035.07": "He in whose house is a productive milch-cow Increasing vital force, fares on good nurture. The Waters' Son, expanding in the waters. Shines forth upon the pious, granting riches.",
   "02.035.08": "Who in the waters, with celestial brightness, Shines widely forth, eternal, law-abiding. Of him as branches every plant and creature Do propagate themselves with all their offspring.",
   "02.035.09": "Their son has mounted the lap of the prostrate, Standing erect and clothed around with lightning. And bearing on with them his highest greatness, The swift streams, golden-coloured, flow around him.",
   "02.035.10": "He is of golden form, of golden aspect, This Son of Waters is of golden colour. And him who from a golden birthplace issues, Those that give gold present with food when seated.",
   "02.035.11": "That countenance of him, that name belovèd Of him, the Waters' Son, increase in secret. Whom thus the maidens all together kindle, Of him, the golden-hued, the food is butter.",
   "02.035.12": "Then him the nearest friend of many mortals We serve with sacrifices, gifts, obeisance. I make his back to shine, with shavings feed him; I nourish him with food, with stanzas laud him.",
   "02.035.13": "He, as a bull, in them that germ engendered; He, as their infant, sucks their breasts; they kiss him. He, Son of Waters, of unfading colour, Here works as with the body of another:",
   "02.035.14": "While he is dwelling in this highest station, For ever shining with undimmed effulgence, The waters bringing ghee to feed their offspring, Themselves, the swift ones, with their robes fly round him.",
   "02.035.15": "I have bestowed safe dwelling on our people, A well-wrought hymn, too, Agni, on our patrons: All that is favoured by the gods is blessèd. May we speak loud, with heroes, in the synod.",
   "05.084.01": "Thou bearest truly, Pṛthivī, The burden of the mountains' weight; With might, O thou of many streams, Thou quickenest, potent one, the soil.",
   "05.084.02": "With flowers of speech our songs of praise Resound to thee, far-spreading one, Who sendest forth the swelling cloud, O bright one, like propelling speed;",
   "05.084.03": "Who, steadfast, holdest with thy might, The forest-trees upon the ground, When, from the lightning of thy cloud, The rain-floods of the sky pour down.",
   "01.185.01": "Which of the two is earlier, which the later? How were they born, ye sages, who discerns it? They by themselves support all things existing. As with a wheel the day and night roll onward.",
   "01.185.02": "The two support, though moving not and footless, Abundant offspring having feet and moving. O Heaven and Earth, from dreadful darkness save us, Like your own son held in his parents' bosom.",
   "01.185.03": "I crave of Aditi the gift, the matchless. Beneficent, illustrious, and honoured: O ye two worlds, procure that for the singer. O Heaven and Earth, from dreadful darkness save us.",
   "01.185.04": "May we be near to both the worlds who suffer No care, parents of gods, who aid with favour. Both are divine, with days and nights alternate. O Heaven and Earth from dreadful darkness save us.",
   "01.185.05": "Maidens uniting, with adjoining limits, Twin sisters, resting in their parents' bosom, They kiss, combined, the universe's centre. O Heaven and Earth, from dreadful darkness save us.",
   "01.185.06": "Devoutly I the two seats wide and lofty, The parents of the gods, invoke with fervour, Who, fair of aspect, grant us life immortal. Heaven and Earth, from dreadful darkness save us.",
   "01.185.07": "Them wide and broad and great, whose bounds are distant, Who, beautiful and fain to help, grant blessings: I at this sacrifice invoke with homage. O Heaven and Earth, from dreadful darkness save us.",
   "01.185.08": "If ever we have any sin committed Against the gods, or friend, or house's chieftain. Of that may this our hymn be expiation. O Heaven and Earth, from dreadful darkness save us.",
   "01.185.09": "May both, as objects of men's praises, bless me; May both attend me with their help and favour. Give much to men more liberal than the godless. We would be strong, ye gods, enjoying nurture.",
   "01.185.10": "This truth have I now uttered first with wisdom To Heaven and Earth that every one may hear it. Protect me from disgrace and peril; guard me As Father and as Mother with your succour.",
   "01.185.11": "May this my prayer come true, O Earth and Heaven, With which I here address you, Father, Mother. Be nearest of the gods to us with favours: May we find food and home with flowing water.",
   "01.001.01": "Agni I praise, the household priest, God, minister of sacrifice, Invoker, best bestowing wealth.",
   "01.001.02": "Agni is worthy to be praised, By present as by seers of old: May he to us conduct the gods.",
   "01.001.03": "Through Agni may we riches gain, And day by day prosperity Replete with fame and manly sons.",
   "01.001.04": "The worship and the sacrifice, Guarded by thee on every side, Go straight, O Agni, to the gods.",
   "01.001.05": "May Agni, the invoker, wise And true, of most resplendent fame, The god, come hither with the gods.",
   "01.001.06": "Whatever good thou wilt bestow, O Agni, on the pious man, That gift comes true, O Angiras.",
   "01.001.07": "To thee, O Agni, day by day, O thou illuminer of gloom, With thought we, bearing homage, come:",
   "01.001.08": "To thee the lord of sacrifice, The radiant guardian of the Law, That growest in thine own abode.",
   "01.001.09": "So, like a father to his son, Be easy of approach to us; Agni, for weal abide with us.",
   "01.143.01": "A mightier, newer hymn to Agni I present; My words and song to him, the son of strength, I bring. Who, offspring of the waters, with bright gods sat down. As regular and dear invoker, on the earth.",
   "01.143.02": "As soon as he was in the highest heaven born, To Mātariśvan Agni manifest became; As he was kindled, by his might and majesty His brilliant light illuminated Heaven and Earth.",
   "01.143.03": "His flames that grow not old, the beams of Agni's fire, Whose aspect, countenance, and sheen are beautiful. With mighty radiance undulate and shine afar, Like glistening rivers' flow: they slumber not nor age.",
   "01.143.04": "The god, all-knowing Agni, whom the Bhṛgus brought With might to earth's navel, the centre of the world. Him stimulate with songs within his own abode, Who rules, sole sovereign, over wealth, like Varuṇa.",
   "01.143.05": "Who like the Maruts' roar, or like a dart discharged, Or like the heavenly bolt can never be restrained: Agni, the god, with pointed fangs consumes and chews; He, as a warrior his foes, lays low the woods.",
   "01.143.06": "Will Agni be a glad receiver of our praise? Will he, the bright one, with bright goods grant our desire? Will he incite, inspire out thoughts to gain their ends? Him of the radiant face now with this song I laud.",
   "01.143.07": "Who kindles Agni, butter-faced, that draws aloft Your sacrifice, he strives to win him as a friend. When kindled as a shining banner at our rites, May he uplift our radiant-coloured hymn of praise.",
   "01.143.08": "Incessantly with guards unceasing, Agni, That are auspicious and strong, protect us. With guards that slumber not, unfailing, watchful, Preserve, O helper, all our children safely.",
   "06.006.01": "The man who seeks success and aid approaches The son of strength, with feast and newest worship. He rends the wood and has a blackened pathway, The brightly radiant and divine invoker.",
   "06.006.02": "The shining thunderer who dwells in lustre, With his unaging, roaring flames, most youthful, Refulgent Agni, frequently recurring, Goes after many spacious woods and chews them.",
   "06.006.03": "Thy flames when driven by the wind, O Agni, Disperse, O pure one, pure in all directions; And thy divine Navagvas, most destructive, Lay low the woods and devastate them boldly.",
   "06.006.04": "Thy steeds, the bright, the pure, O radiant Agni, Let loose speed on and shave the ground beneath them. Thy whirling flame then widely shines refulgent, The highest ridges of earth's surface reaching.",
   "06.006.05": "When the bull's tongue darts forward like the missile Discharged by him who fights the cows to capture, Like hero's onset is the flame of Agni: Resistless, dreadful, he consumes the forests.",
   "06.006.06": "Thou with the sunbeams of the great impeller, Hast boldly overspread the earthly spaces. So with thy mighty powers drive off all terrors; Attack our rivals and burn down our foemen,",
   "06.006.07": "Give us, O splendid one of splendid lordship, Wealth giving splendour, splendid, life-imparting. Bestow bright wealth and vast with many heroes, Bright god, with thy bright flames, upon the singer.",
   "04.050.01": "Bṛhaspati, in his three seats with thunder Who mightily has propped apart earth's limits. Him of the charming tongue, the ancient sages, Inspired and deeply thinking, placed before them.",
   "04.050.02": "Bṛhaspati, come from the farthest distance They, cherishing the rite, for thee are seated. For thee streams, pressed with stones, and flowing channels, Distil on all sides mead in great abundance.",
   "04.050.04": "Bṛhaspati when first he was engendered From mighty lustre in the highest heaven, Seven-mouthed and high-born, with his voice of thunder And seven rays asunder blew the darkness.",
   "04.050.05": "He with his loudly praising throng of singers Burst open the enclosing cave with thunder. Bṛhaspati then drove out, loudly roaring, The ruddy kine that sweeten the oblation.",
   "04.050.06": "Him, mighty friend of all the gods, the father, Serve we with sacrifices, gifts, obeisance. With goodly offspring and a throng of heroes Bṛhaspati, we would be lords of riches.",
   "04.050.07": "That king indeed by his heroic prowess And energy defeats all hostile forces, Who keeps Bṛhaspati well nourished, Honours and lauds him as the first partaker.",
   "04.050.08": "He truly in his house dwells well-established, To him the sacred food affords abundance, To him his subjects with free will pay homage, If from this king the priest receives precedence.",
   "04.050.09": "He unresisted ever wins the riches Of his own people and surrounding foemen. The king who to the priest desiring favour Gives liberty, receives the gods' protection.",
   "04.050.10": "Bṛhaspati and Indra, ye of mighty wealth, Drink Soma here, rejoicing at this sacrifice. May these invigorating drops now enter you: Bestow on us great wealth and sons exclusively.",
   "04.050.11": "Bṛhaspati and Indra, make us prosper, Let that benevolence of yours be with us, Arouse rewards and give our prayers fulfilment, The enmities of foes and rivals weaken.",
   "08.048.01": "I have partaken wisely of the sweet food That stirs good thoughts, best banisher of trouble, The food round which all deities and mortals, Calling it honey-mead, collect together,",
   "08.048.02": "Thou shalt be Aditi when thou hast entered Within, appeaser of celestial anger. May'st thou, O drop, enjoying Indra's friendship, Like willing mare the car, to wealth advance us.",
   "08.048.03": "We have drunk Soma and become immortal; We have attained the light the gods discovered. What can hostility now do against us? And what, immortal god, the spite of mortals?",
   "08.048.04": "Be cheering to our heart when drunk, O Indu, Kindly, like father to his son, O Soma. Like friend for friend, far-famed one, wisely Prolong our years that we may live, O Soma.",
   "08.048.05": "These glorious, freedom-giving drops, when drunk by me, Have knit my joints together as do thongs a car. May these protect me now from fracturing a limb. And may they ever keep me from disease remote.",
   "08.048.06": "Like fire produced by friction, make me brilliant; Do thou illumine us and make us richer; For then I seem in thy carouse, O Soma, Enriched. Now enter us for real welfare.",
   "08.048.07": "Of this thy juice pressed out with mind devoted, We would partake as of paternal riches. Prolong the years of life for us, King Soma, As Sūrya lengthens out the days of spring-time.",
   "08.048.08": "King Soma, gracious be to us for welfare: We are thy devotees; of that be mindful. O Indu, might and anger rise against us: Hand us not over to our foeman's mercies.",
   "08.048.09": "Thou, as the guardian of our body, Soma, Surveying men, in every limb hast settled. If we perchance infringed, O god, thy statutes, As our good friend for greater wealth be gracious.",
   "08.048.10": "I would accompany the friend, the wholesome. Who, Lord of Bays, imbibed, would never hurt me. I come to Indra to prolong our life-time, That we may relish Soma placed within us.",
   "08.048.11": "Away have fled those ailments and diseases; The powers of darkness have been all affrighted. With mighty strength in us has Soma mounted: We have arrived where men prolong existence.",
   "08.048.12": "The drop drunk deeply in our hearts, O Fathers, Us mortals that immortal god has entered. That Soma we would worship with oblation; We would be in his mercy and good graces.",
   "08.048.13": "Uniting with the Fathers thou, O Soma, Hast over Heaven and Earth thyself extended. So, Indu, we would serve thee with oblation: Thus we would be the lords of ample riches.",
   "08.048.14": "Do ye, protecting gods, speak in our favour, Let neither sleep nor idle talk subdue us; May we, for evermore, beloved of Soma, Endowed with hero sons, address the synod.",
   "08.048.15": "Thou, Soma, givest strength to us on all sides. Light-finder, watching men, within us enter. Do thou, O Indu, with thine aids accordant, Behind for ever and before protect us.",
   "10.146.01": "O forest nymph, O forest nymph, Thou seemest to have lost thy way: Why dost not for the village ask? Has fear, perchance, now entered thee ?",
   "10.146.02": "When to the owl's loud-sounding hoot The parrot makes an answering cry, And hops, as to the cymbal's clash, Then Araṇyānī heaves with joy.",
   "10.146.03": "Sounds as of cows that graze are heard, A dwelling house appears to loom, And Araṇyānī, forest nymph, Creaks like a cart at eventide.",
   "10.146.04": "Here some one calls his cow to him, Another there is felling wood: Who in the forest bides at eve Thinks to himself,\"I heard a cry.\"",
   "10.146.05": "Never does Araṇyānī hurt, Unless one goes too near to her; When she has eaten of sweet fruit. At her own will she goes to rest.",
   "10.146.06": "Sweet-scented, redolent of balm, Replete with food, though tilling not, Mother of beasts, the forest nymph, Her I have magnified with praise.",
   "10.085.18": "These two speed on with mystic power alternately; Like playful children they go round the sacrifice. One of the two surveys the whole created world; The other, seasons meting out, is born again.",
   "10.085.19": "Ever anew, being born again, he rises; He goes before the dawns as daylight's token. He, coming, to the gods their share apportions: The moon draws out the span of man's existence.",
   "10.085.26": "Let Pūṣan lead thee home, thy hand well grasping, And let the Aśvins on their chariot drive thee. Go to thy home that thou may'st be its mistress, And with authority address the synod.",
   "10.085.27": "May fortune here with offspring be thy portion, In this abode be of thine household watchful. And with thine husband here be thou united; And till old age do ye address the synod.",
   "10.085.31": "The ailments, coming from her kin, That her bright wedding throng pursue, These may the holy gods drive back, Towards the place from which they came.",
   "10.085.32": "May those who lie in wait around Their path, not find the bridal pair; May these by easy roads escape The peril; may their foes disperse.",
   "10.085.36": "I grasp thy hand that I may gain good fortune, That thou may'st reach old age with me as husband. Aryaman, Bhaga, Savitar, Puraṃdhi, The gods, give thee to me for life domestic.",
   "10.085.38": "For thee they first drove Sūryā home Together with the wedding throng: O Agni, to her spouse give back His wife, and to her offspring grant.",
   "10.085.42": "Abide ye here; be not disjoined; Complete life's full allotted span, Frolicking with sons and grandsons, Rejoicing in your own abode.",
   "10.085.44": "Free from the evil eye, thy husband hurting not, Kind to our beasts, be friendly, full of energy; Bear heroes, love the gods, and live in happiness; Bring welfare to our bipeds and our quadrupeds.",
   "10.085.47": "May all the gods unite our hearts, And may the Waters them entwine; May Mātariśvan and Dhātar, May Deṣṭri them together join.",
   "10.014.01": "Him who has past along the mighty ridges, And has spied out the path for many travellers, Vivasvant's son, the gatherer of people, Yama, the king, do thou present with offering.",
   "10.014.02": "For us has Yama first found out the pathway: This pasture never can be taken from us. To where have passed away our former fathers, The later born by their own paths have travelled.",
   "10.014.04": "Upon this sacred grass sit down, O Yama, Uniting with the Aṅgiras, our fathers. Let spells recited by the sages bring thee; Do thou, O king, rejoice in this oblation.",
   "10.014.05": "Come hither with the Aṅgiras, the holy: Here with Virūpa's sons, O Yama revel, Vivasvant I invoke, who is thy father, When at this rite upon the straw he's seated.",
   "10.014.06": "The Aṅgiras, our fathers, the Navagvas, The Bhṛgus and Atharvans, Soma-loving: May we abide for ever in the favour And the good graces of those holy sages.",
   "10.014.07": "Depart, depart, along those ancient pathways, On which have passed away our former fathers: There thou shalt see rejoicing in libations The two kings, Varuṇa the god and Yama.",
   "10.014.08": "Unite thou with the Fathers and with Yama, With thy good works' reward in highest heaven. To home return, all imperfection leaving. Unite with thine own body, full of vigour.",
   "10.014.09": "Begone, depart from here, disperse and scatter: For him the Fathers have prepared this dwelling. Yama bestows on him this place to rest in, A place by waters, days and nights distinguished.",
   "10.014.10": "Run on thy path straight forward, past the two dogs, The sons of Saramā, four-eyed and brindled. Draw near thereafter to the bounteous Fathers, Who revel on in company with Yama.",
   "10.014.11": "O King, to those two this dead man deliver, The two that are thy guardian dogs, O Yama, Four-eyed, observing men, the pathway watching. Bestow upon the dead man health and welfare.",
   "10.014.12": "Broad-nosed and brown the messengers of Yama, Greedy of lives they rove among the people. May they give back to us a life propitious Here and to-day, that we may see the sunlight.",
   "10.014.13": "For Yama press the Soma juice, To Yama offering present. To Yama goes the sacrifice, Announced by Agni, well-prepared.",
   "10.014.14": "To Yama offering rich in ghee Present forthwith, and forward step. Let him direct us to the gods, That we may live a life prolonged.",
   "10.014.15": "To Yama as a King present Oblation very honey-sweet. This homage is for seers of old. The ancient makers of the path.",
   "10.018.01": "Depart, O Death, along the farthest pathway, Which is thine own, not that by mortals trodden. I speak to thee that hast both eyes and hearing: Do not our offspring injure nor our heroes.",
   "10.018.02": "Since ye have come, the trace of death effacing, Till future days prolonging your existence: With offspring and with riches thriving greatly, Do ye, O pious men, be pure and holy.",
   "10.018.03": "These living men have from the dead been parted; Our calling of the gods is now auspicious. We have come near, prepared for dance and laughter, Till future days prolonging our existence.",
   "10.018.04": "For those that live do I set up this limit, May now no other one this goal encounter. May they exist a hundred ample autumns: By this stone may they death remove far from them.",
   "10.018.05": "As days in order follow one another, As seasons duly alternate with seasons. And as the later ne'er forsakes the earlier, So settle thou the lives of these, Ordainer.",
   "10.018.06": "Do ye attain long life, old age selecting, As many as you are combined in order. May Tvaṣṭar, well-disposed, the skilled creator, Produce forthwith long life for your existence.",
   "10.018.07": "These women here, non-widows, with good husbands, Let them provide themselves with fat and butter. Tearless and free from care, well-decked with jewels, Let first these wives ascend the place of mourning.",
   "10.018.08": "Arise, come to the world of life, O woman; Thou liest here by one whose breath has left him. Come: thou hast entered upon the wifehood Of this thy lord who takes thy hand and woos thee.",
   "10.018.09": "From the dead hand I take the bow he wielded, To win for us dominion, might, and glory. Thou there, we here, rich in heroic offspring, Will vanquish all assaults of every foeman.",
   "10.018.10": "Approach the bosom of the earth, the mother, This earth, the far-extending, most propitious; Young, soft as wool to bounteous givers, may she Preserve thee from the lap of dissolution.",
   "10.018.11": "Wide open, earth, O press not heavily on him; Be easy of approach to him, a refuge safe; As with a robe a mother hides Her son, so shroud this man, O earth.",
   "10.018.12": "Now opening wide may here the earth stand steadfast, May here a thousand columns rise to prop her; May here those mansions ever drip with butter, And here be always shelter to protect him.",
   "10.018.13": "For thee I now prop up the earth around thee here; In lowering this clod may I receive no harm. May the Fathers hold up for thee this column, And Yama here provide for thee fit mansions.",
   "10.034.01": "On high trees born and in a windy region The danglers, rolling on the diceboard, cheer me. Like Soma draught from Mūjavant's great mountain, The rousing nut Vibhīdaka has pleased me.",
   "10.034.02": "She wrangles not with me nor is she angry: To me and comrades she was ever kindly. For dice that only luckless throws effected I've driven away from home a wife devoted.",
   "10.034.03": "Her mother hates me, she herself rejects me: For one in such distress there is no pity. I find a gambling man is no more useful Than is an aged horse that's in the market.",
   "10.034.04": "Others embrace the wife of him whose chattels The eager dice have striven hard to capture; And father, mother, brothers say about him: \"We know him not; lead him away a captive.\"",
   "10.034.05": "When to myself I think, \"I'll not go with them, I'll stay behind my friends that go to gamble,\" And those brown nuts, thrown down, have raised their voices, I go, like wench, straight to the place of meeting.",
   "10.034.06": "To the assembly hall the gambler sallies. And asking, \"Shall I win?\" he quakes and trembles. And then the dice run counter to his wishes, Giving the lucky throw to his opponent.",
   "10.034.07": "The dice attract the gambler, but deceive and wound, Both paining men at play and causing them to pain. Like boys they offer first and then take back their gifts: With honey sweet to gamblers by their magic charm.",
   "10.034.08": "Their throng in triple fifties plays untrammelled, Like Savitar the god whose laws are constant. They yield not to the wrath of even the mighty: A king himself on them bestows obeisance.",
   "10.034.09": "Downward they roll, then swifty springing upward, They overcome the man with hands, though handless. Cast on the board like magic bits of charcoal, Though cold themselves, they burn the heart to ashes.",
   "10.034.10": "Grieved is the gambler's wife by him abandoned, Grieved, too, his mother as he aimless wanders. Indebted, fearing, he desiring money At night approaches other people's houses.",
   "10.034.11": "It pains the gambler when he sees a woman Another's wife, and their well-ordered household. He yokes those brown steeds early in the morning, And when the fire is low sinks down a beggar.",
   "10.034.12": "To him who's general of your mighty forces, As king becomes the chief of your battalions, I hold my fingers ten extended forward \"No money I withhold, this truth I tell thee.\"",
   "10.034.13": "Play not with dice, but cultivate thy tillage, Enjoy thy riches, deeming them abundant. There are thy cows, there is thy wife, O Gambler: This counsel Savitar the noble gives me.",
   "10.034.14": "Make friends with us, we pray, to us be gracious; Do not bewitch us forcibly with magic; Let now your enmity, your anger slumber: Let others be in brownies' toils entangled.",
   "09.112.01": "Various indeed are our concerns. And men's vocations manifold: The carpenter and leech desire A break; the priest a Soma rite.",
   "09.112.02": "The smith, with dry wood on his hearth, With wings of birds to fan the fire. With anvil and with glowing flames. Desires a patron rich in gold.",
   "09.112.03": "A poet I: my dad's a leech, Mama the upper millstone turns: With various aims we strive for wealth, As if we followed after kine.",
   "10.071.01": "When seers, Bṛhaspati, in early ages, Assigning names, of speech the first sounds uttered, Then was revealed their best unsoiled possession That hidden in their hearts with love they cherished.",
   "10.071.02": "Where wise men fashion speech with understanding And sift it, as with sieves the corn is winnowed, There friends may learn to know each other's friendship: Upon their speech is set the stamp of beauty.",
   "10.071.03": "The track of speech with sacrifice they followed, And found it in the midst of sages lurking; They took and scattered it in many places: The seven singers chanted it in chorus.",
   "10.071.04": "And many a one, though seeing, does not grasp it, While others, though they hear, have no cognition. But speech to many a one surrenders freely, As wife, fair-robed and willing, to her husband.",
   "10.071.05": "They say that many a man has grown in friendship Both stiff and stout: they send him not to contests, He with illusion unprolific wanders: The speech he's learnt yields neither fruit nor blossom.",
   "10.071.06": "Whoever his devoted friend abandons, In speech for him there's no participation, And what he hears, he hears without perception; For such a man knows not the path of virtue.",
   "10.071.07": "Though having eyes and ears alike, companions Appear unequal in their mental quickness. Some are like lakes that reach to mouth or armpits, While others seem like shallow ponds for bathing.",
   "10.071.08": "When, having in their hearts gained mental quickness, The Brahmins sacrifice as friends together. Then many a one is left behind in knowledge. While others stride in front with prayers effective.",
   "10.071.09": "Those men who do not hurry here and there with zeal, Who are not Brahmins nor press out the Soma juice, They having gained, to no good end, the power of speech, As unproductive workers weave their web in vain.",
   "10.071.10": "All friends rejoice when their companion famous Returns from the assembly hall a victor. He drives away reproach and wins them nurture: He is sent out as fitted for the contest.",
   "10.071.11": "The one sits putting forth rich bloom of stanzas; Another sings a song in skilful metres; A third as Brahmin states the laws of being; A fourth metes out the sacrifice's measure.",
   "10.117.01": "The gods inflict not hunger as a means to kill: Death frequently befalls even satiated men. The charitable giver's wealth melts not away; The niggard never finds a man to pity him.",
   "10.117.02": "Who, of abundant food possessed, makes hard his heart Towards a needy and decrepit suppliant Whom once he courted, come to pray to him for bread: A man like this as well finds none to pity him.",
   "10.117.03": "He is the liberal man who helps the beggar That, craving food, emaciated wanders, And coming to his aid, when asked to succour, Immediately makes him a friend hereafter.",
   "10.117.04": "He is no friend who gives not of his substance To his devoted, intimate companion: This friend should turn from him — here is no haven — And seek a stranger elsewhere as a helper.",
   "10.117.05": "The wealthier man should give unto the needy, Considering the course of life hereafter; For riches are like chariot wheels revolving: Now to one man they come, now to another.",
   "10.117.06": "The foolish man from food has no advantage; In truth I say: it is but his undoing; No friend he ever fosters, no companion: He eats alone, and he alone is guilty.",
   "10.117.07": "The plough that cleaves the soil produces nurture; He that bestirs his feet completes his journey. The speaking Brahmin earns more than the silent; A friend who gives is better than the niggard.",
   "10.117.08": "The one-foot strides more swiftly than the biped; The biped goes beyond him who has three feet. The quadruped comes at the call of bipeds, And watches near where groups of five are gathered.",
   "10.117.09": "Two hands though equal make not what is equal; No sister cows yield milk in equal measure; Unequal is the strength even of twin children; The gifts of even kinsmen are unequal.",
   "10.108.01": "With what desire has Saramā come hither? For weary is the way and far the distance. What was for us the message, what her roaming? How didst thou pass across the Rasā's waters?",
   "10.108.02": "I come sent out as messenger by Indra, O Paṇis, searching round for your great treasures. In fear that I should leap across, she helped me: I traversed thus the waters of the Rasā.",
   "10.108.03": "What, Saramā, is Indra like, as envoy For whom thou comest from the farthest distance? Let him come here: we will make him our comrade. So let him be the herdsman of our cattle.",
   "10.108.04": "I know he can't be harmed, but injures others, He as whose envoy from afar I come here. Deep-flowing streams cannot conceal his body: By Indra slain, ye shall lie prostrate, Paṇis.",
   "10.108.05": "Those cows for which, O Saramā, thou soughtest, Around the ends of heaven flying, fair one: Who them to thee would leave without resistance? And sharp indeed our weapons are in conflict.",
   "10.108.06": "Though these your words can not be fought with missiles, Nor those mis-shapen bodies pierced by arrows, Nor yet the road be forced, to reach your stronghold: Bṛhaspati will never spare you, Paṇis.",
   "10.108.07": "This treasure, Saramā, on rock is founded. Replete with goods, and cows, and horses. The Paṇis here, its stout protectors, guard it: In vain thou comest to a fort unyielding.",
   "10.108.08": "Hither will come the seers inspired with Soma, Ayāsya, Aṅgirases, and Navagvas: They will appropriate this stall of cattle. The Paṇis then shall all these boasts relinquish.",
   "10.108.09": "And since, O Saramā, thus by compulsion Divine coerced, thou hast come hither to us: We will make thee our sister: pray return not; We will give thee a share of kine, thou fair one.",
   "10.108.10": "I know not what's a brother or a sister: The fierce Aṅgirases and Indra know it. They seemed to me, when I came here, right eager For kine: from hence go far away, ye Paṇis.",
   "10.108.11": "Go, Paṇis, to the distance far: the cattle Shall issue, breaking rightly from their prison. Bṛhaspati, the pressing stones, and Soma, And priestly sages found them in concealment.",
   "07.103.01": "Resting in silence for a year, Like Brahmins practising a vow, The frogs have lifted up their voices, Excited by Parjanya's call.",
   "07.103.02": "When heavenly waters have poured down upon them Resting in pools, like dried up leather buckets, The croakings of the frogs resound together, Like noise of cows with calves in concert lowing.",
   "07.103.03": "When showers have streamed around them, eager, thirsty, Upon the advent of the rainy season, With joyful croak the one draws near the other Who greets him, as a son comes near his father.",
   "07.103.04": "The one of them the other hails with welcome, When in the flow of waters they have revelled; When rained upon the frogs become exultant, He that is Spotty joins his voice to Tawny's.",
   "07.103.05": "When one repeats the utterance of the other, As those who learn the lessons of their teacher, All this is like concordant recitation, As eloquent ye prate upon the waters.",
   "07.103.06": "One lows like cows, one like a goat is bleating; This one is Spotty, one of them is Tawny. Bearing a common name they're many-coloured, They variously adorn their voice in speaking.",
   "07.103.07": "As Brahmins at the mighty Soma offering Sit round the large and brimming vessel talking; So throng ye all around the pool to hallow This annual day that, frogs, begins the rain-time.",
   "07.103.08": "These Soma-pressing Brahmins raise their voices And offer their recurrent year's devotion; And these Adhvaryu priests with kettles sweating Come forth to view, and none of them are hidden.",
   "07.103.09": "The twelve months' god-sent order they have guarded, And never do these men infringe the season. Whep in the year the rainy time commences, Those who were heated milk-pots gain deliverance.",
   "07.103.10": "Both Lowing Cow and Bleating Goat have given, Spotty and Tawny, too, have given us riches. The frogs give kine by hundreds; they for pressings Of Soma thousandfold, prolong existence."
}