{
   "10.121.01": "In the beginning there arose the Golden Child (Hiranya-garbha 1); as soon as born, he alone was the lord of all that is. He stablished the earth and this heaven:—Who is the God to whom we shall offer sacrifice?",
   "10.121.02": "He who gives breath, he who gives strength, whose 1 command all the bright gods revere, whose shadow 2 is immortality, whose shadow is death:—Who is the God to whom we shall offer sacrifice?",
   "10.121.03": "He who through his might became the sole king of the breathing and twinkling 1 world, who governs all this, man and beast:—Who is the God to whom we shall offer sacrifice?",
   "10.121.04": "He through whose might 1 these snowy mountains are, and the sea, they say, with the distant river (the Rasâ 2), he of whom these regions are indeed the two arms:—Who is the God to whom we shall offer sacrifice?",
   "10.121.05": "He through whom the awful heaven and the earth were made fast 1, he through whom the ether was stablished, and the firmament; he who measured the air in the sky 2:—Who is the God to whom we shall offer sacrifice?",
   "10.121.06": "He to whom heaven and earth 1, standing firm by his will, look up, trembling in their mind; he over whom the risen sun shines forth:—Who is the God to whom we shall offer sacrifice?",
   "10.121.07": "When the great waters 1 went everywhere, holding the germ (Hiranya-garbha), and generating light, then there arose from them the (sole 2) breath of the gods:—Who is the God to whom we shall offer sacrifice?",
   "10.121.08": "He who by his might looked even over the waters which held power (the germ) and generated the sacrifice (light 1), he who alone is God above all gods 2:—Who is the God to whom we shall offer sacrifice?",
   "10.121.09": "May he not hurt us, he who is the begetter of the earth, or he, the righteous, who begat the heaven; he who also begat the bright and mighty waters:—Who is the God to whom we shall offer sacrifice?",
   "10.121.10": "1 Pragâpati, no other than thou embraces all these created things. May that be ours which we desire when sacrificing to thee: may we be lords of wealth!]",
   "01.006.01": "Those who stand around 2 him while he moves on, harness the bright red (steed) 1; the lights in heaven shine forth 3.",
   "01.006.02": "They harness to the chariot on each side his (Indra's) 1 two favourite bays, the brown, the bold, who can carry the hero.",
   "01.006.03": "Thou who createst light where there was no light, and form, O men 1! where there was no form, hast been born together with the dawns 2.",
   "01.006.04": "Thereupon 1 they (the Maruts), according to their wont 2, assumed again the form of new-born babes 3, taking their sacred name.",
   "01.006.05": "Thou, O Indra, with the swift Maruts 1, who break even through the stronghold 2, hast found even in their hiding-place the bright ones 3 (days or clouds).",
   "01.006.06": "The pious singers 1 (the Maruts) have, after their own mind 2, shouted towards the giver of wealth, the great, the glorious (Indra).",
   "01.006.07": "Mayest thou 1 (host of the Maruts) be verily seen 2 coming together with Indra, the fearless: you are both happy-making, and of equal splendour.",
   "01.006.08": "With the beloved hosts of Indra, with the blameless, hasting 2 (Maruts), the sacrificer 1 cries aloud.",
   "01.006.09": "From yonder, O traveller (Indra), come hither, or from the light of heaven 1; the singers all yearn for it;—",
   "01.006.10": "Or we ask Indra for help from here, or from heaven, or from above the earth, or from the great sky.",
   "01.019.01": "Thou art called forth to this fair sacrifice for a draught of milk 1; with the Maruts come hither, O Agni!",
   "01.019.02": "No god indeed, no mortal, is beyond the might 1 of thee, the mighty one; with the Maruts come hither, O Agni!",
   "01.019.03": "They who know of the great sky 1, the Visve Devas 2 without guile 3; with those Maruts come hither, O Agni!",
   "01.019.04": "The strong ones who sing their song 1, unconquerable by force; with the Maruts come hither, O Agni!",
   "01.019.05": "They who are brilliant, of terrible designs, powerful, and devourers of foes; with the Maruts come hither, O Agni!",
   "01.019.06": "They who in heaven are enthroned as gods, in the light of the firmament 1; with the Maruts come hither, O Agni!",
   "01.019.07": "They who toss the clouds 1 across the surging sea 2; with the Maruts come hither, O Agni!",
   "01.019.08": "They who shoot with their darts (lightnings) across the sea with might; with the Maruts come hither, O Agni!",
   "01.019.09": "I pour out to thee for the early draught1 the sweet (juice) of Soma; with the Maruts come hither, O Agni!",
   "01.037.01": "Sing forth, O Kanvas, to the sportive host of your Maruts, brilliant on their chariots, and unscathed 1,—",
   "01.037.02": "They who were born together, self-luminous, with the spotted deer (the clouds) 1, the spears, the daggers, the glittering ornaments 2.",
   "01.037.03": "I hear their 1 whips, almost close by, when they crack them in their hands; they gain splendour 2 on their way 3.",
   "01.037.04": "Sing forth the god-given prayer to the wild 1 host of your Maruts, endowed with terrible vigour 2 and strength.",
   "01.037.05": "Celebrate the bull among the cows (the storm among the clouds) 1, for it is the sportive host of the Maruts; he grew as he tasted the rain 2.",
   "01.037.06": "Who, O ye men, is the strongest among you here, ye shakers of heaven and earth, when you shake them like the hem of a garment 1?",
   "01.037.07": "At your approach the son of man holds himself down; the gnarled cloud 1 fled at your fierce anger.",
   "01.037.08": "They at whose racings 1 the earth, like a hoary king, trembles for fear on their ways,",
   "01.037.09": "Their birth is strong indeed: there is strength to come forth from their mother, nay, there is vigour twice enough for it 1.",
   "01.037.10": "And these sons, the singers 1, stretched out the fences in their racings 2; the cows had to walk knee-deep.",
   "01.037.11": "They cause this long and broad unceasing rain 1 to fall on their ways.",
   "01.037.12": "O Maruts, with such strength as yours, you have caused men to tremble 1, you have caused the mountains to tremble.",
   "01.037.13": "As the Maruts pass 1 along, they talk together on the way: does any one hear them?",
   "01.037.14": "Come fast on your quick steeds! there are worshippers 1 for you among the Kanvas: may you well rejoice among them.",
   "01.037.15": "Truly there is enough for your rejoicing. We always are their servants, that we may live even the whole of life.",
   "01.038.01": "What then now? When 1 will you take (us) as a dear father takes his son by both hands, O ye gods, for whom the sacred grass has been trimmed 2?",
   "01.038.02": "Where now? On what errand of yours are you going, in heaven, not on earth 1? Where are your cows sporting?",
   "01.038.03": "Where are your newest favours 1, O Maruts? Where the blessings? Where all delights?",
   "01.038.04": "If you, sons of Prisni, were mortals, and your praiser an immortal 1,—",
   "01.038.05": "Then never 1 should your praiser be unwelcome, like a deer in pasture grass 2, nor should he go on the path of Yama 3.",
   "01.038.06": "Let not one sin 1 after another, difficult to be conquered, overcome us; may it depart 2 together with greed.",
   "01.038.07": "Truly they are terrible and powerful; even to the desert the Rudriyas bring rain that is never dried up 1.",
   "01.038.08": "The lightning lows like a cow, it follows as a mother follows after her young, when the shower (of the Maruts) has been let loose 1.",
   "01.038.09": "Even by day the Maruts create darkness with the water-bearing cloud 1, when they drench the earth.",
   "01.038.10": "Then from the shouting of the Maruts over the whole space of the earth 1, men reeled forward.",
   "01.038.11": "Maruts on your strong-hoofed never-wearying 3 steeds 1 go after those bright ones (the clouds), which are still locked up 2.",
   "01.038.12": "May your fellies be strong, the chariots, and their horses, may your reins 1 be well-fashioned.",
   "01.038.13": "Speak forth for ever with thy voice to praise the Lord of prayer 1, Agni, who is like a friend 2, the bright one.",
   "01.038.14": "Fashion a hymn in thy mouth! Expand like the cloud 1! Sing a song of praise.",
   "01.038.15": "Worship the host of the Maruts, the terrible. . the glorious, the musical 1. May they be magnified here among us 2.",
   "01.039.01": "When you thus from afar cast forwards your measure 1, like a blast of fire, through whose wisdom is it, through whose design 2? To whom do you go, to whom, ye shakers (of the earth)?",
   "01.039.02": "May your weapons be firm to attack, strong also to withstand. May yours be the more glorious power, nor that of the deceitful mortal.",
   "01.039.03": "When you overthrow what is firm, O ye men, and whirl about what is heavy, you pass 1 through the trees of the earth, through the clefts of the rocks 2.",
   "01.039.04": "No real foe of yours is known in heaven, nor on earth, ye devourers of foes! May power be yours, together with your race 1! O Rudras, can it be defied 2?",
   "01.039.05": "They make the rocks tremble, they tear asunder the kings of the forest 1. Come on, Maruts, like madmen, ye gods, with your whole tribe.",
   "01.039.06": "You have harnessed the spotted deer to your chariots, a red one draws as leader 1; even the earth listened 2 at your approach, and men were frightened.",
   "01.039.07": "O Rudras, we quickly desire your help for our race. Come now to us with help, as of yore; thus now for the sake of the frightened Kanva 1.",
   "01.039.08": "Whatever fiend, roused by you or roused by men, attacks us, deprive him of power, of strength, and of your favours 1.",
   "01.039.09": "For you, chasing and wise Maruts, have wholly protected 1 Kanva. Come to us, Maruts, with your whole favours, as lightnings 2 (go in quest of) the rain.",
   "01.039.10": "Bounteous givers, you carry whole strength, whole power, ye shakers (of the world). Send, O Maruts, against the wrathful enemy of the poets an enemy, like an arrow 1.",
   "01.064.01": "For the manly host, the joyful, the wise, for the Maruts bring thou, O Nodhas 1, a pure offering 2. I prepare songs, like as a handy priest 3, wise in his mind, prepares the water, mighty at sacrifices.",
   "01.064.02": "They are born, the tall bulls of Dyu 1 (heaven), the manly youths 2 of Rudra, the divine, the blameless, pure, and bright like suns; scattering raindrops, full of terrible designs, like giants 3.",
   "01.064.03": "The youthful Rudras, they who never grow old, the slayers of the demon 1, have grown irresistible like mountains. They throw down with their strength all beings, even the strongest, on earth and in heaven.",
   "01.064.04": "They deck themselves with glittering ornaments 1 for a marvellous show; on their chests they fastened gold (chains) for beauty 2; the spears on their shoulders pound to pieces 3; they were born together by themselves 4, the men of Dyu.",
   "01.064.05": "They who confer power 1, the roarers 2, the devourers of foes, they made winds and lightnings by their powers. The shakers milk the heavenly udders (clouds), they sprinkle the earth all round with milk (rain).",
   "01.064.06": "The bounteous 1 Maruts pour forth 2 water, mighty at sacrifices, the fat milk (of the clouds). They seem to lead 3 about the powerful horse, the cloud, to make it rain; they milk the thundering, unceasing spring 4",
   "01.064.07": "Mighty they are, powerful, of beautiful splendour, strong in themselves 1 like mountains, (yet) swiftly gliding along;—you chew up forests, like wild elephants 2, when you have assumed your powers among the red flames 3.",
   "01.064.08": "Like lions they roar, the wise Maruts, they are handsome like gazelles 1, the all-knowing. By night 2 with their spotted deer (rain-clouds) and with their spears (lightnings) they rouse the companions together, they whose ire through strength is like the ire of serpents.",
   "01.064.09": "You who march in companies, the friends of man, heroes, whose ire through strength is like the ire of serpents 1, salute heaven and earth 2! On the seats on your chariots, O Maruts, the lightning stands, visible like light 3.",
   "01.064.10": "All-knowing, surrounded with wealth, endowed with powers, singers 1, men of endless prowess armed with strong rings 2, they, the archers, have taken the arrow in their fists.",
   "01.064.11": "The Maruts who with the golden tires of their wheels increase the rain, stir up the clouds like wanderers on the road. They are brisk, indefatigable 1, they move by themselves; they throw down what is firm, the Maruts with their brilliant spears make (everything) to reel 2.",
   "01.064.12": "We invoke with prayer 1 the offspring of Rudra, the brisk, the pure, the worshipful 2, the active. Cling 3 for happiness-sake to the strong company of the Maruts, the chasers of the sky 4, the powerful, the impetuous 5.",
   "01.064.13": "The mortal whom ye, Maruts, protected, he indeed surpasses people in strength through your protection. He carries off booty with his horses, treasures with his men; he acquires honourable 1 wisdom, and he prospers 2.",
   "01.064.14": "Give, O Maruts, to our lords strength glorious, invincible in battle, brilliant, wealth-acquiring, praiseworthy, known to all men 1. Let us foster our kith and kin during a hundred winters.",
   "01.064.15": "Will 1 you then, O Maruts, grant unto us wealth, durable, rich in men, defying all onslaughts 2?—wealth a hundred and a thousand-fold, always increasing?—May he who is rich in prayers 3 (the host of the Maruts) come early and soon!",
   "01.085.01": "Those who glance forth like wives and yoke-fellows 1, the powerful sons of Rudra on their way, they, the Maruts, have indeed made heaven and earth to grow 2; they, the strong and wild, delight in the sacrifices.",
   "01.085.02": "When grown up 1, they attained to greatness; the Rudras have established their seat in the sky. While singing their song and increasing their vigour, the sons of Prisni have clothed themselves in beauty 2.",
   "01.085.03": "When these sons of the cow (Prisni) 1 adorn themselves with glittering ornaments, the brilliant 2 ones put bright weapons on their bodies 3. They drive away every adversary 4; fatness (rain) streams along their paths;—",
   "01.085.04": "When you 1, the powerful, who shine with your spears, shaking even what is unshakable by strength,—when you, O Maruts, the manly hosts 2, had yoked the spotted deer, swift as thought, to your chariots;—",
   "01.085.05": "When you had yoked the spotted deer before your chariots, hurling 1 the stone (thunderbolt) in the fight, then the streams of the red-(horse) 2 rush forth: like a skin 3 with water they water the earth.",
   "01.085.06": "May the swiftly-gliding, swift-winged horses carry you hither! Come forth with your arms 1! Sit down on the grass-pile; a wide seat has been made for you. Rejoice, O Maruts, in the sweet food 2.",
   "01.085.07": "Strong in themselves, they grew 1 with might; they stepped to the firmament, they made their seat wide. When Vishnu 2 saved the enrapturing Soma, the Maruts sat down like birds on their beloved altar.",
   "01.085.08": "Like 1 heroes indeed thirsting for fight they rush about; like combatants eager for glory they have striven in battles. All beings are afraid of the Maruts; they are men terrible to behold, like kings.",
   "01.085.09": "When the clever Tvashtar 1 had turned the well-made, golden, thousand-edged thunderbolt, Indra takes it to perform his manly deeds 2; he slew Vritra, he forced out the stream of water.",
   "01.085.10": "By their power they pushed the well 1 aloft, they clove asunder the rock (cloud), however strong. Blowing forth their voice 2 the bounteous Maruts performed, while drunk of Soma, their glorious deeds.",
   "01.085.11": "They pushed the well (cloud) athwart this way, they poured out the spring to the thirsty Gotama. The Maruts with beautiful splendour approach him with help, they in their own ways satisfied the desire of the sage.",
   "01.085.12": "The shelters which you have for him who praises you, grant them threefold 1 to the man who gives! Extend the same to us, O Maruts! Give us, ye heroes 2, wealth with valiant offspring!",
   "01.086.01": "O Maruts, that man in whose dwelling you drink (the Soma), ye mighty (sons) of heaven, he indeed has the best guardians 1.",
   "01.086.02": "You who are propitiated 1 either by sacrifices or from the prayers of the sage, hear the call, O Maruts!",
   "01.086.03": "Aye, the powerful man to whom you have granted a sage, he will live in a stable rich in cattle 1.",
   "01.086.04": "On the altar of this strong man (here) 1 Soma is poured out in daily sacrifices; praise and joy are sung.",
   "01.086.05": "To him let the mighty 1 Maruts listen, to him who surpasses all men, as the flowing rain-clouds 2 pass over the sun.",
   "01.086.06": "For we, O Maruts, have sacrificed at many harvests, through the mercies 1 of the swift gods (the storm-gods).",
   "01.086.07": "May that mortal be blessed, O chasing Maruts, whose offerings you carry off 1.",
   "01.086.08": "You take notice either of the sweat of him who praises you, ye men of true strength, or of the desire of the suppliant 1.",
   "01.086.09": "O ye of true strength, make this manifest with might! strike the fiend 1 with your lightning!",
   "01.086.10": "Hide the hideous darkness, destroy 1 every tusky 2 fiend. Make the light which we long for!",
   "01.087.01": "Endowed with exceeding vigour and power, the singers, the never flinching, the immovable, the impetuous, the most beloved and most manly, have decked themselves with their glittering ornaments, a few only 1, like the heavens with the stars,",
   "01.087.02": "When you have seen your way through the clefts, like birds, O Maruts, on whatever road it be 1, then the casks (clouds) on your chariots trickle everywhere, and you pour out the honey-like fatness (the rain) for him who praises you.",
   "01.087.03": "At their racings the earth shakes, as if broken 1, when on the (heavenly) paths they harness (their deer) for victory 2. They the sportive, the roaring, with bright spears, the shakers (of the clouds) have themselves glorified their greatness.",
   "01.087.04": "That youthful company (of the Maruts), with their spotted horses 1, moves by itself; hence 2 it exercises lordship, invested with powers. Thou indeed art true, thou searchest out sin 3, thou art without blemish. Therefore the manly host will help this prayer.",
   "01.087.05": "We speak after the kind of our old father, our tongue goes forth at the sight 1 of the Soma: when the singers (the Maruts) had joined Indra in deed 2, then only they took their holy names;—",
   "01.087.06": "These Maruts, armed with beautiful rings, obtained splendours for their glory 1, they obtained 2 rays, and men to celebrate them; nay, armed with daggers, speeding along, and fearless, they found the beloved domain of the Maruts 3.",
   "01.165.01": "To what splendour do the Maruts all equally 1 cling 2, they who are of the same age, and dwell in the same nest? With what thoughts?—from whence are they come 3? Do these heroes sing forth their (own) strength 4, wishing for wealth?",
   "01.165.02": "Whose prayers have the youths accepted? Who has turned the Maruts to his own sacrifice? By what strong desire 1 may we arrest them, they who float through the air like hawks?",
   "01.165.03": "From whence 1, O Indra, dost thou come alone, thou who art mighty? O lord of men 2, what has thus happened to thee? Thou greetest (us) 3 when thou comest together with (us), the bright (Maruts) 4. Tell us then, thou with thy bay horses, what thou hast against us!",
   "01.165.04": "The sacred songs are mine, (mine are) the prayers 1; sweet 2 are the libations! My strength rises 3, my thunderbolt is hurled forth. They call for me, the hymns yearn for me. Here are my horses, they carry me hither.",
   "01.165.05": "From thence, in company with our strong friends 1, having adorned our bodies, we now harness our fallow deer 2 with all our might 3;—for, Indra, according to custom, thou hast come to be with us.",
   "01.165.06": "Where, O Maruts, was that custom with you, when you left me alone in the killing of Ahi? I indeed am terrible, powerful, strong,—I escaped from the blows of every enemy 1.",
   "01.165.07": "Thou hast achieved much with us as companions 1. With equal valour, O hero! let us achieve then many things, O thou most powerful, O Indra! whatever we, O Maruts, wish with our mind 2.",
   "01.165.08": "I slew Vritra, O Maruts, with (Indra's) might, having grown powerful through my own vigour; I, who hold the thunderbolt in my arms, have made these all-brilliant waters to flow freely for man 1.",
   "01.165.09": "Nothing, O mighty lord, is strong 1 before thee: no one is known among the gods 2 like unto thee. No one who is now born 3 comes near, no one who has been born. Do what thou wilt do 4, thou who art grown so strong.",
   "01.165.10": "Almighty strength be mine alone, whatever I may do, daring in my heart 1; for I indeed, O Maruts, am known as terrible: of all that I threw down, I, Indra, am the lord.",
   "01.165.11": "O Maruts, now your praise has pleased me, the glorious hymn which you have made for me, ye men!—for me, for Indra, for the joyful hero, as friends for a friend, for your own sake, and by your own efforts 1.",
   "01.165.12": "Truly, there they are, shining towards me, bringing blameless glory, bringing food. O Maruts, wherever I have looked for you, you have appeared to me in bright splendour: appear to me also now!",
   "01.165.13": "Who has magnified you here, O Maruts? Come hither, O friends, towards your friends. Ye brilliant Maruts, welcoming 1 these prayers, be mindful 2 of these my rites.",
   "01.165.14": "The wisdom of Mânya has brought us hither, that he should help as the poet helps the performer of a sacrifice 1: turn hither quickly 2! Maruts, on to the sage! the singer has recited these prayers for you.",
   "01.165.15": "May this your praise, O Maruts, this song of Mândârya, the son of Mâna 1, the poet, bring offspring 2 for ourselves with food. May we have an invigorating autumn, with quickening rain 3.",
   "01.166.01": "Let us now proclaim for the robust 1 host, for the herald 2 of the powerful (Indra), their ancient greatness! O ye strong-voiced Maruts, you heroes, prove your powers on your march, as with a torch, as with a sword 3!",
   "01.166.02": "Like parents bringing a dainty to 1 their own 2 son, the wild (Maruts) play playfully at the sacrifices. The Rudras reach the worshipper with their protection, strong in themselves, they do not fail the sacrificer.",
   "01.166.03": "For him to whom the immortal guardians have given fulness of wealth, and who is himself a giver of oblations, the Maruts, who gladden men with the milk (of rain), pour out, like friends, many clouds.",
   "01.166.04": "You who have stirred 1 up the clouds with might, your horses rushed 2 forth, self-guided. All beings who dwell in houses 3 are afraid of you, your march is brilliant with your spears thrust forth.",
   "01.166.05": "When they whose march is terrible have caused the rocks to tremble 1, or when the manly Maruts have shaken the back of heaven, then every lord of the forest fears at your racing, each shrub flies out of your way 2, whirling like chariot-wheels 3.",
   "01.166.06": "You, O terrible Maruts, whose ranks are never broken, favourably 1 fulfil our prayer 2! Wherever your gory-toothed 3 lightning bites 4, it crunches 5 cattle, like a well-aimed bolt 6.",
   "01.166.07": "The Maruts whose gifts are firm, whose bounties are never ceasing, who do not: revile 1, and who are highly praised at the sacrifices, they sing their song 2 for to drink the sweet juice: they know the first manly deeds of the hero (Indra).",
   "01.166.08": "The man whom you have guarded, O Maruts,—shield him with hundredfold strongholds from injury 1 and mischief,—the man whom you, O fearful, powerful singers, protect from reproach in the prosperity of his children.",
   "01.166.09": "On your chariots, O Maruts, there are all good things, strong weapons 1 are piled up clashing against each other. When you are on your journeys, you carry the rings 2 on your shoulders, and your axle turns the two wheels at once 3.",
   "01.166.10": "In their manly arms there are many good things, on their chests golden chains 1, flaring 2 ornaments, on their shoulders speckled deer-skins 3, on their fellies sharp edges 4; as birds spread their wings, they spread out splendours behind.",
   "01.166.11": "They, mighty by might, all-powerful powers 1, visible from afar like the heavens 2 with the stars, sweet-toned, soft-tongued singers with their mouths 3, the Maruts, united with Indra, shout all around.",
   "01.166.12": "This is your greatness 1 O well-born Maruts!—your bounty 3 extends far, as the sway 2 of Aditi 4. Not even 5 Indra in his scorn 6 can injure that bounty, on whatever man you have bestowed it for his good deeds.",
   "01.166.13": "This is your kinship (with us), O Maruts, that you, immortals, in former years have often protected the singer 1. Having through this prayer granted a hearing to man, all these heroes together have become well-known by their valiant deeds.",
   "01.166.14": "That we may long flourish, O Maruts, with your wealth, O ye racers, that our men may spread in the camp, therefore let me achieve the rite with these offerings.",
   "01.166.15": "May this praise, O Maruts, this song of Mândârya, the son of Mâna, the poet, ask you with food for offspring for ourselves! May we have an invigorating autumn, with quickening rain!",
   "01.167.01": "O Indra, a thousand have been thy helps accorded to us, a thousand, O driver of the bays, have been thy most delightful viands. May thousands of treasures richly to enjoy, may goods 1 come to us a thousandfold.",
   "01.167.02": "May the Maruts come towards us with their aids, the mighty ones, or with their best aids from the great heaven, now that their furthest steeds have rushed forth on the distant shore of the sea;",
   "01.167.03": "There clings 1 to the Maruts one who moves in secret, like a man's wife (the lightning 2), and who is like a spear carried behind 3, well grasped, resplendent, gold-adorned; there is also with them Vâk (the voice of thunder), like unto a courtly, eloquent woman.",
   "01.167.04": "Far away the brilliant, untiring Maruts cling to their young maid, as if she belonged to them all 1; but the terrible ones did not drive away Rodasî (the lightning), for they wished her to grow 2 their friend.",
   "01.167.05": "When the divine Rodasî with dishevelled locks, the manly-minded, wished to follow them, she went, like Sûryâ (the Dawn), to the chariot of her servant, with terrible look, as with the pace of a cloud.",
   "01.167.06": "As soon as the poet with the libations, O Maruts, had sung his song, at the sacrifice, pouring out Soma, the youthful men (the Maruts) placed the young maid (in their chariot) as their companion for victory, mighty in assemblies.",
   "01.167.07": "I praise what is the praiseworthy true greatness of those Maruts, that the manly-minded, proud, and strong one (Rodasî) drives with them towards the blessed mothers.",
   "01.167.08": "They protect 1 Mitra and Varuna from the unspeakable, and Aryaman also finds out the infamous. Even what is firm and unshakable is being shaken 2; but he who dispenses treasures 3, O Maruts, has grown (in strength).",
   "01.167.09": "No people indeed, whether near to us, or from afar, have ever found the end of your strength, O Maruts! The Maruts, strong in daring strength, have, like the sea, boldly 1 surrounded their haters.",
   "01.167.10": "May we to-day, may we to-morrow in battle be called the most beloved of Indra. We were so formerly, may we truly be so day by day, and may the lord of the Maruts be with us.",
   "01.167.11": "May this praise, O Maruts, this song of Mândârya, the son of Mâna, the poet, ask you with food for offspring for ourselves! May we have an invigorating autumn, with quickening rain!",
   "01.168.01": "To every sacrifice 1 you hasten together 2, you accept prayer after prayer, O quick Maruts! Let me therefore bring you hither by my prayers from heaven and earth, for our welfare, and for our great protection;",
   "01.168.02": "The shakers who were born to bring food and light 1, self-born and self-supported, like springs 2, like thousandfold waves of water, aye, visibly like unto excellent bulls 3,",
   "01.168.03": "Those Maruts, like Soma-drops 1, which squeezed from ripe stems dwell, when drunk, in the hearts of the worshipper—see how on their shoulders there clings as if a clinging wife; in their hands the quoit is held and the sword.",
   "01.168.04": "Lightly they have come down from heaven of their own accord: Immortals, stir yourselves with the whip! The mighty Maruts on dustless paths, armed with brilliant spears, have shaken down even the strong places.",
   "01.168.05": "O ye Maruts, who are armed with lightning-spears, who stirs you from within by himself, as the jaws are stirred by the tongue 1? You shake the sky 2, as if on the search for food; you are invoked by many 3, like the (solar) horse of the day 4.",
   "01.168.06": "Where, O Maruts, is the top, where the bottom of the mighty sky where you came? When you throw down with the thunderbolt what is strong, like brittle things, you fly across the terrible sea!",
   "01.168.07": "As your conquest is violent, splendid, terrible, full and crushing, so, O Maruts, is your gift delightful, like the largess of a liberal worshipper, wide-spreading, laughing like heavenly lightning.",
   "01.168.08": "From the tires of their chariot-wheels streams gush forth, when they send out the voice of the clouds; the lightnings smiled upon the earth, when the Maruts shower down fatness (fertile rain).",
   "01.168.09": "Prisni 1 brought forth for the great fight the terrible train of the untiring Maruts: when fed they produced the dark cloud 3, and then looked about for invigorating food 2.",
   "01.168.10": "May this praise, O Maruts, this song of Mândârya, the son of Mâna, the poet, ask you with food for offspring for ourselves! May we have an invigorating autumn, with quickening rain!",
   "01.170.01": "Indra: There is no such thing to-day, nor will it be so to-morrow. Who knows what strange thing 1 this is? We must consult the thought of another, for even what we once knew seems to vanish.",
   "01.170.02": "Agastya: Why dost thou wish to kill us, O Indra? the Maruts are thy brothers; fare kindly with them, and do not strike 1 us in battle.",
   "01.170.03": "The Maruts: O brother Agastya, why, being a friend, dost thou despise us? We know quite well what thy mind was. Dost thou not wish to give to us?",
   "01.170.04": "Agastya: Let them prepare the altar, let them light the fire in front! Here we two will spread 2 for thee the sacrifice, to be seen 1 by the immortal.",
   "01.170.05": "Agastya: Thou rulest, O lord of treasures; thou, lord of friends, art the most generous. Indra, speak again with the Maruts, and then consume our offerings at the right season.",
   "01.171.01": "I come to you with this adoration, with a hymn I implore the favour 1 of the quick (Maruts). O Maruts, you have rejoiced 2 in it clearly 3, put down then all anger and unharness your horses!",
   "01.171.02": "This reverent praise of yours, O Maruts, fashioned in the heart, has been offered by the mind 1, O gods! Come to it, pleased in your mind, for you give increase to (our) worship 2.",
   "01.171.03": "May the Maruts when they have been praised be gracious to us, and likewise Maghavat (Indra), the best giver of happiness, when he has been praised. May our trees (our lances) 1 through our valour stand always erect, O Maruts!",
   "01.171.04": "I am afraid of this powerful one, and trembling in fear of Indra. For you the offerings were prepared,—we have now put them away, forgive us!",
   "01.171.05": "Thou through whom the Mânas 1 see the mornings, whenever the eternal dawns flash forth with power 2, O Indra, O strong hero, grant thou glory to us with the Maruts, terrible with the terrible ones, strong and a giver of victory.",
   "01.171.06": "O Indra, protect thou these bravest of men 1 (the Maruts), let thy anger be turned away 2 from the Maruts, for thou hast become 3 victorious together with those brilliant heroes. May we have an invigorating autumn, with quickening rain!",
   "01.172.01": "May your march be brilliant, brilliant through your protection, O Maruts, you bounteous givers, shining like snakes!",
   "01.172.02": "May that straightforward shaft of yours, O Maruts, bounteous givers, be far from us, and far the stone which you hurl!",
   "01.172.03": "Spare, O bounteous givers, the people of Trinaskanda, lift us up that we may live!",
   "02.034.01": "The Maruts charged with rain 1, endowed with fierce force, terrible like wild beasts 2, blazing 3 in their strength 4, brilliant like fires, and impetuous 5, have uncovered the (rain-giving) cows by blowing away the cloud 6.",
   "02.034.02": "The (Maruts) with their rings 1 appeared like the heavens with their stars 2, they shone wide like streams from clouds as soon as Rudra, the strong man, was born for you, O golden-breasted Maruts, in the bright lap of Prisni 3.",
   "02.034.03": "They wash 1 their horses like racers in the courses, they hasten with the points of the reed 2 on their quick steeds. O golden jawed 3 Maruts, violently shaking (your jaws), you go quick 4 with your spotted deer 5, being friends of one mind.",
   "02.034.04": "Those Maruts have grown to feed 1 all these beings, or, it may be, (they have come) hither for the sake of a friend, they who always bring quickening rain. They have spotted horses, their bounties cannot be taken away, they are like headlong charioteers on their ways 2.",
   "02.034.05": "O Maruts, wielding your brilliant spears, come hither on smooth 1 roads with your fiery 2 cows (clouds) whose udders are swelling; (come hither), being of one mind, like swans toward their nests, to enjoy the sweet offering.",
   "02.034.06": "O one-minded Maruts, come to our prayers, come to our libations like (Indra) praised by men 1![paragraph continues] Fulfil (our prayer) like the udder of a barren cow 2, and make the prayer glorious by booty to the singer.",
   "02.034.07": "Grant us this strong horse for our chariot, a draught 1 that rouses our prayers, from day to day, food to the singers, and to the poet in our homesteads 2 luck 3, wisdom, inviolable and invincible strength.",
   "02.034.08": "When the gold-breasted Maruts harness the horses to their chariots, bounteous 1 in wealth, then it is as if a cow in the folds poured out 2 to her calf copious food, to every man who has offered libations.",
   "02.034.09": "Whatever mortal enemy may have placed us among wolves 1, shield us from hurt, ye Vasus! Turn the wheels with burning heat2 against him, and strike down the weapon of the impious fiend, O Rudras!",
   "02.034.10": "Your march, O Maruts, appears brilliant, whether even friends have milked the udder of Prisni, or whether, O sons of Rudra, you mean to blame him who praises you, and to weaken those who are weakening Trita, O unbeguiled heroes 1.",
   "02.034.11": "We invoke you, the great Maruts, the constant wanderers, at the offering of the rapid Vishnu 1; holding ladles (full of libations) and prayerful we ask the golden-coloured and exalted Maruts for glorious wealth.",
   "02.034.12": "The Dasagvas (Maruts?) 1 carried on 2 the sacrifice first; may they rouse us at the break of dawn. Like the dawn, they uncover the dark nights with the red (rays), the strong ones, with their brilliant light, as with a sea of milk.",
   "02.034.13": "With the (morning) clouds, as if with glittering red ornaments 1, these Maruts have grown great in the sacred places 2. Streaming down with rushing splendour 3, they have assumed their bright and brilliant colour.",
   "02.034.14": "Approaching 1 them for their great protection to help us, we invoke them with this worship, they whom Trita may bring near, like the five Hotri priests for victory 2, descending on their chariot to help.",
   "02.034.15": "May that grace of yours by which you help the wretched 1 across all anguish, and by which you deliver the worshipper from the reviler, come hither, O Maruts; may your favour approach us like a cow (going to her calf)!",
   "05.052.01": "O Syâvâsva, sing boldly with 1 the Maruts, the singers who, worthy themselves of sacrifice, rejoice in their guileless glory 2 according to their nature.",
   "05.052.02": "They are indeed boldly the friends of strong power; they on their march protect all who by themselves are full of daring 1.",
   "05.052.03": "Like rushing bulls, these Maruts spring over 1 the dark cows (the clouds) 2, and then we perceive the might of the Maruts in heaven and on earth.",
   "05.052.04": "Let us boldly offer praise and sacrifice to your Maruts, to all them who protect the generation of men, who protect the mortal from injury.",
   "05.052.05": "They who are worthy, bounteous, men of perfect strength, to those heavenly Maruts who are worthy of sacrifice, praise the sacrifice!",
   "05.052.06": "The tall men 1, coming near with their bright chains, and their weapon, have hurled forth their spears. Behind these Maruts there came by itself the splendour of heaven, like laughing lightnings 2.",
   "05.052.07": "Those who have grown up on earth, or in the wide sky, or in the realm of the rivers, or in the abode of the great heaven,",
   "05.052.08": "Praise that host of the Maruts, endowed with true strength and boldness 1, whether those rushing heroes have by themselves harnessed (their horses) for triumph,",
   "05.052.09": "Or whether these brilliant Maruts have in the (speckled) cloud clothed themselves in wool 1, whether by their strength they cut the mountain asunder with the tire of their chariot;",
   "05.052.10": "Call them comers, or goers, or enterers, or followers, under all these names, they watch on the straw 1 for my sacrifice.",
   "05.052.11": "The men (the Maruts) watch, and their steeds watch. Then, so brilliant are their forms to be seen, that people say, Look at the strangers 1!",
   "05.052.12": "In measured steps 1 and wildly shouting 2 the gleemen 3 have danced toward the well (the cloud). They who appeared one by one like thieves, were helpers to me to see the light 4.",
   "05.052.13": "Worship, therefore, O seer, that host of Maruts, and keep and delight them with your voice, they who are themselves wise 1 poets, tall heroes armed with lightning-spears.",
   "05.052.14": "Approach, O seer, the host of Maruts, as a woman approaches a friend, for a gift 1; and you, Maruts, bold in your strength 2, hasten hither, even from heaven, when you have been praised by our hymns.",
   "05.052.15": "If he, after perceiving them, has approached them as gods with an offering, then may he for a gift remain united with the brilliant (Maruts), who by their ornaments are glorious on their march.",
   "05.052.16": "They, the wise 1 Maruts, the lords, who, when there was inquiry for their kindred, told me of the cow, they told me of Prisni as their mother, and of the strong Rudra as their father.",
   "05.052.17": "The seven and seven heroes 1 gave me each a hundred. On the Yamunâ I clear off glorious wealth in cows, I clear wealth in horses.",
   "05.053.01": "Who knows their birth? or who was of yore in the favour of the Maruts, when they harnessed the spotted deer 1?",
   "05.053.02": "Who has heard them when they had mounted their chariots, how they went forth? For the sake of what liberal giver (Sudâs) did they run, and their comrades followed 1, (as) streams of rain (filled) with food?",
   "05.053.03": "They themselves said to me when day by day 1 they came to the feast with their birds 2: they (the Maruts) are manly youths and blameless; seeing them, praise them thus;",
   "05.053.04": "They who shine by themselves in their ornaments 1, their daggers, their garlands, their golden chains, their rings, going 2 on their chariots and on dry land.",
   "05.053.05": "O Maruts, givers of quickening rain, I am made to rejoice, following after your chariots, as after days 1 going with rain.",
   "05.053.06": "The bucket which the bounteous heroes shook down from heaven for their worshipper, that cloud they send 1 along heaven and earth, and showers follow on the dry land.",
   "05.053.07": "The rivers having pierced 1 the air with a rush of water, went forth like milk-cows; when your spotted deer roll about 2 like horses that have hasted to the resting-place on their road.",
   "05.053.08": "Come hither, O Maruts, from heaven, from the sky, even from near 1; do not go far away!",
   "05.053.09": "Let not the Rasâ, the Anitabhâ, the Kubhâ, the Krumu, let not the Sindhu delay you! Let not the marshy Sarayu prevent you! May your favour be with us alone!",
   "05.053.10": "The showers come forth after the host of your chariots, after the terrible Marut-host of the ever-youthful heroes 1.",
   "05.053.11": "Let us then follow with our praises and our prayers each host of yours, each troop, each company 1.",
   "05.053.12": "To what well-born generous worshipper have the Maruts gone to-day on that march,",
   "05.053.13": "On which you bring to kith and kin the never-failing seed of corn? Give us that for which we ask you, wealth and everlasting happiness!",
   "05.053.14": "Let us safely pass through our revilers, leaving behind the unspeakable and the enemies. Let us be with you when in the morning 1 you shower down health, wealth 2, water, and medicine, O Maruts!",
   "05.053.15": "That mortal, O men, O Maruts, whom you protect, may well be always beloved by the gods, and rich in valiant offspring. May we be such!",
   "05.053.16": "Praise the liberal Maruts, and may they delight on the path of this man here who praises them, like cows in fodder. When they go, call after them as for old friends, praise them who love you, with your song!",
   "05.054.01": "You have fashioned 1 this speech for the brilliant Marut-host which shakes the mountains: celebrate then the great manhood in honour of that host who praises the warm milk (of the sacrifice), and sacrifices on the height of heaven 2, whose glory is brilliant.",
   "05.054.02": "O Maruts, your powerful men (came) forth searching for water, invigorating, harnessing their horses, swarming around. When they aim with the lightning, Trita shouts, and the waters murmur, running around on their course.",
   "05.054.03": "These Maruts are men brilliant with lightning, they shoot with thunderbolts, they blaze with the wind, they shake the mountains, and suddenly, when wishing to give water 1, they whirl the hail; they have thundering strength, they are robust, they are ever-powerful.",
   "05.054.04": "When you drive forth 1 the nights, O Rudras, the days, O powerful men, the sky, the mists, ye shakers, the plains, like ships, and the strongholds, O Maruts, you suffer nowhere.",
   "05.054.05": "That strength of yours, O Maruts, that greatness extended far as the sun extends its daily course, when you, like your deer on their march, went down to the (western) mountain with untouched splendour 1",
   "05.054.06": "Your host, O Maruts, shone forth when, O sages, you strip, like a caterpillar, the waving tree 1 Conduct then, O friends, our service 2 to a good end, as the eye conducts the man in walking.",
   "05.054.07": "That man, O Maruts, is not overpowered, he is not killed, he does not fail, he does not shake, he does not drop, his goods do not perish, nor his protections, if you lead him rightly, whether he be a seer or a king.",
   "05.054.08": "The men with their steeds, like conquerors of clans, like Aryaman (Mitra and Varuna) 1, the Maruts, carrying waterskins 2, fill the well; when the strong ones roar, they moisten the earth with the juice of sweetness 3.",
   "05.054.09": "When the Maruts come forth this earth bows, the heaven bows, the paths in the sky bow, and the cloud-mountains with their quickening rain.",
   "05.054.10": "When you rejoice at sunrise, O Maruts, toiling together 1, men of Svar (sun-light), men of Dyu (heaven), your horses never tire in running, and you quickly reach the end of your journey.",
   "05.054.11": "On your shoulders are the spears, on your feet rings, on your chests golden chains, O Maruts, on your chariot gems; fiery lightnings in your fists, and golden headbands tied round your heads 1.",
   "05.054.12": "O Maruts, you shake the red apple 1 from the firmament, whose splendour no enemy 2 can touch; the hamlets bowed when the Maruts blazed, and the pious people (the Maruts) intoned their far-reaching shout.",
   "05.054.13": "O wise Maruts, let us carry off 1 the wealth of food which you have bestowed on us; give us 2, O Maruts, such thousandfold wealth as never fails 3, like the star Tishya 4 from heaven!",
   "05.054.14": "O Maruts, you protect our wealth of excellent men, and the seer, clever in song; you give to Bharata (the warrior) 1 a strong horse 2, you make the king to be obeyed 3.",
   "05.054.15": "O you who are quickly ready to help, I implore you for wealth whereby we may overshadow all men, like the sky. O Maruts, be pleased with this word of mine, and let us speed by its speed over a hundred winters!",
   "05.055.01": "The chasing 1 Maruts with gleaming spears, the golden-breasted, have gained great strength, they move along on quick well-broken horses;—when they went in triumph, the chariots followed.",
   "05.055.02": "You have yourselves, you know, acquired power; you shine bright and wide, you great ones. They have even measured the sky with their strength;—when they went in triumph, the chariots followed.",
   "05.055.03": "The strong heroes, born together, and nourished together, have further grown to real beauty. They shine brilliantly like the rays of the sun;—when they went in triumph, the chariots followed.",
   "05.055.04": "Your greatness, O Maruts, is to be honoured, it is to be yearned for like the sight of the sun. Place us also in immortality;—when they went in triumph, the chariots followed.",
   "05.055.05": "O Maruts you raise 1 the rain from the sea, and rain it down, O yeomen 2! Your milch-cows, O destroyers 3, are never destroyed;—when they went in triumph, the chariots followed.",
   "05.055.06": "When you have joined the deer as horses 1 to the shafts, and have clothed yourselves in golden garments, then, O Maruts, you scatter all enemies;—when they went in triumph, the chariots followed.",
   "05.055.07": "Not mountains, not rivers have kept you back, wherever you see, O Maruts, there you go. You go even round heaven and earth;—when they went in triumph, the chariots followed.",
   "05.055.08": "Be it old, O Maruts, or be it new, be it spoken, O Vasus, or be it recited, you take cognisance of it all;—when they went in triumph, the chariots followed.",
   "05.055.09": "Have mercy on us, O Maruts, do not strike us, extend to us your manifold protection. Do remember the praise, the friendship;—when they went in triumph, the chariots followed.",
   "05.055.10": "Lead us, O Maruts, towards greater wealth, and out of tribulations, when you have been praised. O worshipful Maruts, accept our offering, and let us be lords of treasures!",
   "05.056.01": "O Agni, on to the strong host (of the Maruts), bedecked with golden chains and ornaments 1. Today I call the folk of the Maruts down from the light of heaven.",
   "05.056.02": "As thou (Agni) thinkest in thine heart, to the same object my wishes have gone. Strengthen thou these Maruts, terrible to behold, who have come nearest to thy invocations.",
   "05.056.03": "Like a bountiful lady 1, the earth comes towards us, staggering, yet rejoicing; for your onslaught, O Maruts, is vigorous, like a bear, and fearful, like a wild bull.",
   "05.056.04": "They who by their strength disperse wildly 1 like bulls, impatient of the yoke, they by their marches make the heavenly stone, the rocky mountain (cloud) 2 to shake.",
   "05.056.05": "Arise, for now I call with my hymns 1 the troop of these Maruts, grown strong together, the manifold, the incomparable, as if calling a drove of bulls.",
   "05.056.06": "Harness the red mares to the chariot, harness the ruddy horses to the chariots, harness the two bays, ready to drive in the yoke, most vehement to drive in the yoke.",
   "05.056.07": "And this red stallion too, loudly neighing, has been placed here, beautiful to behold; may it not cause you delay on your marches, O Maruts; spur him forth on your chariots.",
   "05.056.08": "We call towards us the glorious chariot of the Maruts, whereon there stands also Rodasî 1, carrying delightful gifts, among the Maruts.",
   "05.056.09": "I call hither this your host, brilliant on chariots, terrible and glorious, among which she, the wellborn and fortunate, the bounteous lady, is also magnified among the Maruts.",
   "05.057.01": "O Rudras, joined by Indra, friends on golden chariots, come hither for our welfare! This prayer from us is acceptable to you like the springs of heaven to a thirsty soul longing for water.",
   "05.057.02": "O you sons of Prisni, you are armed with daggers and spears, you are wise, carrying good bows and arrows and quivers, possessed of good horses and chariots. With your good weapons, O Maruts, you go to triumph!",
   "05.057.03": "You shake 1 the sky and the mountains (clouds) for wealth to the liberal giver; the forests bend down out of your way from fear 2. O sons of Prisni, you rouse the earth when you, O terrible ones, have harnessed the spotted deer for triumph!",
   "05.057.04": "The Maruts, blazing with the wind, clothed in rain, are as like one another as twins, and well adorned. They have tawny horses, and red horses, they are faultless, endowed with exceeding vigour; they are in greatness wide as the heaven.",
   "05.057.05": "Rich in rain-drops, well adorned, bounteous, terrible to behold, of inexhaustible wealth, noble by birth, golden-breasted, these singers of the sky 1 have obtained their immortal name 2.",
   "05.057.06": "Spears are on your two shoulders, in your arms are placed strength, power, and might. Manly thoughts dwell in your heads, on your chariots are weapons, and every beauty has been laid on your bodies.",
   "05.057.07": "O Maruts, you have given us wealth of cows, horses, chariots, and heroes, golden wealth! O men of Rudra, bestow on us great praise, and may I enjoy your divine protection!",
   "05.057.08": "Hark, O heroes, O Maruts! Be gracious to us! You who are of great bounty, immortal, righteous, truly listening to us, poets, young, dwelling on mighty mountains 1, and grown mighty.",
   "05.058.01": "I praise 1 now the powerful company of these ever-young Maruts, who drive violently along with quick horses; aye, the sovereigns are lords of Amrita (the immortal).",
   "05.058.02": "The terrible company, the powerful, adorned with quoits on their hands, given to roaring, potent, dispensing treasures, they who are beneficent, infinite in greatness, praise, O poet, these men of great wealth!",
   "05.058.03": "May your water-carriers come here to-day, all the Maruts who stir up the rain. That fire which has been lighted for you, O Maruts, accept it, O young singers",
   "05.058.04": "O worshipful Maruts, you create for man an active king, fashioned by Vibhvan 1; from you comes the man who can fight with his fist, and is quick with his arm, from you the man with good horses and valiant heroes.",
   "05.058.05": "Like the spokes of a wheel, no one is last, like the days they are born on and on, not deficient in might. The very high sons of Prisni are full of fury, the Marut cling firmly to their own will 1.",
   "05.058.06": "When you have come forth with your speckled deer as horses 1 on strong-fellied chariots, O Maruts, the waters gush, the forests go asunder 2;—let Dyu 3 (Sky) roar down, the bull of the Dawn.",
   "05.058.07": "At their approach, even the earth opened wide, and they placed (sowed) their own 1 strength (the rain), as a husband the germ. Indeed they have harnessed the winds as horses to the yoke, and the men of Rudra have changed their sweat into rain.",
   "05.058.08": "Hark, O heroes, O Maruts! Be gracious to us! You who are of great bounty, immortal, righteous, truly listening to us, poets, young, dwelling on mighty mountains, and grown mighty.",
   "05.059.01": "They truly 1 tried to make you grant them welfare. Do thou sing 2 praises to Heaven (Dyu), I offer sacrifice (rita) to the Earth. The Maruts wash their horses and race to the air, they soften their splendour by waving mists.",
   "05.059.02": "The earth trembles with fear from their onset. She sways like a full ship, that goes rolling 1. The heroes who appear on their marches, visible from afar, strive together within the great (sacrificial) assembly 2.",
   "05.059.03": "Your horn is exalted for glory 1, as the horns of cows; your eye is like the sun 2, when the mist is scattered. Like strong racers, you are beautiful, O heroes, you think of glory, like manly youths 3.",
   "05.059.04": "Who could reach, O Maruts, the great wise thoughts, who the great manly deeds of you, great ones? You shake the earth like a speck of dust, when you are carried forth for granting welfare.",
   "05.059.05": "These kinsmen 1 (the Maruts) are like red horses, like heroes eager for battle, and they have rushed forward to fight. They are like well-grown manly youths, and the men have grown strong, with streams of rain they dim the eye of the sun.",
   "05.059.06": "At their outbreak there is none among them who is the eldest, or the youngest, or the middle: they have grown by their own might, these sons of Prisni, noble by birth, the boys of Dyaus; come hither to us!",
   "05.059.07": "Those who like birds flew with strength in rows 1 from the ridge of the mighty heaven to its ends, their horses shook the springs 2 of the mountain (cloud) so that people on both sides 3 knew it.",
   "05.059.08": "May 1 Dyaus Aditi (the unbounded) 2 roar for our feast, may the dew-lighted Dawns come striving together; these, the Maruts, O poet, (the sons) of Rudra, have shaken the heavenly bucket (cloud), when they had been praised.",
   "05.060.01": "I implore 1 Agni, the gracious, with salutations, may he sit down here, and gather what we have made 2. I offer 3 (him sacrifice) as with racing chariots; may I, turning to the right, accomplish this hymn to the Maruts.",
   "05.060.02": "Those who approached on their glorious deer, on their easy chariots, the Rudras, the Maruts,—through fear of you, ye terrible ones, the forests even bend down, the earth shakes, and also the mountain (cloud).",
   "05.060.03": "At your shouting, even the mountain (cloud), grown large, fears, and the ridge of heaven trembles. When you play together, O Maruts, armed with spears, you run together like waters.",
   "05.060.04": "Like rich suitors the Maruts have themselves 1 adorned their bodies with golden ornaments; more",
   "05.060.05": "As brothers, no one being the eldest or the youngest, they have grown up together to happiness. Young is their clever father Rudra, flowing with plenty is Prisni (their mother), always kind to the Maruts.",
   "05.060.06": "O happy Maruts, whether you are in the highest, or in the middle, or in the lowest heaven, from thence, O Rudras, or thou also, O Agni. take notice of this libation which we offer.",
   "05.060.07": "When Agni, and you, wealthy Maruts, drive down from the higher heaven over the ridges, give then, if pleased, you roarers, O destroyers of enemies 1, wealth to the sacrificer who prepares (Soma juice).",
   "05.060.08": "Agni, be pleased to drink Soma with the brilliant Maruts, the singers, approaching in companies 1, with the men (Âyus 2), who brighten and enliven everything; do this, O Vaisvânara (Agni), thou who art always endowed with splendour.",
   "05.061.01": "Who are you, O men, the very best, who have approached one by one, from the furthest distance 1?",
   "05.061.02": "Where are your horses, where the bridles? How could you, how did you come?—the seat on the back, the rein in the nostrils?",
   "05.061.03": "Their goad is on the croup 1, the heroes stretched their legs apart 2…",
   "05.061.04": "Move along, heroes, young men, the sons of an excellent mother 1, so that you may warm yourselves at our fire 2.",
   "05.061.05": "(1.) May the woman, if she stretched out her arm 1 as a rest for the hero, praised by Syâvâsva 2, gain cattle consisting of horses, cows, and a hundred sheep.",
   "05.061.06": "(2.) Many a woman is even more often kindlier than a godless and miserly man,",
   "05.061.07": "(3.) A woman who finds out the weak, the thirsty, the needy, and is mindful of the gods.",
   "05.061.08": "(4.) Even though many an unpraiseworthy miser (Pani) is called a man, she is worth as much in weregild.",
   "05.061.09": "(5.) Also the young woman joyfully whispered to me, to Syâva, the road,—and the two bays went straight to Purumîlha 1, the wise, the far-famed,",
   "05.061.10": "(6.) Who gave me a hundred cows, like Vaidadasvi, like Taranta, in magnificence.",
   "05.061.11": "(1.) The Maruts, who drive on their quick horses, drinking the delightful mead, have gained glory here;",
   "05.061.12": "(2.) They on whose chariots Rodasî 1 glitters in glory 2, like the golden disk above in heaven;",
   "05.061.13": "(3.) That youthful company of the Maruts, with blazing chariots, blameless, triumphant, irresistible.",
   "05.061.14": "(4.) Who now knows of them where the strikers rejoice, the well-born, the faultless?",
   "05.061.15": "(5.) You who are fond of praise, become the leaders of the mortal, listening to his imploring invocations, thus is my thought 1.",
   "05.061.16": "(6.) Bring then to us delightful and resplendent 1 treasures, ye worshipful Maruts, destroyers of enemies.",
   "05.061.17": "(1.) O night, like a charioteer, carry away this hymn to Dârbhya, and these songs, O goddess.",
   "05.061.18": "(2.) And then tell him thus from me, 'When Rathavîti offers Soma, my desire never goes away from me.'",
   "05.061.19": "(3.) That mighty Rathavîti dwells among people rich in cattle 1, retired among the mountains.",
   "05.087.01": "Let your voice-born 1 prayers go forth to the great Vishnu, accompanied by the Maruts, Evayâmarut, and to the chasing host, adorned with good rings, the strong, in their jubilant throng, to the shouting power (of the Maruts).",
   "05.087.02": "O Maruts, you who are born great, and proclaim it yourselves by knowledge, Evayâmarut, that power of yours cannot be approached by wisdom, that (power) of theirs (cannot be approached) by gift or might 1; they are like unapproachable mountains.",
   "05.087.03": "They who are heard with their voice from the high heaven, the brilliant and strong, Evayâmarut, in whose council no tyrant 1 reigns, the rushing chariots 2 of these roaring Maruts come forth 3, like fires with their own lightning.",
   "05.087.04": "The wide-striding (Vishnu) 1 strode forth from the great common seat, Evayâmarut. When he has started by himself from his own place along the ridges, O ye striving, mighty 2 Maruts, he goes together with the heroes (the Maruts), conferring blessings.",
   "05.087.05": "Impetuous, like your own shout, the strong one (Vishnu) made everything tremble, the terrible, the wanderer 1, the mighty, Evayâmarut; strong with him you advanced self-luminous, with firm reins, golden coloured, well-armed 2, speeding along.",
   "05.087.06": "Your greatness is infinite, ye Maruts, endowed with full power, may that terrible power help, Evayâmarut. In your raid 1 you are indeed to be seen as charioteers; deliver us therefore from the enemy, like shining fires.",
   "05.087.07": "May then these Rudras, lively like fires and with vigorous shine, help, Evayâmarut. The seat of the earth is stretched out far and wide 1, when the hosts of these faultless Maruts come quickly to the races.",
   "05.087.08": "Come kindly on your path, O Maruts, listen to the call of him who praises you, Evayâmarut. Confidants of the great Vishnu, may you together, like charioteers, keep all hateful things far 1, by your wonderful skill.",
   "05.087.09": "Come zealously 1 to our sacrifice, ye worshipful, hear our guileless call, Evayâmarut. Like the oldest mountains in the sky, O wise guardians, prove yourselves for him irresistible to the enemy.",
   "06.066.01": "This may well be a marvel, even to an intelligent man, that anything should have taken the same name dhenu, cow:—the one is always brimming to give milk among men, but Prisni (the cloud, the mother of the Maruts) poured out her bright udder once (only).",
   "06.066.02": "The Maruts who shone like kindled fires, as they grew stronger twice and thrice,—their golden, dustless (chariots 1) became full of manly courage and strength.",
   "06.066.03": "They who 1 are the sons of the bounteous Rudra, and whom she indeed was strong enough to bear; for she, the great, is known as the mother of the great, that very Prisni conceived the germ for the strong one (Rudra).",
   "06.066.04": "They who do not shrink from being born in this way 1, and who within (the womb) clean themselves from all impurity 2, when they have been brought forth brilliant, according to their pleasure, they sprinkle their bodies with splendour.",
   "06.066.05": "Among them there is no one who does not strive to be brought forth quickly; and they assume the defiant name of Maruts. They who are not (unkind 1), never tiring in strength 2, will the generous sacrificer be able to bring down these fierce ones?",
   "06.066.06": "Fierce in strength, followed by daring armies, these Maruts have brought together heaven and earth 1, both firmly established 2; then the self-shining Rodasî stood among the impetuous Maruts, like 3 a light.",
   "06.066.07": "Even though your carriage, O Maruts, be without your deer 1, without horse's, and not driven by any charioteer, without drag 2, and without reins, yet, crossing the air 3, it passes between heaven and earth, finishing its courses.",
   "06.066.08": "No one can stop, no one can overcome him whom you, O Maruts, protect in battle. He whom you protect in his kith, his cattle, his kin, and his waters, he breaks the stronghold at the close of the day 1.",
   "06.066.09": "Offer a beautiful song to the host of the Maruts, the singers, the quick, the strong, who resist violence with violence; O Agni, the earth trembles before the champions.",
   "06.066.10": "Blazing like the flame of the sacrifices, flickering like the tongues of the fire, shouters, like roaring fighters, the flame-born Maruts are unassailable.",
   "06.066.11": "I invite with my call this strong and Marut-like son of Rudra 1, armed with flaming spears. Bright thoughts, like wild waters from the mountain 2, strove to reach the host of heaven.",
   "07.056.01": "Who are these resplendent men, dwelling together, the boys of Rudra, also 1 with good horses?",
   "07.056.02": "No one indeed knows their births, they alone know each other's birthplace.",
   "07.056.03": "They plucked each other with their beaks 1; the hawks, rushing like the wind, strove together.",
   "07.056.04": "A wise man understands these secrets 1, that Prisni, the great, bore an udder.",
   "07.056.05": "May that clan be rich in heroes by the Maruts, always victorious, rich in manhood!",
   "07.056.06": "They are quickest to go, most splendid with splendour, endowed with beauty, strong with strength.",
   "07.056.07": "Strong is your strength, steadfast your powers, and thus by the Maruts is this clan mighty.",
   "07.056.08": "Resplendent is your breath, furious are the minds of the wild host, like a shouting maniac 1.",
   "07.056.09": "Keep from us entirely your flame, let not your hatred reach us here.",
   "07.056.10": "I call on the dear names of your swift ones, so that the greedy should be satisfied 1, O Maruts,",
   "07.056.11": "The well-armed, the swift, decked with beautiful chains, who themselves adorn their bodies.",
   "07.056.12": "Bright are the libations for you, the bright ones, O Maruts, a bright sacrifice I prepare for the bright. In proper order came those who truly follow the order, the bright born, the bright, the pure.",
   "07.056.13": "On your shoulders, O Maruts, are the rings, on your chests the golden chains are fastened; far-shining like lightnings with showers 1, you wield your weapons, according to your wont.",
   "07.056.14": "Your hidden 1 splendours come forth; spread out your powers (names), O racers! Accept, O Maruts, this thousandfold, domestic share, as an offering for the house-gods 2.",
   "07.056.15": "If you thus listen, O Maruts, to this praise, at the invocation of the powerful sage, give him quickly a share of wealth in plentiful offspring, which no selfish enemy shall be able to hurt.",
   "07.056.16": "The Maruts, who are fleet like racers, the manly youths, shone like Yakshas 1; they are beautiful like boys standing round the hearth, they play about like calves who are still sucking.",
   "07.056.17": "May the bounteous Maruts be gracious to us, opening up to us the firm heaven and earth. May that bolt of yours which kills cattle and men, be far from us! Incline to us, O Vasus, with your favours.",
   "07.056.18": "The Hotri priest calls on you again and again, sitting down and praising your common gift, O Maruts. O strong ones, he who is the guardian of so much wealth, he calls on you with praises, free from guile.",
   "07.056.19": "These Maruts stop the swift, they bend strength by strength 1, they ward off the curse of the plotter, and turn 2 their heavy hatred on the enemy.",
   "07.056.20": "These Maruts stir up even the sluggard 1, even the vagrant 2, as the gods 3 pleased. O strong ones, drive away the darkness, and grant us all our kith and kin.",
   "07.056.21": "May we not fall away from your bounty, O Maruts, may we not stay behind, O charioteers, in the distribution of your gifts. Let us share in the brilliant wealth, the well-acquired, that belongs to you, O strong ones.",
   "07.056.22": "When valiant men fiercely fight together, for rivers, plants, and houses 1, then, O Maruts, sons of Rudra, be in battles our protectors from the enemy.",
   "07.056.23": "O Maruts, you have valued 1 the praises which our fathers have formerly recited to you; with the Maruts the victor is terrible in battle, with the Maruts alone the racer wins the prize.",
   "07.056.24": "O Maruts, may we have a strong son, who is lord among men, a ruler, through whom we may cross the waters to dwell in safety, and then obtain our own home for you 1.",
   "07.056.25": "May Indra then, Varuna, Mitra, Agni, the waters, the plants, the trees of the forest be pleased with us. Let us be in the keeping, in the lap of the Maruts; protect us always with your favours.",
   "07.057.01": "O ye worshipful, your company of Maruts is fond of honey, they who delight in their strength at the sacrifices, the Maruts, who shake even the wide heaven and earth, and fill the well, when they move about, the terrible ones.",
   "07.057.02": "Truly the Maruts find out the man who praises them, and guide the thoughts of the sacrificer. Sit down then to rejoice to-day, on the altar 1 in our assemblies 2 well pleased.",
   "07.057.03": "Others do not shine so much as these Maruts with their golden chains, their weapons, and their own bodies; the all-adorned, adorning heaven and earth, brighten themselves with the same brightness, when starting for triumph.",
   "07.057.04": "May your shining thunderbolt be far from us, O Maruts, whatever sin we may commit against you, men as we are: O worshipful, let us not fall under 1 its power, let your best favour rest on us.",
   "07.057.05": "May the Maruts be pleased with whatever little we have done here, they the faultless, the bright, the pure. Protect us, ye worshipful, with your favours, lead us to prosperity through booty.",
   "07.057.06": "And let the manly Maruts, when they have been praised, under whatever names, enjoy these offerings! Grant that our offspring may not die 1, raise up for us riches 2, glory, and wealth.",
   "07.057.07": "O Maruts, when you have thus been praised, come all together with help towards our lords who with their hundredfold wealth freely prosper us;—protect us always with your favours!",
   "07.058.01": "Sing to the company (of the Maruts), growing up together, the strong among the divine host 1: they stir heaven and earth by their might, they mount up to the firmament from the abyss of Nirriti 2.",
   "07.058.02": "Even your birth 1 was with fire and fury, O Maruts! You, terrible, wrathful, never tiring! You who stand forth with might and strength; every one who sees the sun 2, fears at your coming.",
   "07.058.03": "Grant mighty strength to our lords, if the Maruts are pleased with our praise. As a trodden path furthers a man, may they further us; help us with your brilliant favours.",
   "07.058.04": "Favoured by you, O Maruts, a wise man wins a hundred, favoured by you a strong racer wins a thousand, favoured by you a king also kills his enemy: may that gift of yours prevail, O ye shakers.",
   "07.058.05": "I invite these bounteous sons of Rudra 1, will these Maruts turn again to us? Whatever they hated secretly or openly, that sin we pray the swift ones to forgive.",
   "07.058.06": "This praise of our lords has been spoken: may the Maruts be pleased with this hymn. Keep far from us, O strong ones, all hatred, protect us always with your favours!",
   "07.059.01": "Whom you protect again and again, O gods, and whom you lead, to him, O Agni, Varuna, Mitra, Aryaman, and Maruts, yield your protection.",
   "07.059.02": "He who sacrifices, O gods, overcomes his enemies by your protection on a happy day. He who gives to your delight, spreads forth his dwelling, spreads out much food.",
   "07.059.03": "This Vasishtha will not despise even the last among you, O Maruts; drink 1 all of you, to-day, at my libation here, full of desire.",
   "07.059.04": "Your help does not indeed fail that man in battle to whom you granted it, O men! Your newest favour has turned hither, come quick then, ye who wish to drink.",
   "07.059.05": "O ye whose gifts are cheering, come to drink the (juice of the Soma) flowers: these are your libations, O Maruts, for I gave them to you, do not go elsewhere!",
   "07.059.06": "Sit down on our altar and protect 1 us, to give us brilliant riches. O Maruts, who never miss the ^",
   "07.059.07": "Having adorned their bodies, the swans with dark blue backs came flying in secret 1—the whole flock sat down all around me, like gay men, delighting in the Soma offering.",
   "07.059.08": "O Maruts, that hateful man who beyond our thoughts tries to hurt us, O Vasus, may he catch the snares of Drub, kill him with your hottest bolt!",
   "07.059.09": "O you Maruts, full of heat, here is the libation; be pleased to accept it, O you who destroy the enemies by your help 1.",
   "07.059.10": "O you who accept the domestic sacrifices 1, come hither, O Maruts, do not keep away, you who are bounteous by your help 2.",
   "07.059.11": "O Maruts, strong and wise, with sun-bright skins, I choose the sacrifice for you here and there 1",
   "07.059.12": "We sacrifice to Tryambaka 1, the sweet-scented, wealth-increasing (Rudra). May I be detached from death, like a gourd from its stem, but not 2 from the immortal 3.",
   "08.007.01": "When the sage has poured out the threefold 1 draught to you, O Maruts, then you shine forth in the mountains (clouds).",
   "08.007.02": "Aye, when, O bright Maruts, growing in strength, you have seen your way, then the mountains (clouds) have gone down 1.",
   "08.007.03": "The sons of Prisni, the bulls, have risen together with the winds, they have drawn forth the swelling draught.",
   "08.007.04": "The Maruts sow the mist, they shake the mountains (clouds), when they go their way with the winds,",
   "08.007.05": "When the mountain bent down before your march, the rivers before your rule, before your great power (blast).",
   "08.007.06": "We invoke you by night for our protection, you by day, you while the sacrifice proceeds.",
   "08.007.07": "And they rise up on their courses, the beautiful, of reddish hue 1, the bulls, above the ridge of the sky.",
   "08.007.08": "With might they send forth a ray of light, that the sun may have a path to walk 1: they have spread far and wide with their lights.",
   "08.007.09": "Accept, O Maruts, this my speech, this hymn of praise, O Ribhukshans 1, this my call.",
   "08.007.10": "The Prisnis 1 (the clouds) yielded three lakes (from their udders) as mead for the wielder of the thunderbolt (Indra), the well, the water-skin, the watering-pot 2.",
   "08.007.11": "O Maruts, whenever we call you from heaven, wishing for your favour, come hither towards us.",
   "08.007.12": "For you are bounteous 1, in our house, O Rudras, Ribhukshans: you are attentive, when you enjoy (the libations).",
   "08.007.13": "O Maruts, bring to us from heaven enrapturing wealth, which nourishes many, which satisfies all.",
   "08.007.14": "When you have seen your way, brilliant Maruts, as it were from above 1 the mountains, you rejoice in the (Soma) drops which have been pressed out.",
   "08.007.15": "Let the mortal with his prayers ask the favour of that immense, unconquerable (host) 1 of them,",
   "08.007.16": "Who like torrents 1 foam along heaven and earth with their streams of rain, drawing the inexhaustible well.",
   "08.007.17": "These sons of Prisni rise up together with rattlings, with chariots, with the winds, and with songs of praise.",
   "08.007.18": "That (help) with which you helped Turvasa, Yadu, and Kanva when he carried off riches, that we pray for, greatly for our wealth.",
   "08.007.19": "O bounteous Maruts, may these draughts, swelling like butter, strengthen you, together with the prayers of Kânva.",
   "08.007.20": "Where do you rejoice now, O bounteous Maruts, when an altar has been prepared for you? What priest serves you?",
   "08.007.21": "For you for whom we have prepared an altar, do not, as it was with you formerly, in return for these praises, gladden the companies of our sacrifice.",
   "08.007.22": "These Maruts have brought together piece by piece 1 the great waters, heaven and earth, the sun, and the thunderbolt;",
   "08.007.23": "And, while performing their manly work, they have trodden Vritra to pieces, and the dark mountains (clouds).",
   "08.007.24": "They protected the strength and intelligence of the fighting Trita, they protected Indra in his struggle with Vritra.",
   "08.007.25": "Holding lightnings in their hands, they hasten heavenward, golden helmets 1 are on their head; the brilliant Maruts have adorned themselves for beauty.",
   "08.007.26": "When with Usanâ 2 you have come from afar to Ukshnorandhra (ox-hollow) 1, he roared from fear, like Dyu (the sky).",
   "08.007.27": "O gods, come to us with your golden-hoofed horses, for the offering of the sacrifice 1.",
   "08.007.28": "When the red leader leads their spotted deer in their chariot, the brilliant Maruts approach and let the waters run.",
   "08.007.29": "The heroes went downwards to Saryanâvat, to Sushoma, to Ârgîka, to Pastyâvat.",
   "08.007.30": "When will you come hither, O Maruts, to the sage who calls you so, with your consolations to the suppliant?",
   "08.007.31": "What then now? Where are your friends, now that you have forsaken Indra? Who is counted in your friendship?",
   "08.007.32": "O Kânvas, I praise Agni, together with our Maruts, who carry the thunderbolt in their hands, and are armed with golden daggers.",
   "08.007.33": "Might I succeed in bringing hither the strong hunters, hither with their splendid booty for the newest blessings.",
   "08.007.34": "The hills even sink low, as if they thought themselves valleys, the mountains even bow themselves down.",
   "08.007.35": "The crossing (horses) bring them hither, flying through the air; they bestow strength on the man who praises them.",
   "08.007.36": "The old fire 1 has been born, like the shine 2 by the splendour of the sun, and the Maruts have spread far and wide with their lights.",
   "08.020.01": "Come hither, do not fail, when you march forward! Do not stay away, O united friends, you who can bend even what is firm.",
   "08.020.02": "O Maruts, Ribhukshans, come hither on your flaming strong fellies 1, O Rudras, come to us to-day with food, you much-desired ones, come to the sacrifice, you friends of the Sobharis 2.",
   "08.020.03": "For we know indeed the terrible strength of the sons of Rudra, of the vigorous Maruts, the liberal givers 1 of Soma 2 (rain).",
   "08.020.04": "The islands (clouds) were scattered, but the monster remained 1, heaven and earth were joined together. O you who are armed with bright rings, the tracts (of the sky) 2 expanded, whenever you stir, radiant with your own splendour.",
   "08.020.05": "Even things that cannot be thrown down resound at your race, the mountains, the lord of the forest,—the earth quivers on your marches.",
   "08.020.06": "The upper sky makes wide room, to let your violence pass, O Maruts, when these strong-armed heroes display their energies in their own bodies.",
   "08.020.07": "According to their wont these men, exceeding terrible, impetuous, with strong and unbending forms 1, bring with them beautiful light 2.",
   "08.020.08": "The arrow of the Sobharis is shot from the bowstrings at the golden chest on the chariot of the Maruts 1. They, the kindred of the cow (Prisni), the well-born, should enjoy their food, the great ones should help us.",
   "08.020.09": "Bring forward, O strongly-anointed 1 (priests), your libations to the strong host of the Maruts, the strongly advancing.",
   "08.020.10": "O Maruts, O heroes, come quickly hither, like winged hawks, on your chariot with strong horses, of strong shape, with strong naves, to enjoy our libations.",
   "08.020.11": "Their anointing is the same, the golden chains shine on their arms, their spears sparkle.",
   "08.020.12": "These strong, manly, strong-armed Maruts, do not strive among themselves; firm are the bows, the weapons on your chariot, and on your faces are splendours.",
   "08.020.13": "They whose terrible name 1, wide-spreading like the ocean, is the one of all that is of use, whose strength is like the vigour of their father,",
   "08.020.14": "Worship these Maruts, and praise them! Of these shouters, as of moving spokes 1, no one is the last; this is theirs by gift, by greatness 2 is it theirs.",
   "08.020.15": "Happy is he who was under your protection, O Maruts, in former mornings, or who may be so even now.",
   "08.020.16": "Or he, O men, whose libations you went to enjoy; that mighty one, O shakers, will obtain your favours with brilliant riches and booty.",
   "08.020.17": "As the sons of Rudra, the servants of the divine Dyu 1, win it, O youths, so shall it be.",
   "08.020.18": "Whatever liberal givers may worship 1 the Maruts, and move about together as generous 2 benefactors, even from them turn 3 towards us with a kinder heart, you youths",
   "08.020.19": "O Sobhari, call loud with your newest song the young, strong, and pure Maruts, as the plougher calls the cows.",
   "08.020.20": "Worship the Maruts with a song, they who are strong like a boxer, called in to assist those who call 1 for him in all fights; (worship them) the most glorious, like bright-shining bulls.",
   "08.020.21": "Yes, O united friends, kindred, O Maruts, by a common birth, the oxen lick one another's humps 1.",
   "08.020.22": "O ye dancers, with golden ornaments on your chests, even a mortal comes (to ask) for your brotherhood 1; take care of us, ye Maruts, for your friendship lasts for ever.",
   "08.020.23": "O bounteous Maruts, bring us some of your Marut-medicine, you friends, and (quick, like) steeds.",
   "08.020.24": "With the favours whereby you favour the Sindhu, whereby you save, whereby you help Krivi 1, with those propitious favours be our delight, O delightful ones, ye who never hate your followers 2.",
   "08.020.25": "O Maruts, for whom we have prepared good altars, whatever medicine 1 there is on the Sindhu, on the Asiknî, in the seas, on the mountains,",
   "08.020.26": "Seeing it, you carry it all on your bodies. Bless us with it! Down to the earth, O Maruts 1, what hurts our sick one,—straighten what is crooked!",
   "08.094.01": "The cow, wishing for glory, the mother of the bounteous Maruts, sends forth her milk; the two horses 1 have been harnessed to the chariots,—",
   "08.094.02": "She in whose lap 1 all gods observe their duties, sun and moon (also), that they may be seen;",
   "08.094.03": "Therefore all our friends 1, the singers, invite the Maruts always, to drink (our) Soma.",
   "08.094.04": "This Soma here has been prepared, the Maruts drink of it, the Asvins also drink of the lord (Soma) 1.",
   "08.094.05": "Mitra, Aryaman, Varuna drink of the Soma which is continually 1 clarified, dwelling in three abodes 2, procuring offspring.",
   "08.094.06": "May Indra also rejoice to his satisfaction in this pressed juice, mixed with milk, like a Hotri 1 at the morning-sacrifice.",
   "08.094.07": "Did the brilliant lords flare up? Endowed with pure strength they rush, like water, through their enemies.",
   "08.094.08": "Shall I now choose the favour of you, the great gods, who by yourselves shine forth marvellously,",
   "08.094.09": "The Maruts, who, when going to drink Soma, spread out the whole earth and the lights of heaven 1.",
   "08.094.10": "I call now them who are endowed with pure strength, you, O Maruts, from heaven, that you may drink the Soma here;",
   "08.094.11": "I call now those Maruts who hold heaven and earth asunder, that they may drink the Soma here;",
   "08.094.12": "I call now that manly company of the Maruts, dwelling in the mountains, that they may drink the Soma here.",
   "10.077.01": "Let me with my voice shower 1 wealth like cloud-showers 2, like sacrifices of a sage, rich in oblations. I have praised the goodly host of the Maruts 3, so that they may be worthy of a Brahman 4 so that they may be glorious.",
   "10.077.02": "These boys have prepared their ornaments for beauty, the goodly host of the Maruts, through many nights; the sons of Dyu struggled, like harts, they, the Âdityas, grew high, like banners 1.",
   "10.077.03": "They who by their own might seem to have risen above heaven and earth, like the sun above the cloud, they are glorious, like brilliant heroes, they shine forth like foe-destroying youths.",
   "10.077.04": "When you move along on the bottom of the waters, the earth seems to break and to melt 1. This perfect sacrifice is meet for you, come hither together, as if enjoying our offerings.",
   "10.077.05": "You are as drivers 1 on the poles with their reins, and as brilliant with light at daybreak; like hawks, you are famous destroyers of foes; like wells 2 springing forth, you scatter moisture.",
   "10.077.06": "When you, O Maruts, come from afar, knowing the great treasure of the hidden place, O Vasus, the treasure which has to be gained, then keep away also from afar all who hate us.",
   "10.077.07": "The man who, firm in his sacrifice, offers gifts to the Maruts to the end of the ceremony 1, he gains health and wealth, blessed with offspring; he shall also be in the keeping of the gods.",
   "10.077.08": "They are indeed our guardians, to be worshipped at all sacrifices, most blissful by their name of Âdityas; may they, swiftly driving on their chariots, protect our prayer, quick even on their march, delighting in our sacrifice.",
   "10.078.01": "Full of devotion like priests with their prayers, wealthy like pious men, who please the gods with their offerings, beautiful to behold like brilliant kings, without a blemish like the youths of our hamlets—",
   "10.078.02": "They who are gold-breasted like Agni with his splendour, quick to help like self-harnessed winds, good leaders like the oldest experts, they are to the righteous man like Somas, that yield the best protection.",
   "10.078.03": "They who are roaring and hasting like winds, brilliant like the tongues of fires, powerful like mailed soldiers, full of blessings like the prayers of our fathers,",
   "10.078.04": "Who hold together like the spokes of chariot-wheels, who glance forward like victorious heroes, who scatter ghrita 1 like wooing youths, who chant beautifully like singers, intoning a hymn of praise,",
   "10.078.05": "Who are swift like the best of horses, who are bounteous like lords of chariots on a suit, who are hastening on like water with downward floods, who are like the manifold 1 Aṅgiras with their (numerous) songs.",
   "10.078.06": "These noble sons of Sindhu 1 are like grinding-stones, they are always like Soma-stones 2, tearing everything to pieces; these sons of a good mother are like playful children, they are by their glare like a great troop on its march.",
   "10.078.07": "Illumining the sacrifice 1 like the rays of the dawn, they shone forth in their ornaments like triumphant warriors; the Maruts with bright spears seem like running rivers, from afar they measure many miles.",
   "10.078.08": "O gods, make us happy and rich, prospering us, your praisers, O Maruts! Remember our praise and our friendship, for from of old there are always with you gifts of treasures.",
   "01.043.01": "What could we say to Rudra, the wise, the most liberal, the most powerful, that is most welcome to his heart,—",
   "01.043.02": "So that Aditi 1 may bring Rudra's healing to the cattle, to men, to cow, and kith,",
   "01.043.03": "So that Mitra, that Varuna, that Rudra hear us, and all the united Maruts 1.",
   "01.043.04": "We implore Rudra, the lord of songs, the lord of animal sacrifices 1, the possessor of healing medicines 2, for health, wealth 3, and his favour.",
   "01.043.05": "He who shines like the bright sun, and like gold, who is the best Vasu among the gods,",
   "01.043.06": "May he bring health to our horse, welfare to ram and ewe, to men, to women, and to the cow!",
   "01.043.07": "Bestow on us, O Soma, the happiness of a hundred men, great glory of strong manhood 1;",
   "01.043.08": "O Soma 1, let not those who harass and injure overthrow us; O Indu, help us to booty!",
   "01.043.09": "Whatever beings are thine, the immortal, in the highest place of the law, on its summit 1, in its centre, O Soma, cherish them, remember them who honour thee.",
   "01.114.01": "We offer these prayers 1 to Rudra, the strong, whose hair is braided 2, who rules over heroes 3, that he may be a blessing to man and beast, that everything in this our village may be prosperous and free from disease.",
   "01.114.02": "Be gracious to us, O Rudra, and give us joy, and we shall honour thee, the ruler of heroes, with worship. What health and wealth father Manu acquired by his sacrifices, may we obtain the same, O Rudra, under thy guidance.",
   "01.114.03": "O bounteous Rudra, may we by sacrifice obtain the goodwill of thee, the ruler of heroes; come to our clans, well-disposed, and, with unharmed men, we shall offer our libation to thee.",
   "01.114.04": "We call down for our help the fierce Rudra, who fulfils our sacrifice, the swift, the wise; may he drive far away from us the anger of the gods; we desire his goodwill only.",
   "01.114.05": "We call down with worship the red boar of the sky, the god with braided hair, the blazing form; may he who carries in his hand the best medicines grant us protection, shield, and shelter!",
   "01.114.06": "This speech is spoken for the father of the Maruts, sweeter than sweet, a joy 1 to Rudra; grant to us also, O immortal, the food of mortals, be gracious to us and to our kith and kin!",
   "01.114.07": "Do not slay our great or our small ones, our growing or our grown ones, our father or our mother and do not hurt our own 1 bodies, O Rudra!",
   "01.114.08": "O Rudra, hurt us not in our kith and kin, nor in our own life, not in our cows, nor in our horses! Do not slay our men in thy wrath: carrying libations, we call on thee always.",
   "01.114.09": "Like a shepherd 1, I have driven these praises near to thee; O father of the Maruts, grant us thy favour! For thy goodwill is auspicious, and most gracious, hence we desire thy protection alone.",
   "01.114.10": "Let thy cow-slaying and thy man-slaying be far away 1, and let thy favour be with us, O ruler of heroes! Be gracious to us, and bless us, O god, and then give us twofold protection 2.",
   "01.114.11": "We have uttered our supplication to him, desiring his help; may Rudra with the Maruts hear our call. May Mitra, Varuna, Aditi, the River, Earth, and the Sky grant us this!",
   "02.033.01": "O father of the Maruts, let thy favour come near, and do not deprive us of the sight of the sun; may the hero (Rudra) be gracious to our horse 1, and may we increase in offspring, O Rudra!",
   "02.033.02": "May I attain to a hundred winters through the most blissful medicines which thou hast given! Put away far 1 from us all hatred, put away anguish, put away sicknesses in all directions!",
   "02.033.03": "In beauty thou art the most beautiful of all that exists, O Rudra, the strongest of the strong, thou wielder of the thunderbolt! Carry us happily to the other shore of our anguish, and ward off all assaults of mischief 1.",
   "02.033.04": "Let us not incense thee, O Rudra, by our worship, not by bad praise, O hero, and not by divided praise! Raise up our men by thy medicines, for I hear thou art the best of all physicians.",
   "02.033.05": "He who is invoked 1 by invocations and libations, may I pay off 2 that Rudra with my hymns of praise. Let not him who is kind-hearted 3, who readily hears our call, the tawny, with beautiful cheeks, deliver us to this wrath!",
   "02.033.06": "The manly hero with the Maruts has gladdened me, the suppliant, with more vigorous health. May I without mischief find shade, as if from sunshine 1, may I gain the favour of Rudra!",
   "02.033.07": "O Rudra, where is thy softly stroking hand which cures and relieves 1? Thou, the remover of all heaven-sent mischief, wilt thou, O strong hero, bear with me?",
   "02.033.08": "I send forth a great, great hymn of praise to the bright tawny bull. Let me reverence 1 the fiery god 2 with prostrations; we celebrate the flaring name 3 of Rudra.",
   "02.033.09": "He, the fierce god, with strong limbs, assuming many forms, the tawny Rudra, decked himself with brilliant golden ornaments. From Rudra, who is lord of this wide world, divine power 1 will never depart.",
   "02.033.10": "Worthily thou bearest arrows and bow, worthily, O worshipful 1, the golden, variegated chain; worthily thou cuttest every fiend 2 here to pieces, for there is nothing indeed stronger than thou, O Rudra.",
   "02.033.11": "Praise him, the famous, sitting in his chariot 1, the youthful, who is fierce and attacks like a terrible wild beast 2 (the lion). And when thou hast been praised, O Rudra, be gracious to him who magnifies thee, and let thy armies 3 mow down others than us!",
   "02.033.12": "O Rudra, a boy indeed makes obeisance to his father who comes to greet him 1: I praise the lord of brave men, the giver of many gifts, and thou, when thou hast been praised, wilt give us thy medicines.",
   "02.033.13": "O Maruts, those pure medicines of yours, the most beneficent and delightful, O heroes, those which Manu 1, our father, chose, those I crave from Rudra, as health and wealth.",
   "02.033.14": "May the weapon of Rudra avoid us 1, may the great anger of the flaring one pass us by. Unstring thy strong bows 2 for the sake of our liberal lords, O bounteous Rudra, be gracious to our kith and kin.",
   "02.033.15": "Thus, O tawny and manly god, showing thyself 1, so as neither to be angry nor to kill, be mindful of our invocations 2, and, rich in brave sons, we shall magnify thee in the congregation.",
   "06.074.01": "Soma and Rudra, may you maintain your divine dominion, and may the oblations reach you properly. Bringing the seven treasures to every house, be kind to our children and our cattle.",
   "06.074.02": "Soma and Rudra, draw far away in every direction 1 the disease 2 which has entered our house. Drive far away Nirriti 3, and may auspicious glories belong to us!",
   "06.074.03": "Soma and Rudra, bestow all these remedies on our bodies. Tear away and remove from us  1 whatever evil we have committed, which clings to our bodies.",
   "06.074.04": "Soma and Rudra, wielding sharp weapons and sharp bolts, kind friends, be gracious unto us here! Deliver us from the snare of Varuna, and guard us, as kind-hearted gods!",
   "07.046.01": "Offer ye these songs to Rudra whose bow is strong, whose arrows are swift, the self-dependent 1 god, the unconquered conqueror, the intelligent, whose weapons are sharp—may he hear us!",
   "07.046.02": "For, being the lord 1, he looks after what is born on earth; being the universal ruler, he looks after what is born in heaven. Protecting us, come to our protecting doors, be without illness among our people, O Rudra!",
   "07.046.03": "May that thunderbolt of thine, which, sent from heaven, traverses the earth, pass us by! A thousand medicines are thine, O thou who art freely accessible 1; do not hurt us in our kith and kin!",
   "07.046.04": "Do not strike us, O Rudra, do not forsake us! May we not be in thy way when thou rushest forth furiously. Let us have our altar and a good report among men 1—protect us always with your favours!",
   "01.002.01": "Come hither, O Vâyu, thou beautiful one 1! These Somas are ready, drink of them, hear our call!",
   "01.002.02": "O Vâyu, the praisers celebrate thee with hymns, they who know the feast-days 1, and have prepared the Soma.",
   "01.002.03": "O Vâyu, thy satisfying stream 1 goes to the worshipper, wide-reaching, to the Soma-draught.",
   "01.002.04": "O Indra and Vâyu, these (libations of Soma) are poured out; come hither for the sake of 1 our offerings, for the drops (of Soma) long for you.",
   "01.002.05": "O Indra and Vâyu, you perceive the libations, you who are rich in booty 1; come then quickly hither!",
   "01.002.06": "O Vâyu and Indra, come near to the work 1 of the sacrificer, quick, thus is my prayer 2, O ye men!",
   "01.002.07": "I call Mitra, endowed with holy strength 1, and Varuna, who destroys all enemies; who both fulfil a prayer accompanied by fat offerings 2.",
   "01.002.08": "On the right way, O Mitra and Varuna, you have obtained great wisdom, you who increase the right and adhere to the right 1;",
   "01.002.09": "These two sages, Mitra and Varuna, the mighty, wide-ruling, give us efficient strength.",
   "01.134.01": "O Vâyu, may the quick racers bring thee towards the offerings, to the early drink 1 here, to the early drink of Soma! May Sûnritâ 2 (the Dawn) stand erect, approving thy mind! Come near on thy harnessed chariot to share, O Vâyu, to share in the sacrifice 3!",
   "01.134.02": "May the delightful drops of Soma delight thee, the drops made by us, well-made, and heaven-directed, yes, made with milk, and heaven-directed. When his performed aids assume strength for achievement, cur prayers implore the assembled steeds for gifts, yes, the prayers implore them.",
   "01.134.03": "Vâyu yokes the two ruddy, Vâyu yokes the two red horses, Vâyu yokes to the chariot the two swift horses to draw in the yoke, the strongest to draw in the yoke. Awake Purandhi (the Morning) 1 as a lover wakes a sleeping maid, reveal heaven and earth, brighten the dawn, yes, for glory brighten the dawn.",
   "01.134.04": "For thee the bright dawns spread out in the distance beautiful garments, in their houses 1, in their rays, beautiful in their new rays. To thee the juice-yielding 2 cow pours out all treasures. Thou hast brought forth the Maruts from the flanks 3, yes, from the flanks of heaven.",
   "01.134.05": "For thee the white, bright, rushing Somas, strong in raptures, have rushed to the whirl, they vhave rushed to the whirl of the waters. The tired hunter asks luck of thee in the chase 1; thou shieldest 2 by thy power from every being, yes, thou shieldest by thy power from powerful spirits 3.",
   "01.134.06": "Thou, O Vâyu, art worthy as the first before all others to drink these our Somas, thou art worthy to drink these poured-out Somas. Among the people also who invoke thee and have turned to thee 1, all the cows pour out the milk, they pour out butter and milk (for the Soma).",
   "10.168.01": "Now for the greatness of the chariot of Vâta 1! Its roar goes crashing and thundering. It moves touching the sky, and creating red sheens 2, or it goes scattering the dust of the earth.",
   "10.168.02": "Afterwards there rise the gusts of Vâta 1, they go towards him, like women to a feast 2. The god goes with them on the same chariot, he, the king of the whole of this world.",
   "10.168.03": "When he moves on his paths along the sky, he rests not even a single day 1; the friend of the waters, the first-born, the holy, where was he born, whence did he spring?",
   "10.168.04": "The breath of the gods, the germ 1 of the world, that god moves wherever he listeth; his roars indeed are heard, not his form—let us offer sacrifice to that Vâta!",
   "10.186.01": "May Vâta waft medicine, healthful, delightful to our heart; may he prolong our lives!",
   "10.186.02": "Thou, O Vâta, art our father, and our brother, and our friend; do thou grant us to live!",
   "10.186.03": "O Vâta, from that treasure of the immortal which is placed in thy house yonder, give us to live!"
}