{
   "01.001.01": "1 I magnify 2 Agni, the Purohita, the divine ministrant of the sacrifice, the Hotri priest, the greatest bestower of treasures.",
   "01.001.02": "Agni, worthy to be magnified by the ancient Rishis and by the present ones — may he conduct the gods hither.",
   "01.001.03": "May one obtain through Agni wealth and welfare day by day, which may bring glory and high bliss of valiant offspring.",
   "01.001.04": "Agni, whatever sacrifice and worship 1 thou encompassest on every side, that indeed goes to the gods.",
   "01.001.05": "May Agni the thoughtful Hotri, he who is true and most splendidly renowned, may the god come hither with the gods.",
   "01.001.06": "Whatever good thou wilt do to thy worshipper, O Agni, that (work) verily is thine, O Angiras.",
   "01.001.07": "Thee, O Agni, we approach day by day, O (god) who shinest in the darkness 1; with our prayer, bringing adoration to thee",
   "01.001.08": "Who art the king of all worship, the guardian of Rita, the shining one, increasing in thy own house.",
   "01.001.09": "Thus, O Agni, be easy of access to us, as a father is to his son. Stay with us for our happiness.",
   "01.012.01": "We choose Agni as our messenger, the all-possessor, as the Hotri of this sacrifice, the highly wise.",
   "01.012.02": "Agni and Agni again they constantly invoked with their invocations, the lord of the clans, the bearer of oblations, the beloved of many.",
   "01.012.03": "Agni, when born, conduct the gods hither for him who has strewn the Barhis (sacrificial grass) 1; thou art our Hotri, worthy of being magnified 2.",
   "01.012.04": "Awaken them, the willing ones, when thou goest as messenger, O Agni. Sit down with the gods on the Barhis.",
   "01.012.05": "O thou to whom Ghnta oblations are poured out, resplendent (god), burn against the mischievous, O Agni, against the sorcerers.",
   "01.012.06": "By Agni Agni is kindled (or, by fire fire is kindled), the sage, the master of the house, the young one, the bearer of oblations, whose mouth is the sacrificial spoon.",
   "01.012.07": "Praise Agni the sage, whose ordinances for the sacrifice are true, the god who drives away sickness.",
   "01.012.08": "Be the protector, O Agni, of a master of sacrificial food who worships thee, O god, as his messenger.",
   "01.012.09": "Be merciful, O purifier, unto the man who is rich in sacrificial food, and who invites Agni to the feast of the gods.",
   "01.012.10": "Thus, O Agni, resplendent purifier, conduct the gods hither to us, to our sacrifice and to our food.",
   "01.012.11": "Thus praised by us with our new Gayatra hymn, bring us wealth of valiant men and food.",
   "01.012.12": "Agni with thy bright splendour be pleased, through all our invocations of the gods, with this our praise.",
   "01.013.01": "1 Being well lighted, O Agni, bring us hither the gods to the man rich in sacrificial food, O Hotri, purifier, and perform the sacrifice.",
   "01.013.02": "Tanuinapat 1! Make our sacrifice rich in honey and convey it to-day to the gods, O sage, that they may feast.",
   "01.013.03": "I invoke here at this sacrifice Narâsamsa 1, the beloved one, the honey-tongued preparer of the sacrificial food.",
   "01.013.04": "O magnified 1 Agni! Conduct the gods hither in an easy-moving chariot. Thou art the Hotri instituted by Manus 2.",
   "01.013.05": "Strew, O thoughtful men, in due order 1 the sacrificial grass, the back (or surface) of which is sprinkled with butter, on which the appearance of immortality 2 (is seen).",
   "01.013.06": "May the divine gates open, the increasers of Rita, which do not stick together, that to-day, that now the sacrifice may proceed.",
   "01.013.07": "I invoke here at this sacrifice Night and Dawn, the beautifully adorned goddesses, that they may sit down on this our sacrificial grass.",
   "01.013.08": "I invoke these two divine Hotris 1, the sages with beautiful tongues. May they perform this sacrifice for us.",
   "01.013.09": "Ilâ ('Nourishment'), Sarasvatî, and Mahî ('the great one') 1, the three comfort-giving goddesses, they who do not fail, shall sit down on the sacrificial grass.",
   "01.013.10": "I invoke hither the foremost, all-shaped Tvashtri to come hither; may he be ours alone.",
   "01.013.11": "O tree 1, let the sacrificial food go, O god, to the gods. May the giver's splendour be foremost.",
   "01.013.12": "Offer ye the sacrifice with the word Svâhâ to Indra in the sacrificers house. Thereto I invoke the gods.",
   "01.026.01": "Clothe thyself with thy clothing (of light), o sacrificial (god), lord of all vigour; and then perform this worship for us.",
   "01.026.02": "Sit down, most youthful god, as our desirable Hotri, through (our prayerful) thoughts 1, O Agni, with thy word 2 that goes to heaven.",
   "01.026.03": "The father verily by sacrificing procures (blessings) for the son 1, the companion for the companion, the elect friend for the friend.",
   "01.026.04": "May Varuna, Mitra, Aryaman, triumphant with riches (?) 1, sit down on our sacrificial grass as they did on Manu’s.",
   "01.026.05": "O ancient Hotri, be pleased with this our friendship also, and hear these prayers.",
   "01.026.06": "For whenever we sacrifice constantly 1 to this or to that god, in thee alone the sacrificial food is offered.",
   "01.026.07": "May he be dear to us, the lord of the clan, the joy-giving, elect Hotri; may we be clear (to him), possessed of a good Agni (i. e. of good fire).",
   "01.026.08": "For the gods, when possessed of a good Agni, have given us excellent wealth, and we think ourselves possessed of a good Agni.",
   "01.026.09": "And may there be among us mutual praises of both the mortals, O immortal one, (and the immortals) 1.",
   "01.026.10": "With all Agnis (i. e. with all thy fires), O Agni, accept this sacrifice and this prayer, O young (son) of strength 1.",
   "01.027.01": "With reverence I shall worship thee who art long-tailed like a horse, Agni, the king of worship.",
   "01.027.02": "May he, our son of strength 1, proceeding on his broad way, the propitious, become bountiful to us.",
   "01.027.03": "Thus protect us always, thou who hast a full life, from the mortal who seeks to do us harm 1, whether near or afar.",
   "01.027.04": "And mayest thou, O Agni, announce to the gods this our newest efficient Gâyatra song.",
   "01.027.05": "Let us partake of all booty that is highest and that is middle (i. e. that dwells in the highest and in the middle world); help us to the wealth that is nearest.",
   "01.027.06": "O god with bright splendour, thou art the distributor. Thou instantly flowest for the liberal giver in the wave of the river, near at hand.",
   "01.027.07": "The mortal, O Agni, whom thou protectest in battles, whom thou speedest in the races 1, he will command constant nourishment:",
   "01.027.08": "Whosoever he may be, no one will overtake him, O conqueror (Agni)! His strength 2 is glorious.",
   "01.027.09": "May he (the man), known among all tribes 3, Win the race with his horses; may he with the help of his priests become a gainer.",
   "01.027.10": "O Garabodha 1! Accomplish this (task) for every house 2: a beautiful song of praise for worshipful Rudra 3.",
   "01.027.11": "May he, the great, the immeasurable, the smoke-bannered, rich in splendour, incite us to (pious) thoughts and to strength.",
   "01.027.12": "May he hear us, like the rich lord of a clan, the banner of the gods, on behalf of our hymns, Agni with bright light.",
   "01.027.13": "Reverence to the great ones, reverence to the lesser ones! Reverence to the young, reverence to the old 1! I Let us sacrifice to the gods, if we can. May I not, O gods, fall as a victim to the curse of my better 2.",
   "01.031.01": "Thou, O Agni, (who art) the first Angiras Rishi, hast become as god the kind friend of the gods. After thy law the sages, active in their wisdom 1, were born, the Maruts with brilliant spears.",
   "01.031.02": "Thou, O Agni, the first, highest Angiras, a sage, administerest the law of the gods, mighty for the whole world, wise, the son of the two mothers 1, reposing everywhere for (the use of ) the living 2.",
   "01.031.03": "Thou, O Agni, as the first, shalt become 1 manifest to Matarisvan, through thy high wisdom, to Vivasvat. The two worlds trembled at (thy) election as Hotri. Thou hast sustained the burthen; thou, O Vasu, hast sacrificed to the great (gods) 2.",
   "01.031.04": "Thou, O Agni, hast caused the sky to roar 1 for Manu, for the well-doing Purûravas, being thyself a greater well-doer. When thou art loosened by power (?) 2 from thy parents, they led thee hither before and afterwards again.",
   "01.031.05": "Thou, O Agni, the bull, the augmenter of prosperity, art to be praised by the sacrificer who raises the Spoon, who knows all about the offering 1 and (the sacrifice performed with) the word Vashat. Thou (god) of unique vigour art the first to invite 2 the clans.",
   "01.031.06": "Thou, O Agni, leadest forward the man who follows crooked ways 1, in thy company at the sacrifice 2, O god dwelling among all tribes, who in the strife of heroes, in the decisive moment for the obtainment of the prize 3, even with few companions killest many foes in the battle 4.",
   "01.031.07": "Thou, O Agni, keepest that mortal 1 in the highest immortality, in glory day by day, (thou) who being thirsty thyself 2 givest happiness to both races (gods and men), and joy to the rich.",
   "01.031.08": "Thou, O Agni, praised by us, help the glorious singer to gain prizes. May we accomplish our work with the help of the young active (Agni). O Heaven and Earth! Bless us together with the gods.",
   "01.031.09": "Thou, O Agni, in the lap of thy parents, a god among gods, O blameless one, always watchful, be the body’s creator and guardian to the singer. Thou, O beautiful one, pourest forth all wealth.",
   "01.031.10": "Thou, O Agni, art our guardian, thou art our father. Thou art the giver of strength; we are thy kinsmen. Hundredfold, thousandfold treasures come together in thee, who art rich in heroes, the guardian of the law, O undeceivable one.",
   "01.031.11": "Thee, O Agni, the gods have made for the living as the first living 1, the clan-lord of the Nahusha 2. They have made (the goddess) Ilâ the teacher of men (manusha), when a son of my father is born 3.",
   "01.031.12": "Thou, O Agni, protect with thy guardians, O god, our liberal givers and ourselves, O venerable one! Thou art the protector of kith and kin 1 and of the cows, unremittingly watching over thy law.",
   "01.031.13": "1 Thou, O Agni, art kindled four-eyed, as the closest guardian for the sacrificer who is without (even) a quiver 2. Thou acceptest in thy mind the hymn even of the poor 3 who has made offerings 4, that he may prosper without danger.",
   "01.031.14": "Thou, O Agni, gainest 1 for the widely-renowned worshipper that property which is desirable and excellent. Thou art called the guardian and father even of the weak 2; thou instructest the simple, thou, the greatest sage, the quarters of the world 3.",
   "01.031.15": "Thou, O Agni, protectest on every side like well-stitched armour the man who gives sacrificial fees. He who puts sweet food (before the priests), who makes them comfortable in his dwelling, who kills living (victims), he (will reside) high in heaven 1.",
   "01.031.16": "Forgive, O Agni, this our fault (?) 1, (look graciously at) this way which we have wandered from afar. Thou art the companion, the guardian, the father of those who offer Soma; thou art the quick one 2 who makes the mortals Rishis 3.",
   "01.031.17": "As thou didst for Manus, O Agni, for Angiras, O Angiras, for Yayâti on thy (priestly) seat, as for the ancients, O brilliant one, come hither, conduct hither the host of the gods, seat them on the sacrificial grass, and sacrifice to the beloved (host).",
   "01.031.18": "Be magnified, O Agni, through this spell which we have made for thee with our skill or with our knowledge. And lead us forward to better things. Let us be united with thy favour, which bestows strength.",
   "01.036.01": "We implore 1 with well-spoken words the vigorous 2 Agni who belongs to many people 3, to the clans that worship the gods 4, whom other people (also) magnify.",
   "01.036.02": "Men have placed Agni (on the altar) as the augmenter of strength. May we worship thee, rich in sacrificial food. Thus be thou here to-day gracious to us, a helper in our striving for gain, O good one!",
   "01.036.03": "We choose thee, the all-possessor, as our messenger and as our Hotri. The flames of thee, who art great, spread around; thy rays touch the heaven.",
   "01.036.04": "The gods, Varuna, Mitra, Aryaman, kindle thee, the ancient messenger. The mortal, O Agni, who worships thee, gains through thee every prize.",
   "01.036.05": "Thou art the cheerful Hotri and householder, O Agni, the messenger of the clans. In thee all the firm laws are comprised which the gods have made 1.",
   "01.036.06": "In thee, the blessed one, O Agni, youngest god, all sacrificial food is offered. Sacrifice then thou who art gracious to us to-day and afterwards 1 to the gods that we may be rich in valiant men.",
   "01.036.07": "Him, the king, verily the adorers approach reverentially. With oblations men kindle Agni, having overcome all failures.",
   "01.036.08": "Destroying the foe 1, they (victoriously) got through Heaven and Earth and the waters; they have made wide room for their dwelling. May the manly (Agni) 2, after he has received the oblations, become brilliant at the side of Kanva; may he neigh as a horse in battles.",
   "01.036.09": "Take thy seat; thou art great. Shine forth, thou who most excellently repairest to the gods. O Agni, holy god, emit thy red, beautiful smoke, O glorious one!",
   "01.036.10": "Thou whom the gods have placed here for Manu as the best performer of the sacrifice, O carrier of oblations, whom Kanva and Medhyatithi, whom Vrishan and Upastuta 1 (have worshipped,) the winner of prizes.",
   "01.036.11": "That Agni's nourishment has shone brightly whom Medhyatithi and Kanva have kindled on behalf of Rita 1. Him do these hymns, him do we extol.",
   "01.036.12": "Fill (us with) wealth, thou self-dependent one, for thou, O Agni, hast companionship with the gods. Thou art lord over glorious booty. Have mercy upon us; thou art great.",
   "01.036.13": "Stand up straight for blessing us, like the god Savitri, straight a winner of booty, when we with our worshippers and with ointments 1 call thee 2 in emulation (with other people).",
   "01.036.14": "Standing straight, protect us by thy splendour from evil; burn down every ghoul 1. Let us stand straight that we may walk and live. Find out our worship 2 among the gods.",
   "01.036.15": "Save us, O Agni, from the sorcerer, save us from mischief, from the niggard. Save us from him who does us harm or tries to kill us, O youngest god with bright splendour!",
   "01.036.16": "As with a club 1 smite the niggards in all directions, and him who deceives us, O god with fiery jaws. The mortal who makes (his weapons) very sharp by night, may that impostor not rule over us.",
   "01.036.17": "Agni has won abundance in heroes, Agni prosperity (for Kanva). Agni and the two Mitras (i.e. Mitra and Vanma) have blessed Medhyatithi, Agni (has blessed) Upastuta in the acquirement (of wealth) 1.",
   "01.036.18": "Through Agni we call hither from afar Turvasa, Yadu, and Ugradeva. May Agni, our strength against the Dasyu, conduct Navavâstva, Brihadratha, and Turvîti 1.",
   "01.036.19": "Manu has established thee, O Agni, as a light for all people. Thou hast shone forth with Kanva, born from Rita, grown strong, thou whom the human races worship.",
   "01.036.20": "Agni's flames are impetuous and violent; they are terrible and not to be withstood. Always burn down the sorcerers, and the allies of the Yatus, every ghoul 1.",
   "01.044.01": "Agni, at the rising of the dawn 1 bring splendid wealth, immortal Gâtavedas, to the worshipper, (and bring hither) to-day the gods awakening with the dawn.",
   "01.044.02": "For thou art the accepted messenger, the bearer of sacrificial food, O Agni, the charioteer of worship. United with the two Asvins and with the Dawn bestow on us abundance of valiant heroes, and high glory.",
   "01.044.03": "We choose to-day as our messenger Agni, the Vasu, the beloved of many, whose banner is smoke, whose … 1 is light, at the dawning of the day, the beautifier of sacrifices 2.",
   "01.044.04": "I magnify at the dawning of the day Agni Gatavedas, the best, the youngest guest, the best receiver of offerings, welcome to pious people, that he may go to the gods 1.",
   "01.044.05": "I shall praise thee, O food on which everything lives, immortal one 1, Agni, the immortal protector, O holy god, the best sacrificer, O bearer of sacrificial food.",
   "01.044.06": "Be kind-spoken to him who praises thee, O youngest god, honey-tongued, the best receiver of offerings. Lengthening Praskanva's life, that he may reach old age, do homage 1 to the host of the gods.",
   "01.044.07": "The clans kindle thee, the all-possessing Hotri:  therefore conduct hither speedily, much-invoked Agni, the provident gods.",
   "01.044.08": "Savitri, the Dawn, the two Arvins, Bhaga, Agni 1, at the dawning (of the day), (at the end) of night 2. The Kanvas, having pressed Soma, inflame thee, the bearer of sacrificial food, O best performer of worship.",
   "01.044.09": "As thou, O Agni, art the lord of worship, the messenger of the clans, conduct hither to-day the gods awakening with the dawn, of sun-like aspect, that they may drink Soma.",
   "01.044.10": "Agni, rich in splendour! thou hast shone after the former dawns, visible to all. Thou art the guardian in the hamlets, the Purohita; thou be- longest to men at the sacrifices 1.",
   "01.044.11": "O Agni, let us put thee down (on the altar) as Manus did, O god, to be the performer of the sacrifice, the Hotri, the wise priest, the quick immortal messenger.",
   "01.044.12": "When thou, the Purohita of the gods, who art great like Mitra, goest on thy errand as messenger in their midst, then the flames of Agni shine like the roaring waves of the Sindhu 1.",
   "01.044.13": "Agni with thy attentive ears, hear me, together with the gods driven (on their chariots) 1 who accompany thee. May Mitra and Aryaman sit down on the sacrificial grass, they who come to the ceremony early in the morning.",
   "01.044.14": "May the Maruts, they who give rain, the fire-tongued increasers of Rita, hear my praise. May Varuna, whose laws are firm, drink the Soma, united with the two Asvins and with the Dawn!",
   "01.045.01": "Sacrifice here, thou, O Agni, to the Vasus, the Rudras, and the Adityas, to the (divine) host that receives good sacrifices 1, the Ghrita-sprinkling offspring of Manu 2.",
   "01.045.02": "The wise gods, O Agni, are ready to listen to the worshippers: conduct them hither, the thirty-three, O lord of red horses, thou who lovest our praises.",
   "01.045.03": "As thou hast heard Priyamedha and Atri 1, O Gâtavedas, as thou hast heard Virupa and Angiras, thus hear the invocation of Praskanva, O lord of high laws.",
   "01.045.04": "The Mahikerus 1, the Priyamedhas have invoked for their protection the lord of worship, Agni with his bright splendour.",
   "01.045.05": "O thou to whom Ghrita oblations are poured out, good (Agni), hear these praises with which the sons of Kanva invoke thee for their protection.",
   "01.045.06": "O Agni, whose glory is brightest, beloved of many, the people in the clans invoke thee, the radiant-haired, to convey the sacrificial food.",
   "01.045.07": "The priests have established thee, O Agni, in the striving for day 1, as their Hotri, the ministrant, the greatest acquirer of wealth, with attentive ears, the most widely extended 2.",
   "01.045.08": "The wise who have pressed Soma have made thee speed hither to the feast (which is offered to the gods), bringing great light 1 and sacrificial food, O Agni, on behalf of the mortal worshipper.",
   "01.045.09": "O strength-made, good (Agni), make the gods who come in the morning, the divine host, sit down here to-day on our sacrificial grass, O Vasu, to drink the Soma.",
   "01.045.10": "Sacrifice, O Agni, with joint invocations, and bring hither the divine host. This is the Soma, O rain-giving gods. Drink (the Soma) which has been kept over night 1.",
   "01.058.01": "Seizing his own food the undecaying, greedy (Agni) stands on the brushwood wishing to drink. When he has been sprinkled (with ghee), he shines like a racer with his back 1. Thundering he has roared like the ridge of heaven.",
   "01.058.03": "As soon as 1 the Rudras, the Vasus have made him their Purohita, the immortal sitting down as Hotri, the conqueror of wealth, pressing forward like a chariot among the clans, among the Âyus 2, the god in due course discloses desirable boons.",
   "01.058.04": "Stirred by the wind he spreads among the brushwood lightly, 1 (driven forward) by the sacrificial ladles, with his sickle 2, loudly roaring. When thou, O Agni, thirstily rushest on the wooden sticks like a bull 3, thy course, O never-aging god with fiery waves, becomes black 4.",
   "01.058.05": "He who has fiery jaws, stirred by the wind, blazes down on the forest 1 as a strong bull (rushes) on the herd. When he proceeds 2 with his stream of light to the imperishable atmosphere, then what is moveable and immoveable (and) the winged (birds) are afraid.",
   "01.058.06": "The Bhrigus have placed thee among men, who art beautiful like a treasure, who art easy to invoke for people; thee the Hotri, O Agni, the excellent guest, a delightful friend like Mitra to the divine race!",
   "01.058.07": "I worship with good cheer Agni the steward 1 of all treasures, whom the seven ladles 2 (of the priests), the worshippers choose as the Hotri, the best sacrificer at the rites, and I pray for treasure 3.",
   "01.058.08": "Son of strength, great like Mitra, grant to-day flawless protection to us who magnify thee,  Agni! guard from distress with strongholds of iron him who praises thee, O offspring of vigour!",
   "01.058.09": "Be a shelter to him who praises thee, O resplendent one; be protection, generous giver, to the generous. Agni! guard him who praises thee from distress. May he who gives wealth for our prayer, come quickly in the morning 1.",
   "01.059.01": "The other Agnis (the other fires) are verily thy branches, O Agni. In thee all the immortals enjoy themselves 1. Vaisvânara! Thou art the centre 2 of human settlements; like a supporting column thou holdest men 3.",
   "01.059.02": "The head of heaven, the navel of the earth is Agni; he has become the steward 1 of both worlds. Thee, a god, the gods have engendered, O Vaisvânara, to be a light for the Ârya.",
   "01.059.03": "As in the sun the rays are firmly fixed, thus in Agni Vaisvânara all treasures have been laid down 1. (The treasures) which dwell in the mountains, in the herbs, the waters, and among men—of all that thou art the king.",
   "01.059.04": "As the two great worlds to their son 1, like a Hotri like a skilful man, (we bring) praises — manifold (praises) to him who is united with the sun, to the truly strong one, new (praises) to Vaisvanara, the manliest god.",
   "01.059.05": "Thy greatness, O Gâtavedas, Vaisvânara, has exceeded even the great heaven. Thou art the king of the human tribes; thou hast by fighting gained wide space for the gods.",
   "01.059.06": "Let me now proclaim the greatness of the bull whom the Pûrus worship as the destroyer of enemies 1. Agni Vaisvânara, having slain the Dasyu, shook the (aerial) arena and cut down Sambara.",
   "01.059.07": "Agni Vaisvânara, extending by his greatness over all dominions, who is to be worshipped, the bright one, rich in loveliness, is awake (or, is praised) among the Bharadvâgas, in the homestead of Purunîtha .Sâtavaneya, with his hundredfold blessings.",
   "01.060.01": "Mâtarisvan brought (Agni) to Bhrigu as a gift precious like wealth, of double birth 1, the carrier, the famous, the beacon of the sacrifice 2, the ready and immediately successful messenger.",
   "01.060.02": "Both follow his command, the Usigs 1 offering sacrificial food, and the mortals. The Hotri (Agni) has sat down before daybreak among the clans, the lord of the clans, whose leave should be asked, the performer of worship.",
   "01.060.03": "May our new, beautiful praise, born 1 from our heart, reach him the honey-tongued (Agni), whom the human priests in our settlement 2, the Âyus, offering enjoyment have engendered.",
   "01.060.04": "The Usig 1, the purifier, the Vasu has been established among men, the best Hotri among the clans, the domestic 2 master of the house in the house: Agni has become the treasure-lord of treasures.",
   "01.060.05": "Thus we, the Gotamas, praise thee, O Agni, the lord of treasures, with our (pious) thoughts, rubbing thee as (they rub down) a swift racer that wins the prize. May he who gives wealth for our prayer, come quickly in the morning 1.",
   "01.065.01": "1 Thee who hidest thyself in secret like a thief with an animal 2 (which he has stolen) — who hadst harnessed 3 adoration and carriedst adoration —",
   "01.065.02": "The wise unanimously followed by thy foot-marks 1. All (gods) deserving worship (reverentially) sat down near thee.",
   "01.065.03": "The gods followed the laws of Rita. There was an encompassing as the heaven (encompasses) the earth 1.",
   "01.065.04": "In the lap, in the womb of Rita, the waters nourish the fine child with praise, him who is well born.",
   "01.065.05": "Like good fortune, like a broad abode, like the fertile hill 1 like the refreshing stream,",
   "01.065.06": "Like a racer urged forward in the race, like the rapids of the Sindhu 1 — who can hold him back?",
   "01.065.07": "(He is) the kinsman of the rivers, as a brother of his sisters. He eats the forests as a king (eats, i. e. takes the wealth of) the rich 1.",
   "01.065.08": "When he has spread through the forests, driven by the wind, Agni shears the hair of the earth.",
   "01.065.09": "Sitting in the waters he hisses like a swan. (He is) most famous by his power of mind, he who belongs to the clans, awakening at dawn.",
   "01.065.10": "A performer of worship like Soma, the god born from Rita, like a young (?) 1 beast, far-extending, far-shining.",
   "01.066.01": "Like unto excellent wealth, like unto the shine of the sun, like unto living breath, like unto one's own 1 son.",
   "01.066.02": "Like unto a quick takvan 1 he (Agni) holds the wood, like milk, like a milch cow 2, bright and shining.",
   "01.066.03": "He holds safety, pleasant like a homestead, like ripe barley, a conqueror of men,",
   "01.066.04": "Like a Rishi uttering (sacred) shouts, praised among the clans; like a well-cared-for race-horse 1, Agni bestows vigour.",
   "01.066.05": "He to whose flame men do not grow accustomed 1, who is like one's own mind 2, like a wife on a couch, enough for all (happiness).",
   "01.066.06": "When the bright (Agni) has shone forth, he is like a white (horse [?]) 1 among people, like a chariot with golden ornaments, impetuous in fights.",
   "01.066.07": "Like an army which is sent forward he shows his vehemence, like an archer's shaft with sharp point.",
   "01.066.08": "He who is born is one twin; he who will be born 1 is the other twin—the lover of maidens, the husband of wives 2.",
   "01.066.09": "1 As cows go to their stalls, all that moves and we, for the sake of a dwelling, reach him who has been kindled.",
   "01.066.10": "Like the flood of the Sindhu 1 he has driven forward the downwards-flowing (waters) 2. The cows lowed at the sight of the sun 3.",
   "01.067.01": "Victorious 1 in the forests, a friend among men, he demands obedience like a king, the undecaying one 2.",
   "01.067.02": "Like good peace, like fortunate wisdom, may he (Agni) be a kind Hotri, a carrier of offerings.",
   "01.067.03": "Having taken in his hand all manly powers, he has made the gods fear, when sitting down in his hiding-place.",
   "01.067.04": "There the thoughtful men find him, when they have recited the spells which they had fashioned in their heart.",
   "01.067.05": "As the goat 1 (supports) the earth 2, thus he supports the earth 2; he upholds the sky by his efficacious spells.",
   "01.067.06": "Protect the dear 1 footsteps of the cattle 2. O Agni, thou who hast a full life, thou hast gone from covert to covert 3.",
   "01.067.07": "He who has seen him the hidden one, he who has got near to the stream of Rita 1.",
   "01.067.08": "They who get him off, doing service to Rita, to him he then indicates riches.",
   "01.067.09": "He who grows up with might within the plants, and within the children 1, and within the sprouting grass 2.",
   "01.067.10": "The splendour [?] in the home of the waters 1, the full-lived. The sages made him as if building a seat.",
   "01.068.01": "Cooking 1 (the oblations?) the quick one has approached the sky. He has revealed the nights and what stands and moves 2.",
   "01.068.02": "When he the god, alone of all these gods 1 encompassed (the others) by his greatness.",
   "01.068.03": "When thou, O god, hadst been born living from the dry (wood), then all (gods and men?) were pleased with thy wisdom.",
   "01.068.04": "They all obtained the name of divinity, of immortality 1, serving the Rita in due way.",
   "01.068.05": "The instigations of Rita, the thought of Rita 1: they all performed the works of [?] the full-lived one 2.",
   "01.068.06": "Bestow wealth, thou who art the knowing one, on him who worships thee or who does service to thee 1.",
   "01.068.07": "He who sits down as the Hotri among the offspring of Manu: he verily is the master of all these riches.",
   "01.068.08": "They longed together for the seed in their bodies 1, and the wise ones were concordant among each other in their minds.",
   "01.068.09": "They took pleasure in his will, as sons (take pleasure) in their father's (will), the quick ones who have listened to his command.",
   "01.068.10": "He who is rich in food has opened the gates of wealth 1. The householder (Agni) has adorned the sky with stars.",
   "01.069.01": "Bright, flaming, like the lover of the Dawn 1, he has, like the light of the sky, filled the two (worlds of Heaven and Earth) which are turned towards each other.",
   "01.069.02": "As soon as thou wert born thou hast excelled by thy power of mind; being the son of the gods thou hast become their father.",
   "01.069.03": "(Agni is) a worshipper (of the gods), never foolish, (always) discriminating; (he is) like the udder of the cows; (he is) the sweetness of food 1.",
   "01.069.04": "Like a kind friend to men, not to be led astray 1, sitting in the midst, the lovely one, in the house;",
   "01.069.05": "Like a child when born, he is delightful in the house; like a race-horse which is well cared for 1, he has wandered across the clans 2.",
   "01.069.06": "When I call (to the sacrifice) the clans who dwell in the same nest with the heroes, may Agni then attain all divine powers 1.",
   "01.069.07": "When thou hast listened to these heroes, no one breaks those laws of thine.",
   "01.069.08": "That verily is thy wonderful deed that thou hast killed 1, with thy companions, (all foes), that, joined by the heroes, thou hast accomplished thy works 2.",
   "01.069.10": "Carrying (him) they opened by themselves the doors (of heaven). They all shouted at the aspect of the sun 1.",
   "01.070.01": "May we, the poor 1, succeed in many (pious) thoughts 2. May Agni with his pure splendour attain everything.",
   "01.070.02": "He who understands the divine laws and the birth of the human race.",
   "01.070.03": "He who is the child of the waters, the child of the trees, the child of that which stands, and the child of that which moves.",
   "01.070.04": "Even in the rock (they have done homage [?]) to him, in his dwelling 1. (He is) like a protector [?] 2 of the clans, the immortal one, he who is of a good mind.",
   "01.070.05": "For he, Agni, (shows himself as) an earth-protecting (lord) of riches 1 to the man who satisfies him with well-spoken (prayers).",
   "01.070.06": "Protect, O knowing one, these beings, thou who knowest the birth of gods and men 1.",
   "01.070.07": "He whom many nights (and dawns), in their different forms 1, may increase, whom that which moves 2 and that which stands (increases), the god penetrated by Rita.",
   "01.070.08": "That Hotri who has sat down in the sun 1, has been successfully worshipped 2 (by the human sacrificers), he who truly accomplishes all his works.",
   "01.070.09": "On the cows, on the trees thou hast conferred excellence. May all men bring us tribute in the sun 1.",
   "01.070.10": "In many places men have worshipped thee. They have brought (thee) to different places 1 as sons (divide) the property of an aged father 2.",
   "01.070.11": "1 (He is) like a greedy man 2 who goes straight (to his aim), like a mighty archer, like a fearful avenger [?] 3, impetuous in contests 4.",
   "01.071.01": "The loving (women) have (amorously) excited 1 their lover, as wives of the same nest (house) their own husband. The sisters have delighted in the dark and in the red (goddess) 2, as the cows in the brightly shining dawn.",
   "01.071.02": "Our fathers, the Aṅgiras 1, have broken even the strong fortresses by their hymns, the rock by their shouting. They have opened to us the path of the great heaven; they have obtained day and sun and the shine of the dawn 2.",
   "01.071.03": "They founded the Rita; they set into motion the thought of it 1. Thus then the widely-spread (prayers) 2 of the poor 3 which seek to obtain (wealth), which are free from thirst 4, the active, approach 5 the tribe of the gods 6, strengthening them by offering them delight.",
   "01.071.04": "When Mâtarisvan had produced him by attrition, he, the reddish, the noble one, who was brought to many places 1, has come to every house. Then the Bhrigu-like 2 has undertaken the messengership 3 (for the mortal) as for a mightier king, being attached to him.",
   "01.071.05": "When he had created sap to the great father Heaven, the knowing one stealthily approached the speckled (cows). The archer fiercely shot an arrow at him. The god turned his impetuous power against his daughter 1.",
   "01.071.06": "Augment, O Agni, twofold the strength of the man who worships 1 thee in his house, or offers adoration to the loving one 2 day by day. May he whom thou incitest be united with riches 3.",
   "01.071.07": "Every nourishment goes towards Agni 1, as the seven young 2 rivers (flow) into the ocean. Our strength does not shine from kinsmen 3. Do thou therefore who knowest this, procure among the gods kindness for us.",
   "01.071.08": "1 When the sharp splendour 2 reached the lord of men to incite him 3, the bright sperm poured down from Heaven (or, from the god Dyaus)4, Agni produced 5 and furthered the blameless, young, well-wishing host 6.",
   "01.071.09": "He who traverses the paths quickly 1 like thought, the Sun alone rules over wealth altogether. (There are) the two kings Mitra and Varuna with graceful hands 2, who watch over the beloved ambrosia 3 in the cows.",
   "01.071.10": "Do not forget, O Agni, who art a sage possessed of knowledge 1, our paternal friendship. Old age impairs the appearance (of men) as a cloud (covers the sun or the sky). Before this curse (attains us), think thou (of us) 2.",
   "01.072.01": "He has brought down (i. e. surpassed) the wisdom of many a worshipper 1, he who holds in his hand all manly power. Agni has become the lord of treasures, he who brought together all (powers of) immortality.",
   "01.072.02": "1 All the clever immortals when seeking did not find the calf though sojourning round about us. The attentive (gods), wearying themselves, following his footsteps 2, stood at the highest, beautiful 3 standing-place of Agni.",
   "01.072.03": "When the bright ones 1 had done service 2 to thee, the bright one, Agni, with Ghrita through three autumns, they assumed worshipful names; the well-born shaped their own bodies.",
   "01.072.04": "Acquiring (or, exploring?) for themselves the two great worlds, the worshipful ones brought forward their Rudra-like powers 1. The mortal, when (beings) were in discord 2, perceived and found out Agni standing in the highest place.",
   "01.072.05": "Being like-minded they reverentially approached him on their knees. Together with their wives they venerated the venerable one. Abandoning their bodies they made them their own, the (one) friend waking when the (other) friend closed his eyes.",
   "01.072.06": "When the worshipful (gods) have discovered the thrice seven secret steps (or, places) laid down in thee, they concordantly guard with them immortality. Protect thou the cattle and that which remains steadfast and that which moves.",
   "01.072.07": "Knowing, O Agni, the established orders 1 of (human) dwellings, distribute in due order gifts 2 that they may live. Knowing the ways which the gods go 3, thou hast become the unwearied messenger, the bearer of oblations.",
   "01.072.08": "They who knew the right way and were filled with good intentions, beheld from heaven the seven young 1 (rivers) and the doors of riches. Saramâ found the strong stable of the cows from which human clans receive their nourishment 2.",
   "01.072.09": "The Earth has spread herself far and wide with them who are great in their greatness, the mother Aditi, for the refreshment of the bird 1, with her sons who have assumed all powers of their own dominion 2, preparing (for themselves) the way to immortality.",
   "01.072.10": "When the immortals created the two eyes of heaven 1, they placed fair splendour in him (Agni) 2. Then they rush down 3 like streams let loose. The red ones have recognised, O Agni, those which are directed downwards 4.",
   "01.073.01": "He who gives vigour like wealth acquired by the fathers 1, who is a good guide like the instruction of a sage, who is pleased (by worship) like a comfortably resting guest 2, (Agni) has crossed the (sacrificial) seat of the worshipper like a Hotri.",
   "01.073.02": "He who being truthful like the god Savitri 1 protects by his power of mind all settlements 2, praised by many like impetuous splendour 3, the truthful one has become dear like vital breath and worthy to be searched for 4.",
   "01.073.03": "(Agni) who possessing every refreshment dwells on the earth like a god, like a king who has made himself (valiant) friends 2, like heroes who sit in front and under shelter, like a blameless wife beloved by her husband.",
   "01.073.04": "Thee, O Agni, who art constantly kindled in the house, men have worshipped in their firm dwellings. They have placed in him rich splendour 1. Be thou possessed of all life, a supporter of riches 2.",
   "01.073.05": "May the liberal givers, O Agni, attain nourishment, may the rich 1 who bestow gifts (on us) attain to a full span of life. May we win in battles the booty of him who does not give 1, obtaining a (rich) share before the gods, that we may win glory 2.",
   "01.073.06": "The lowing milch-cows of Rita, assigned by Heaven, were exuberant with their full udders. The rivers imploring the favour (of the gods) from afar have broken through the midst of the rock with their floods.",
   "01.073.07": "Imploring favour from thee, O Agni, the worshipful (gods) have won glory in the sky. They have made Night and Dawn of different shapes; they have joined the black and red colour (to Night and Dawn).",
   "01.073.08": "And may we, our liberal givers and ourselves, be the mortals whom thou furtherest to wealth, O Agni 1. Like a shadow thou followest the whole world, having filled the two worlds (Heaven and Earth) and the air 2.",
   "01.073.09": "May we, O Agni, guarded by thee, conquer with our racers the racers, with our men the men, with our heroes the heroes (of our enemies). Being masters of the riches which their fathers 1 have conquered, may our rich (givers) reach a hundred winters.",
   "01.073.10": "May these hymns, O Agni, worshipper (of the gods), be grateful to thee, to thy mind and heart. May we be able to bridle thee, the well-harnessed wealth 1, acquiring the glory which the gods have assigned us.",
   "01.074.01": "Going forward to the sacrifice let us repeat a prayer to Agni who hears us, may he be afar or with us—",
   "01.074.02": "He who foremost 1 in … 2, when the human tribes met (in battle), has preserved his home to the worshipper.",
   "01.074.03": "And let the people say 'Agni is born, the slayer of foes (or, the slayer of Vritra), he who wins the prize in every battle.'",
   "01.074.04": "The man in whose home thou art a messenger, and to whose sacrificial food thou eagerly comest for feasting, to whose worship thou impartest wonderful power—",
   "01.074.05": "Such a man the people call a giver of good oblations, O Aṅgiras, a friend of the gods, O son of strength 1, and a possessor of a good Barhis (or sacrificial grass).",
   "01.074.06": "And thou shalt conduct them hither, the gods 1, that we may praise them, that they may eagerly come, O resplendent one, to the sacrificial offerings.",
   "01.074.07": "No noise 1 of the horses of the moving chariot 2 is heard any way, when thou goest on thy messengership, O Agni.",
   "01.074.08": "When guarded by thee the racer becomes fearless; the worshipper, O Agni, who is behind, gains the advantage 1 over him who is ahead.",
   "01.074.09": "And thou winnest, O Agni, brilliant, high bliss in strong heroes from the gods, O god, for the worshipper.",
   "01.075.01": "Accept gladly our most widely-sounding 1 speech, the most agreeable to the gods, thou who, in thy mouth, offerest the sacrificial food (to the gods).",
   "01.075.02": "And may we then pronounce to thee, O highest Aṅgiras, Agni, best worshipper, a prayer agreeable to thee and successful.",
   "01.075.03": "Who is thy kinsman among men, O Agni? Who performs worship to thee 1? Who art thou, and where dost thou rest?",
   "01.075.04": "Thou, O Agni, art the kinsman, the dear friend ('Mitra') of men, a friend who is to be magnified by his friends.",
   "01.075.05": "Sacrifice for us to Mitra and Varuna. Sacrifice to the gods, (a sacrifice conforming to) the great Rita 1. Sacrifice, O Agni, to thy own house.",
   "01.076.01": "What supplication is to thy mind's taste 1? What (pious) thought may be, O Agni, most agreeable to thee? Or who has won for himself thy wisdom by sacrifices? Or with what thoughts may we worship thee 2?",
   "01.076.02": "Come hither, Agni, sit down here as a Hotri. Become our undeceivable leader 1. May Heaven and Earth, the all-embracing, protect thee. Offer the sacrifice to the gods that they may be highly gracious to us.",
   "01.076.03": "Burn down all sorcerers, O Agni; become a protector of the sacrifices against imprecations. And. conduct hither the lord of Soma (Indra) with his two bay horses. We have prepared hospitality for him, the good giver.",
   "01.076.04": "With words procuring offspring, carrying thee (to our sacrifice) with my mouth 1, I call 2 thee hither, and thou shalt sit down here with the gods. Perform the service of a Hotri and of a Potri 3, O worshipful one. Be thou a giver and a father 4 of riches.",
   "01.076.05": "As thou didst perform sacrifice to the gods with the sacrificial food of the wise Manu 1, a sage together with sages, thus, O highly truthful Hotri, perform thou the sacrifice to-day, O Agni, with thy joy-giving sacrificial ladle 2.",
   "01.077.01": "How shall we sacrifice to Agni? What words, agreeable to the god, shall be addressed to him, the luminous one, who, being immortal and righteous, the Hotri, the best sacrificer, conveys the gods to the mortals 1?",
   "01.077.02": "Bring hither by adoration the Hotri who is most beneficial in sacrifices and righteous. When Agni repairs to the gods on behalf of the mortal 1, may he be attentive in his mind, and may he perform the sacrifice 2.",
   "01.077.03": "For he is wisdom 1, he is manly, he is straightforward; like Mitra he has become the charioteer of the mysterious 2. Therefore the Aryan clans 3, longing for the gods, address him, the wonderful one, as the first at the sacrifices.",
   "01.077.04": "May that Agni, the manliest of men, triumphant with riches [?] 1, come with help to our words, to our devotion, and (to the devotion) of those most powerful liberal givers who bent on the prize 2 have constantly stirred up our prayers 3.",
   "01.077.05": "Thus Agni, the righteous Gâtavedas, has been praised by the priestly Gotamas 1. May he augment their splendour and their strength. He the knowing one gains increase according to his desire.",
   "01.078.01": "O Gâtavedas, who dwellest among all tribes, we the Gotamas (praise) thee with our song—we praise thee aloud with (songs full of) splendour.",
   "01.078.02": "Gotama 1 desirous of riches exalts thee, as thou art, with his song. We praise thee aloud with (songs full of) splendour.",
   "01.078.03": "We call thee, such as thou art, the highest winner of booty, as Aṅgiras did. We praise thee aloud with (songs full of) splendour.",
   "01.078.04": "(We praise) thee, the greatest destroyer of enemies (or, of Vritra), who hurlest the Dasyus away—we praise thee, such as thou art, aloud with (songs full of) splendour.",
   "01.078.05": "We the Rahûganas 1 have recited a honey-sweet speech to Agni. We praise thee aloud with (songs full of) splendour.",
   "01.079.01": "The golden-haired in the expanse 1 of the atmosphere, the roaring 2 snake, is hasting (through the air) like the wind; the brightly resplendent watcher of the dawn 3, he who is like the glorious, ever active and truthful (goddesses) 4.",
   "01.079.02": "By thy goings the beautifully-winged (birds) were disparaged 1; the black bull 2 has roared, when here 3 (all this happened). He has come as if with the bounteous smiling (women) 4. The mists fly, the clouds thunder.",
   "01.079.03": "When they have led him, who swells 1 with the milk of Rita, on the straightest paths of Rita, then Aryaman, Mitra, and Varuna, he who walks round the earth 2, fill the leather-bag (the cloud) in the womb of the lower (atmosphere [?]) 3.",
   "01.079.04": "Agni, who art lord of booty, rich in cows, young son of strength 1, bestow on us, O Gâtavedas, great glory.",
   "01.079.05": "Being lighted, a Vasu, a sage, Agni who is to be magnified by (pious) words, O (god) with many faces, shine to us so that riches may be ours.",
   "01.079.06": "Reigning 1 by night by thy own power, O Agni, and at the break of dawn, O god with sharp teeth, burn against the sorcerers.",
   "01.079.07": "Bless us, O Agni, with thy blessings, when our Gâyatra song is brought forward (to thee), thou to whom reverence is due in all our prayers.",
   "01.079.08": "Bring us wealth, O Agni, which may be always conquering, excellent and invincible 1 in all battles.",
   "01.079.09": "Bestow on us, Agni, through thy kindness 1 wealth which may last all our life 2, and have mercy 3 on us that we may live.",
   "01.079.10": "O Gotama 1, bring forward purified words, bring songs to the sharp-flaming Agni, desirous of his favour.",
   "01.079.11": "May he who tries to harm us, whether nigh or afar, fall down. Do thou lead us alone to increase.",
   "01.079.12": "The thousand-eyed Agni, who dwells among all tribes, scares away the Rakshas. The praiseworthy Hotri (Agni) is praised 1.",
   "01.094.01": "We have sent forward 1 with thoughtful mind this song of praise like a chariot to the worthy Gâtavedas. For blissful is his care for us in his companionship. Agni! May we suffer no harm in thy friendship.",
   "01.094.02": "He prospers for whom thou performest the sacrifice; he dwells untouched 1; he acquires abundance of heroes. He is strong; no distress overtakes him. Agni! May we suffer no harm in thy friendship.",
   "01.094.03": "May we be able to light thee. Prosper our prayers. The gods eat the sacrificial food that is offered in thee. Bring thou hither the Âdityas, for we long for them. Agni! May we suffer no harm in thy friendship.",
   "01.094.04": "Let us bring fuel and prepare sacrificial gifts for thee, awaking thy attention at each joint 1 (of the month). Help forward our prayers that we may live. Agni! May we suffer no harm in thy friendship.",
   "01.094.05": "(He is) the shepherd of the clans 1; by his nightly light the creatures walk, the two-footed and four-footed. Thou art the bright, great splendour of dawn. Agni! May we suffer no harm in thy friendship.",
   "01.094.06": "Thou art the Adhvaryu and the ancient Hotri, the Prasâstri 1, the Potri, the born Purohita 2. Knowing the duties of every priest thou givest success, O wise one. Agni! May we suffer no harm in thy friendship.",
   "01.094.07": "Thou who art beautiful, of like appearance on all sides, thou shinest forth even when afar like lightning. Thou seest, O god, even over the darkness of night. Agni! May we suffer no harm in thy friendship.",
   "01.094.08": "May the chariot of him who presses Soma, be to the front 1, O gods. May our curse overcome the malicious ones. Accept (O gods) this prayer and make it prosper. Agni! May we suffer no harm in thy friendship.",
   "01.094.09": "Strike away with thy weapons those who curse us, the malicious ones, all ghouls, be they near or afar. And make a good path to the sacrifice of him who praises thee. Agni! May we suffer no harm in thy friendship.",
   "01.094.10": "When thou hast yoked to thy chariot the two ruddy, red horses, whom the wind drives forward, and thy roaring is like that of a bull, then thou movest the trees with thy banner of smoke 1. Agni! May we suffer no harm in thy friendship.",
   "01.094.11": "And when thy grass-consuming sparks are scattered, the winged (birds) 1 also fear the noise. Then all goes well with thee and thy chariots. Agni! May we suffer no harm in thy friendship.",
   "01.094.12": "He makes Mitra and Varuna get refreshing drink. He mysteriously turns away the anger of the Maruts 1. Be merciful towards us. May their mind be again (as it was before). Agni! May we suffer no harm in thy friendship.",
   "01.094.13": "Thou art god of the gods, a wonderful Mitra (i. e. friend, of the gods) 1. Thou art the Vasu of the Vasus, welcome at the sacrifice. May we be under thy most wide-reaching protection. Agni! May we suffer no harm in thy friendship.",
   "01.094.14": "That is thy glorious (nature) that when kindled in thy own house, and fed with Soma, thou art awake 1, the most merciful one. Thou bestowest treasures and wealth on the worshipper. Agni! May we suffer no harm in thy friendship.",
   "01.094.15": "May we be of those to whom thou, O possessor of beautiful wealth, O Aditi 1, art pleased to grant sinlessness in health and wealth 2, and whom thou wilt quicken with glorious strength and with abundance of progeny.",
   "01.094.16": "Do thou, O Agni, thou who knowest (how to grant) happiness, prolong our life here, O God! May Mitra and Varuna grant us this, may Aditi, the Sindhu, the Earth, and the Sky 1!",
   "01.095.01": "Two (sisters) of different shapes wander along, pursuing a good aim. The one and the other suckles the calf 1. With the one (the calf) is golden, moving according to its wont 2. With the other it is seen clear, full of fine splendour.",
   "01.095.02": "The ten unwearied 1 young women 2 have brought forth this widely-spread germ of Tvashtri 3. Him, the sharp-faced (Agni) who is endowed with his own splendour, the shining one, they 4 carry around among men.",
   "01.095.03": "They celebrate his three births: one in the sea, one in heaven, one in the waters 1. In the eastern region 2 he commanding determines the seasons of the dwellers on earth by his present power 3.",
   "01.095.04": "Who among you has understood this hidden (god)? 1 The calf has by itself given birth to its mothers 2. The germ of many (mothers), the great seer, moving by his own strength, comes forward from the lap of the active ones 3.",
   "01.095.05": "1 The fair (child Agni) grows up visibly in them in his own glory, standing erect in the lap of the down-streaming (waters). Both (Heaven and Earth) fled away in fear of (the son of) Tvashtri 2, when he was born, but turning back they caress the lion.",
   "01.095.06": "They caress him both, like two kind women; like lowing cows they have approached him in their own way. He has become the lord of all powers 1, he whom they anoint with sacrificial gifts from the right side 2.",
   "01.095.07": "He raises his arms again and again like Savitri 1. He the terrible pressing on ranges both wings 2 (of his army). He raises up his bright vesture from himself alone 3. He gives new garments to his mothers.",
   "01.095.08": "He assumes his fierce appearance which is above (i. e. the lightning?), being united with the cows 1, the waters in his seat. The prayer purifies the bottom of the seer (?) 2. This was the meeting among the gods 3.",
   "01.095.09": "The wide space encompasses thy base, the resplendent foundation 1 of the buffalo. Agni! Being kindled protect us with all thy undeceivable guardians who are endowed with their own splendour.",
   "01.095.10": "On the dry ground he produces a stream 1, a course, a flood. With his bright floods he reaches the earth. Whatever is old he receives into his belly. He moves about within the young sprouting grass 2.",
   "01.095.11": "Thus, O Agni, being strengthened by fuel, shine thou to us with wealth-giving shine, O purifier, for the sake of glory. May Mitra and Varuna grant us this, may Aditi, Sindhu, the Earth, and the Sky!",
   "01.096.01": "Being born by strength 1 in the ancient way, lo! he (Agni) has assumed instantly all the qualities of a sage. The Waters and the Dhishanâ 2 have furthered the friend (Mitra 3). The gods have held Agni as the giver of wealth.",
   "01.096.02": "By the ancient Nivid 1, by Âyu's 2 wisdom he has procreated these children of men. With his irradiating look 3 (he has procreated) the Sky and the Waters. The gods have held Agni as the giver of wealth.",
   "01.096.03": "The Âryan clans magnified 1 him as the first performer of sacrifices, as receiving offerings, as striving forward, the son of strength, the Bharata 2, the bestower of mighty rain (?) 3. The gods have held Agni as the giver of wealth.",
   "01.096.04": "He, Mâtarisvan 1, the lord of bountiful prosperity, has found a path for (his?) offspring, he who has found the sun, the shepherd of the clans, the begetter of the two worlds. The gods have held Agni as the giver of wealth.",
   "01.096.05": "Night and Dawn, who constantly destroy each other's appearance, suckle one young calf 1 unitedly 2. The piece of gold 3 shines between Heaven and Earth. The gods have held Agni as the giver of wealth.",
   "01.096.06": "(He is) the base of wealth, the assembler of all goods 1, the beacon of sacrifice, the fulfiller of thought, the bird 2. In order to guard their immortality the gods have held him, Agni, as the giver of wealth.",
   "01.096.07": "Him who is now and who was formerly the abode of wealth, the earth 1 (i. e. the dwelling-place or support) of what is born and of what will be born, the shepherd and guardian of what is and of much that comes into being. The gods have held Agni as the giver of wealth.",
   "01.096.08": "May (Agni,) the giver of wealth, present us with quick wealth. May the giver of wealth (present us with wealth) united with strong men 1. The giver of wealth (should grant us) food together with valiant heroes. The giver of wealth should grant us long life.",
   "01.097.01": "Driving away evil 1 with thy light, Agni, shine upon us with wealth—driving away evil with thy light.",
   "01.097.02": "Longing for rich fields, for a free path, and for wealth, we sacrifice—driving away evil with thy light.",
   "01.097.03": "1 When he stands forth as the most glorious one among them 2, and when our liberal lords excel—driving away evil with thy light—",
   "01.097.04": "When through thee, Agni, the liberal lords, and when through thee we may multiply with offspring—driving away evil with thy light—",
   "01.097.05": "When the rays of the mighty Agni go forth on all sides—driving away evil with thy light—",
   "01.097.06": "For thou indeed, (O god) whose face is turned everywhere, encompassest (the world) everywhere—driving away evil with thy light.",
   "01.097.07": "Do thou carry us, as with a boat, across hostile powers, (O god) whose face is turned everywhere—driving away evil with thy light.",
   "01.097.08": "Do thou carry us across (evil) to welfare, as across a stream with a boat 1—driving away evil with thy light.",
   "01.098.01": "May we dwell in the favour of (Agni) Vaisvânara. He indeed is a king, leading all beings to gloriousness 1. As soon as born from here he looks over this whole world. Vaisvânara unites with the Sun 2.",
   "01.098.02": "Agni who has been looked and longed for 1 in Heaven, who has been looked for on Earth—he who has been looked for, has entered all herbs. May Agni Vaisvânara, who has strongly been looked for, protect us from harm by day and by night.",
   "01.098.03": "Vaisvânara! May this be true of thee: may wealth and liberal givers attend us! May Mitra and Varuna grant us this, may Aditi, the Sindhu, the Earth, and the Sky!",
   "01.099.01": "Let us press Soma for Gâtavedas 1. May he burn down the property of the niggard 2. May he, Agni, bring us across all troubles, across all difficulties, as across a stream with a boat.",
   "01.127.01": "I deem Agni to be the munificent Hotri, the Vasu, the Son of strength 1, Gâtavedas, like a priest, Gâtavedas 2: the best performer of the sacrifice, the god who with his upright body that is turned towards the gods, and with his flame longs for the shine of the (boiling) ghee 3, of the butter that is offered in (the fire).",
   "01.127.02": "May we, the sacrificers, call thee hither, the best of sacrificers 1, the first of the Aṅgiras, O priest, with our prayers, with priestly prayers, O bright one 2: thee who like the heaven encompassest the earth 3, the Hotri of human tribes, the manly flame-haired, whom these folks—whom all folks should favour in order to speed him (to our sacrifice).",
   "01.127.03": "He indeed, shining mightily with his shining strength 1, becomes the conqueror of deceitful foes 2—like an axe, the conqueror of deceitful foes 2. He at whose onslaught 3 even what is strong melts away 4, steady things (waste away) like forests (which are burnt or bend down in the storm) 5. Conquering he holds himself back; he does not proceed 6. As with a conquering bow-man he proceeds 6.",
   "01.127.04": "Even what is firm gives way before him: thus it is known. With hottest kindling-sticks 1 one worships him 2 for winning his favour, one worships Agni for winning his favour. He who dives into many forests as if carving the wood with his flame, destroys even firm food 3 with his strength—he destroys even what is firm with his strength.",
   "01.127.05": "Let us place that power 1 of his in our neighbourhood 2—(that power) which is more visible by night than by day 3—(more visible) than by day to the unremitting 4 (worshipper). Therefore his life is a firm hold 5, like (a father's) safe refuge to a son: (the fires) that never grow old, tending to blessings enjoyed or not enjoyed (before) 6—the fires that never grow old, tending (to such blessings).",
   "01.127.06": "He indeed makes a mighty noise like the host of the Maruts, … 1 on the rich fields, … 1 on the … 1. He, the seizer, ate the offerings 2, he who has deservedly become the banner of the sacrifice. And when he joyously and joyfully (proceeds), all followed gladly on his path; men (have followed) his path as for a triumphal procession.",
   "01.127.07": "When forsooth the Kîstas 1 striving for heaven, when the Bhrigus have addressed him paying reverence—the Bhrigus producing him by attrition, with worship: Agni is the lord of goods, the bright one, who is their 2 supporter. May the wise one accept the wonted coverings 3; may the wise one accept them.",
   "01.127.08": "We invoke thee, the lord of all people, the common master of the house of all, to enjoy (the sacrifice): (we call) thee who truly art carried by prayers as by a vehicle 1 to enjoy (the sacrifice): the guest of men in whose presence (they live) as before a father's (face), and all those immortals (attain) to strength, and the offerings among the gods (attain) to strength.",
   "01.127.09": "Thou, O Agni, art born, the mightiest by might 1, for the divine world, the strongest one, like wealth for the divine world. For thy delight is most strong, and thy power is most brilliant. And they walk around thee 2, O (god) who never growest old, like obedient (servants), O (god) who never growest old.",
   "01.127.10": "Let your praise go forth to the great Agni, who is mighty in his might, who awakens at dawn, like a winner of cattle 1—let it go forth to Agni. When (the worshipper) rich in offerings has loudly praised him 2 in all lands 3, he wakes 4 like a singer in front of the dawns 5, the flaming one (?), the Hotri (in front) of the dawns 5.",
   "01.127.11": "Thus being seen by us, bring near to us, O Agni, graciously united with the gods, benignantly, great wealth benignantly. Make us behold great (bliss of valiant offspring 1), O mightiest one, that we may obtain such enjoyment. Produce great bliss of valiant offspring, O bountiful Lord, (as fire is produced) by attrition, for those who praise thee, like a strong hero in thy might.",
   "01.128.01": "He was born in Manu's firm law 1, the Hotri, the best sacrificer, according to the will of the Usigs 2, Agni, according to his own will. Always listening to him who wishes to be his friend, like a treasure to him who aspires to renown, the unbeguiled Hotri sat down in the abode of food (on the altar); enveloped 3 (he sat down) in the abode of food.",
   "01.128.02": "We render him attentive 1, the promoter of sacrifice, on the path of Rita, by adoration with offerings, in the divine world, by (adoration) with offerings  2. In bringing us vigour he never becomes worn out with this body of his: he whom Mâtarisvan (has brought) to Manu from afar, the god whom he has brought from afar.",
   "01.128.03": "In his (own) way he moves in one moment round the terrestrial (space), the sudden devourer (emitting) his sperm, the bellowing bull emitting his sperm, the bellower 1, looking round with a hundred eyes, the god who quickly courses in the forests 2, taking his seat on the lower ridges, Agni, and on the highest ridges.",
   "01.128.04": "This highly wise Purohita, Agni watches sacrifice and service 1 house by house; by (the power of) his mind he is intent upon sacrifice. By (the power of) his mind helpful to him who desires food 2, he looks on all creatures, since he has been born, the guest adorned with ghee, (since) the helpful carrier (of the gods) 3 has been born.",
   "01.128.05": "When through his (Agni's) power the bounties grow in strength, with the roar of Agni 1 as with that of the Maruts 2—like bounties offered to a vigorous man: then he by his greatness stirs up the gift of goods. May he protect us from misfortune and injury, from evil spell and injury.",
   "01.128.06": "The far-reaching 1 steward 2 has taken all goods 3 in his right hand, and strongly advancing does not let them loose; desirous of glory he does not let them loose. For every supplicant 4 thou hast carried the oblations to the gods 5. For every righteous one he procures a treasure; Agni opens both folds of the door (for him).",
   "01.128.07": "He has been established as the most blissful one in the enclosures of men, Agni, at the sacrifices, like a noble lord of the clans, a beloved lord of the clans at the sacrifices: he rules over the oblations of men to which nourishing power has been imparted 1. May he protect us from harm that comes from Varuna, from harm 2 that comes from the great god.",
   "01.128.08": "They magnify Agni the Hotri, the dispenser of goods. They have roused the beloved, the most shining steward 1 (of sacrifice); they have roused the carrier of oblations. The gods desirous of goods (have roused) him in whom all life dwells, who possesses all wealth, the Hotri, the worshipful sage, the lovely one for the sake of bliss; with praises (they have roused), desirous of goods, the lovely one.",
   "01.140.01": "For him who sits on the Vedi (i. e. on the sacrificial bed), whose foundations are pleasant, for the brilliant Agni bring forward 1 a receptacle 2, which is to him like a drink. Clothe 1 the bright one in prayer as in a garment, him whose chariot is light, whose colour is bright, the destroyer of darkness.",
   "01.140.02": "He who has a twofold birth 1, presses on towards the threefold food 2; what he has eaten grows again after a year 3. With the mouth and the tongue of the one he (shows himself as) the noble, manly one; with the other (mouth) the stubborn (Agni) wipes off the trees 4.",
   "01.140.03": "Both his mothers 1, dwelling together, immersed in darkness, and affrighted, proceed towards the young child who stretches forward his tongue, who sparkling moves about thirstily, whom men should attach to themselves, who agitates (the world), the increaser of his father 2.",
   "01.140.04": "Thy speedy (teams) 1 that strive to break loose for the benefit of the man who acts as men do, the swift ones, drawing black furrows-thy quick (horses), striving apart, the agile, swift runners, incited by the wind, are yoked.",
   "01.140.05": "When he stroking his wide course proceeds panting, thundering, roaring, then those sparkling (rays) of his fly about wildly, displaying wondrous darkness, a large sight 1.",
   "01.140.06": "When he bends down over the brown (plants) 1 like a busy (servant), he roars and approaches his wives like a bull. Displaying his power he adorns his bodies with beauty; like a terrible beast, difficult to seize, he shakes his horns.",
   "01.140.07": "He clasps (the plants, &c.) that have been laid together and have been laid out 1. Knowing them, while they know him, and being their own (friend or lover) he lies on them. They grow again and attain godhead. They produce together another shape of the parents 2.",
   "01.140.08": "The long-haired virgins 1 have embraced him. Having died they stand upright again for him (Agni) the living one (or, for him the Âyu). Delivering them of old age he proceeds roaring, procreating another vital spirit, an indestructible life.",
   "01.140.09": "Licking everywhere the upper garment of the mother 1, he spreads himself over the space with his mightily devouring warriors, giving strength to everything that has feet, licking and licking. The reddish white one 2 follows her ways 3.",
   "01.140.10": "Shine, O Agni, among our liberal lords, for thou art a mightily breathing bull, a friend of the house. Throwing down the (mothers) of the young child 1 thou hast shone, (a protector of thy friends) like a coat of mail in battles, hurrying around.",
   "01.140.11": "May this well-composed (prayer), O Agni, be more welcome to thee than a badly-composed one—more welcome than even a welcome prayer. With the bright light of thy body win thou treasures for us.",
   "01.140.12": "Grant us, Agni, for our chariot and for our house a ship which has its own rudders and which has feet 1, which may save our strong men and our liberal lords and our people, and which may be a shelter for us.",
   "01.140.13": "Approve, O Agni, our hymn alone. May Heaven and Earth and the Rivers, delightful by their own nature 1, going their way 2, (choose for us) bliss in cows and crops, long days; may the red (Dawns) choose food for us as a choice boon.",
   "01.141.01": "Lo, that beautiful splendour of the god, when he was born of strength, has truly come to be a wondrous sight. Though he slinks away 1, the prayer goes straight to him 2. They have led forward the flowing streams of Rita.",
   "01.141.02": "The powerful one 1, rich in food, the true (friend of men) has entered the wondrous (body) 2. His second (form of existence) is in the seven kind mothers 3. The ten young females 4 have brought the third (form) of this bull forth, him the guardian, in order to milk him.",
   "01.141.03": "When the rulers, the liberal lords brought him forth by their power out of the depth, out of the buffalo's shape 1, when from of old 2 at the purification of the sweet drink 3 Mâtarisvan produces the hidden one (i. e. Agni) by attrition—",
   "01.141.04": "When he is led forward from the highest father 1, he climbs up the … 2, the plants in his (or, in their?) houses. When 3 both (Heaven and Earth or the two Aranis?) promote his birth, then the youngest one became bright by his heat 4.",
   "01.141.05": "Then he entered upon the mothers 1 in whom he the bright one grew up far and wide unimpaired 2. When he has climbed up to the former (mothers) who from of old incite (him) 3, he runs down in the younger, later (or, nearer) ones.",
   "01.141.06": "1 Then in the strivings for the day 2 they choose him Hotri. As if to swell their good fortune they strive towards him 3, when praised by many he moves everywhere with wisdom and power to the gods and to the praise of mortals 4 for (bringing them) refreshing drink.",
   "01.141.07": "When he has scattered himself, the worshipful one, driven by the wind, like … 1, with the sound (which he produces) (?), he whom it is not possible to drive to a place (like cattle): on the flight of the burning one who speeds on his black way, whose birth is bright, who strays everywhere to the atmosphere … 2.",
   "01.141.08": "Like a chariot that goes forward, he goes to Heaven with his ruddy limbs, adorned with his locks of flames 1. Then his black (clouds of smoke), O burning one (?), the liberal ones (?) (appear) 2. The birds flee as before the fierceness of a hero 3.",
   "01.141.09": "Through thee indeed, O Agni, Varuna whose laws are firm, Mitra and Aryaman, the givers of good rain, are glorious, when thou the mighty one hast been born, everywhere encompassing with wisdom (all beings), as the felly encompasses the spokes of a wheel.",
   "01.141.10": "Thou, O Agni, youngest (god), furtherest treasures and (the friendship of) the gods for him who performs worship, who presses Soma. May we thus establish thee the young one, O young (son) of strength, possessor of great treasures, like the winner in a race 1.",
   "01.141.11": "Make good fortune 1 swell for us like well-employed wealth belonging to the house, and like firm ability 2—(fortune) which can hold both races 3 like reins: and being full-of good-will in (the sphere of) Rita, (fill our) praise of the gods (with rich reward).",
   "01.141.12": "And may the brilliant, joyful Hotri with quick horses, with a shining chariot hear us. May he, the wise Agni, lead us on the best leading (paths) to happy welfare and to bliss.",
   "01.141.13": "Agni has been praised with powerful 1 songs, he who has been brought forward furthermore for sovereignty. May both those our liberal lords and we ourselves spread out 2 (our power over all foes) as the sun (spreads out its light and by it destroys) the mist.",
   "01.142.01": "Being inflamed, Agni, bring hither to-day the gods to the man who holds forth the (sacrificial) ladle. Spin out the ancient thread (of sacrifice) 1 for the sacrificer who has prepared Soma.",
   "01.142.02": "Measure out, O Tanûnapât 1, the sacrifice rich in ghee, rich in honey, of a priest like me, of a sacrificer who has toiled hard.",
   "01.142.03": "The brilliant, purifying, wonderful Narâsamsa 1 mixes the sacrifice with honey three times a day, the god worthy of worship among the gods.",
   "01.142.04": "Agni, magnified 1 by us, bring hither the bright, beloved Indra. For this my prayer is addressed 2 to thee whose tongue is good.",
   "01.142.05": "(Priests) hold forth the (sacrificial) ladle, strewing the sacrificial grass at the decorous service of the sacrifice;—I 1 trim 2 (the sacrificial grass) which best receives the gods with its wide extent, a big shelter for Indra.",
   "01.142.06": "1 May the divine doors open themselves, the increasers of Rita, the never sticking, large ones, the purifying, much-desired (doors), that the gods may come forth.",
   "01.142.07": "May Night and Dawn, of glorious appearance, the two neighbouring (goddesses), wearing beautiful ornaments 1, the young 2 mothers of Rita, sit down together on the sacrificial grass 3.",
   "01.142.08": "May the two divine Hotris, eager in praising (the gods), the sages with lovely tongues, perform for us to-day this successful sacrifice which attains to Heaven.",
   "01.142.09": "The brilliant (goddess) placed among the gods, among the Maruts 1, Hotrâ Bhâratî 2, Ilâ, Sarasvatî, and Mahî 3: may these worshipful (goddesses) sit down on the sacrificial grass.",
   "01.142.10": "May Tvashtri, inclined towards us, pour forth for us, in our navel 1, that wonderful seed with many treasures 2, plentiful by itself, for the sake of prosperity and wealth 3.",
   "01.142.11": "Letting go (the sacrificial food to the gods) sacrifice by thyself to the gods, O tree 1. May 2 Agni make the offerings ready 3, the god among the gods, the wise one.",
   "01.142.12": "For Him who is accompanied by Pûshan and by the Maruts, by the Visve devâh, (by) Vâyu 1, who is moved by the Gâyatra song, for Indra pronounce the Svâhâ over the offering.",
   "01.142.13": "Come hither to the offerings over which the Svâhâ has been pronounced, in order to feast. Indra! Come hither! Hear our call! Thee they call at the worship.",
   "01.143.01": "I bring forward my most powerful, entirely new (pious) thought (i. e. hymn). the prayer of my words 1 to Agni, the son of strength; he is the child of the Waters 2, the beloved one, who together with the Vasus has sat down on the Earth as a Hotri observing the appointed time (for sacrificing).",
   "01.143.02": "Being born in the highest heaven Agni became visible to Mâtarisvan. By the power of his mind, by his greatness when kindled, his flame filled Heaven and Earth with light.",
   "01.143.03": "1 His flames are fierce; never ageing are the flames of him who is beautiful to behold, whose face is beautiful, whose splendour is beautiful. The never sleeping, never ageing (rays) of Agni whose power is light, roll forward like streams across the nights (?) 2.",
   "01.143.04": "Him the all-wealthy, whom the Bhrigus have set to work on the navel of the earth, with the whole power of the world 1—stir up that Agni by thy prayers in his own house—(him) who alone rules over goods like Varuna.",
   "01.143.05": "He who is not to be kept back like the roar of the Maruts, like an army 1that is sent forward, like the thunderbolt of heaven—Agni eats with his sharp jaws, he chews, he throws down the forests as a warrior throws down his foes.",
   "01.143.06": "Would Agni eagerly come to our hymn? Would He the Vasu together with the Vasus fulfil our desire? Will He, the driver, stir our prayers that they may be successful? (Thus thinking) I praise Him whose face is bright, with this my prayer.",
   "01.143.07": "He who has kindled him strives 1 towards Agni as towards Mitra (or, towards a friend)—(to Agni) whose face shines with ghee, the charioteer of Rita. May he who when kindled becomes a racer 2, shining at the sacrifices 3, lift up our bright-coloured prayer.",
   "01.143.08": "1 Preserve us, O Agni, never failing with thy never-failing, kind and mighty guardians; protect our people all around with those undeceived, undismayed, never slumbering (guardians), O thou our wish 2!",
   "01.144.01": "The Hotri 1 goes forward 2 (in order to fulfil) his duty by his wonderful power, directing upwards the brightly adorned prayer. He steps towards the (sacrificial) ladles which are turned to the right 3 and which first kiss his foundation 4.",
   "01.144.02": "They have greeted with shouts the streams of Rita 1 which were hidden at the birthplace of the god, at his seat. When He dwelt dispersed in the lap of the waters, he drank the draughts by (the power of) which he moves 2.",
   "01.144.03": "Two (beings) of the same age 1 try to draw that wonderful shape (Agni) towards themselves, progressing in turns towards a common aim 2. Then he is to be proclaimed by us like a winner 3 (in a contest). The charioteer 4 (governs all things) as if pulling in the reins of a draught-horse.",
   "01.144.04": "He whom two (beings) of the same age 1 serve, two twins dwelling together in one common abode, the gray one has been born as a youth by night as by day 2, the ageless one who wanders through many generations of men.",
   "01.144.05": "The prayers, the ten fingers 1 stir him up. We, the mortals, call him, the god, for his protection. From the dry land he hastens to the declivities 2. With those who approached him he has established new rules 3.",
   "01.144.06": "Thou indeed, O Agni, reignest by thy own nature over the heavenly and over the terrestrial world as a shepherd (takes care of his cattle). These two variegated, great (goddesses) striving for gloriousness, the golden ones who move crookedly 1, have approached thy sacrificial grass.",
   "01.144.07": "Agni! Be gratified and accept graciously this prayer, O joy-giver, independent one, who art born in the Rita, good-willed one, whose face is turned towards us from all sides, conspicuous one, gay in thy aspect, like a dwelling-place rich in food 1.",
   "01.145.01": "Ask ye him. He has come. He knows. He the intelligent one moves forward; He moves along (his way) (?) 1. In him all commands, all wishes dwell. He is the lord of strength, of mighty power.",
   "01.145.02": "They ask him. He himself 1 does not ask in turn what he, the wise one, has grasped by his own mind alone 2. He does not forget the first word nor another word. Unconfused he adheres to his own power of mind.",
   "01.145.03": "To him go the sacrificial ladles, to him go the racers 1. He alone may hear all my words. He who pronounces many praishas 2, the conqueror, the accomplisher of sacrifices whose blessings are flawless, the young child has assumed vigour.",
   "01.145.04": "When he has come together 1 (with his companions 2), he goes to greet them 3. As soon as born he steals upon (his prey) together with his companions. He strokes the … 4 to give him delight and joy, when the loving ones 5 approach him who stands on them 6.",
   "01.145.05": "He, the animal living in the water and walking in the forest 1, has been placed on the highest skin 2 (sky?). He has proclaimed his rules to the mortals: for Agni, the knowing one, is intent upon Rita (Right) and is true.",
   "01.146.01": "I praise Agni who has three heads and seven rays (or reins) 1, who is without flaw, sitting in the lap of his parents 2 and of whatever moves or is firm, who has filled (with his light) all the lights of Heaven.",
   "01.146.02": "The big bull has grown up to them 1; the ageless one who from here (from this world) distributes his blessings, the tall has stood up erect. He puts down his feet on the surface of the wide (Earth); his red ones 2 lick the udder (the cloud?).",
   "01.146.03": "Walking towards their common calf the two well-established 1 milch-cows 2 walk about in different directions. They measure interminable paths; they have invested themselves with all great desires.",
   "01.146.04": "Wise poets 1 follow his track 2 who in manifold ways protect the ageless one with their hearts. Wishing to acquire him they have searched the river 3. He the Sun 4 became visible to them, to the men 5.",
   "01.146.05": "He is worthy to be looked for, round about in his race-courses, the noble who is to be magnified 1, the great one 2, in order that the small may live, as he, the all-visible liberal lord, has become a progenitor for those germs in many places.",
   "01.147.01": "How, O Agni, have the resplendent ones worshipped thee, aspiring through the powers of the Âyu 1, when 2 the gods, obtaining kith and kin of both races 3 (human and divine?), rejoiced in the song of Rita (or Right) 4?",
   "01.147.02": "Give heed to this my proffered hymn, O youngest one, which is most rich in liberal gifts 1, O self-dependent one! The one abuses thee, the other praises thee: I thy reverer revere thy body, O Agni 2!",
   "01.147.03": "Thy guardians, O Agni, who saw and saved the blind son of Mamatâ from distress 1—he the possessor of all wealth has saved them who have done good deeds 2. The impostors, trying to deceive, have not deceived.",
   "01.147.04": "The niggard, O Agni, the harmful and malicious who injures us by falsehood: may the heavy spell recoil on him; may he injure his own body by his evil words 1.",
   "01.147.05": "And, O strong one, whatever mortal knowingly injures another mortal by falsehood: from such a one, O praised Agni, protect him who praises thee. Agni! Do not deliver us to distress.",
   "01.148.01": "When Mâtarisvan … 1 had produced by attrition the Hotri, the … 2 who belongs to all gods, whom they have established among the human clans, shining like the sun, resplendent that (he might show his beautiful) shape.",
   "01.148.02": "They did not deceive him 1 who had granted a hymn (to the worshipper). Agni is my protection; therewith he is satisfied. They took pleasure in all his 2 works—(in the works) of the singer who brought praise.",
   "01.148.03": "Whom the worshipful (gods) 1 took and placed in his own seat (as priest) with their praises: him they 2 have carried forward, taking hold of him in their search, hastening like horses that draw a chariot.",
   "01.148.04": "The marvellous one destroys many things with his jaws. Then 1 the resplendent one shines in the forest. Then the wind blows after his flame day by day as after the arrow of an archer, after a weapon that has been shot.",
   "01.148.05": "Him whom no impostors, no harmful foes 1, no harm-doers may harm when he dwells in (his mother's) womb, him the blind ones bereft of sight did not damage by looking at him 2. His own friends have protected him.",
   "01.149.01": "1 Towards great wealth this lord of the house 2 advances 3, the strong one in the abode of strong wealth. Let the stones honour him as he speeds forward.",
   "01.149.02": "He the manly (bull) as of men so of the two worlds, whose stream is drunk by living beings 1 in consequence of his renown—he who running forward has ripened in (his mother's) womb.",
   "01.149.03": "He who lighted up the … 1 stronghold, the racer, the sage, like a … 2 horse, shining like the sun, endowed with hundredfold life.",
   "01.149.04": "He who has a twofold birth (celestial and terrestrial), the flaming one has approached the threefold light, all spaces of the atmosphere, the Hotri, the best sacrificer, in the abode of the Waters.",
   "01.149.05": "This is the Hotri having a twofold birth 1 who has bestowed all the best gifts, out of desire of glory, on the quick mortal who worships him.",
   "01.150.01": "I thy indigent 1 worshipper say much to thee, O Agni, dwelling in thy protection as (in the protection) of a great impeller 2.",
   "01.150.02": "Away even from the libation of a rich man who is feeble, who is a niggard, who never comes forward and does not care for the gods.",
   "01.150.03": "The mortal (who worships thee?), O priest, is brilliant, great, most powerful in heaven. May we, O Agni, addicted to thee, be always foremost.",
   "01.188.01": "Being kindled thou reignest to-day, a god with the gods, O conqueror of thousandfold (wealth)! As messenger, as a sage, carry the oblations (to the gods).",
   "01.188.02": "O Tanûnapât! For him who walks in righteousness the sacrifice is anointed with honey. May he 1 grant thousandfold food.",
   "01.188.03": "Receiving libations, worthy of being magnified 1 bring hither to us the worshipful gods. Agni! Thou art a winner of thousandfold (bliss).",
   "01.188.04": "They have spread with might the eastward-turned sacrificial grass, blessing (our tribe) with a thousand men 1, (at the place) where you reign, O Âdityas!",
   "01.188.05": "The Prince, the Sovereign, the mighty ones, the eminent ones 1, the (Divine) Doors, which are many and more than many, have sent forth streams of ghee.",
   "01.188.06": "Adorned with gold, wearing beautiful ornaments you verily reign high 1 in your splendour. Sit down here, ye two Dawns 2.",
   "01.188.07": "May the two fine-voiced divine Hotris, the sages, perform as the first this sacrifice for us.",
   "01.188.08": "Bhâratî! Ilâ! Sarasvatî! All ye (goddesses) whom I invoke, promote us to splendour.",
   "01.188.09": "Tvashtri indeed, the eminent (god) has shaped all forms, all cattle. Do thou by sacrifice produce their increase.",
   "01.188.10": "Yield up by thyself, O tree, (the sacrificial food) to the abode of the gods 1. May Agni make the offerings relishable.",
   "01.188.11": "Agni going in front of the gods is anointed with this Gâyatra song; he shines when Svâhâ is pronounced (over the oblations).",
   "01.189.01": "Agni! Lead us to wealth on a good path, O god who knowest all rules. Drive away from us sin which leads us astray. We will offer to thee the fullest praise.",
   "01.189.02": "Agni! Thou who art young, help us safely across all difficulties. Be for us a broad, large, wide stronghold, for our kith and kin, with luck and weal 1.",
   "01.189.03": "Agni! Drive away from us all plagues. (Then) they shall plague 1 peoples who do not stand under Agni's protection. (Give) us back again the earth, O god, together with all the immortals, O worshipful one, that it may go well with us.",
   "01.189.04": "Protect us, Agni, with thy unwearied guardians, thou who flamest in thy beloved seat. May no danger, O youngest of the gods, attain thy praiser, not now nor in future, O mighty one!",
   "01.189.05": "Do not deliver us, O Agni, to the harmful foe, to the greedy one, to the impostor, to misfortune. Do not surrender us, O mighty one, to one who has teeth, who bites, nor to one who has no teeth, nor to one who will hurt us.",
   "01.189.06": "May a (god) like thee, O Agni, who art born according to Rita, being praised spread out a shelter for the body (of the worshipper that protects) from every one who tries to harm or to revile him. For thou, O god, art a descrier 1 of everything that leads us astray.",
   "01.189.07": "1 Thou, O Agni, distinguishing both (kinds of men, the pious and the impious, or the Aryans and the Dasyus 2), eagerly approachest (Aryan) men at (the time of) the advancing (day) 3, O worshipful one. At (the time of) rest thou hast become governable to the man (or, to Manu; or, thou art to be praised by men 4); thou art to be smoothed down like a horse 5 by the Usigs.",
   "01.189.08": "We have pronounced our invocations, I the son of Mâna 1, before this mighty Agni. May we obtain (our wishes) through a thousand Rishis. May we find a food-giving … rich in quickening rain 2.",
   "02.001.01": "1 Thou, O Agni, the flaming one, (art born) from out the Heavens 2, thou (art born) from out the Waters and the stone (the flint); thou (art born) from out the forests and the herbs; thou art born bright, O Lord of men, (as belonging) to men 3.",
   "02.001.02": "1 To thee, O Agni, belongs the Hotri's and the Potri's office exercised at the appointed season; to thee belongs the office of the Neshtri; thou art the Agnîdh 2 for the righteous. To thee belongs the office of the Prasâstri; thou actest as an Adhvaryu, and thou art the Brahman and the master of the house in our house 3.",
   "02.001.03": "1 Thou, O Agni, art Indra, a bull among (all) beings. Thou art the wide-ruling Vishnu, worthy of adoration. Thou art the Brahman, a gainer of wealth, O Brahmanaspati 2. Thou, O Vidhartri (i. e. who keepest asunder all things), art united with Puramdhi (or the Liberality of the gods) 3.",
   "02.001.04": "Thou, O Agni, art the king Varuna whose laws are firm; thou becomest Mitra, the wondrous one, worthy of being magnified. Thou art Aryaman, the lord of beings, whom I may enjoy 1. Thou, O god, art Amsa 2, desirous of distributing (goods) in the assembly 3.",
   "02.001.05": "Thou, O Agni, being Tvashtri, (grantest) to thy worshipper abundance in heroes. To thee, who art accompanied by the (divine) wives 1, who art great like Mitra, belongs relationship 2. Thou, the quick inciter 3, givest abundance in horses. Thou, rich in wealth, art the host of men 4.",
   "02.001.06": "Thou, O Agni, art Rudra, the Asura of the high Heaven 1; thou, being the host of the Maruts, rulest over nourishment. Thou goest along with the flame-coloured Winds, bringing happiness to our home. Thou, being Pûshan, protectest thy worshippers by thy own might.",
   "02.001.07": "Thou, O Agni, art a giver of wealth to him who does service to thee 1; thou art the god Savitri, a bestower of treasures. Thou, being Bhaga, O lord of men, rulest over wealth. Thou art a protector in his house to him who has worshipped thee. 2.",
   "02.001.08": "Towards thee, in the house, the lord of the clan, O Agni, the clans strive, towards thee, the bounteous king. Thou with the beautiful face possessest all things. Thou art equal to thousands, to hundreds, to ten (of others).",
   "02.001.09": "Thee, O Agni, men (make) their father by their sacrifices 1; thee who shinest with thy body they (invite) to brotherhood by their (sacrificial) work. Thou becomest a son to him who has worshipped thee. As a kind friend thou protectest against attack.",
   "02.001.10": "Thou, O Agni, art Ribhu, to be adored when near. Thou rulest over strength 1, over wealth rich in food. Thou shinest 2, thou burnest for the sake of giving (wealth). Thou art a hewer 3, an expander of sacrifice.",
   "02.001.11": "Thou, Agni, O god, art Aditi to the worshipper. Thou, being Hotrâ Bhâratî 1, growest strong by prayer. Thou art Idâ, living a hundred winters, for (the increase of) ability. Thou, the killer of Vritra, O Lord of wealth, art Sarasvatî 2.",
   "02.001.12": "Thou, O Agni, well kept, art the highest vital power. In thy lovely colour and in thy appearance (dwell all) beauties. Thou art great strength that carries us forward. Thou art abundant wealth, extending on all sides.",
   "02.001.13": "The Âdityas have made thee, O Agni, their mouth; the bright ones have made thee their tongue, O Sage. The Râti-sâk gods (i. e. the 'bounteous' gods) accompany thee at the sacrifices. In thee the gods eat the offering which is offered to them.",
   "02.001.14": "In thee, O Agni, with (thy) mouth 1 all the guileless 2 immortal gods eat the offering which is offered to them. Through thee the mortals taste their drink. Thou hast been born, the bright one, as the child of the plants.",
   "02.001.15": "1 Thou art united with them and equal to them in strength, O well-born Agni, nay, thou surpassest them, O god, when thy power 2 has expanded here in its greatness over Heaven and Earth, over both worlds.",
   "02.001.16": "The liberal lords who pour out, O Agni, over thy praisers gifts at the head of which there are cows 1, the ornament of which are horses: lead both ourselves and them to welfare. May we speak loud in the assembly 2, rich in valiant men.",
   "02.002.01": "Increase Gâtavedas by your sacrifice 1, worship Agni for ever with your offering and your prayer 2—him who has been kindled, the receiver of good offerings, the solar hero, the heavenly Hotri, the charioteer 3 in our settlements 4.",
   "02.002.02": "For thee Nights and Dawns have been lowing, O Agni, as milch-cows in the folds for their calf 1. A steward 2, as it were, of Heaven, thou shinest on the human tribes, O bountiful one, on continuous nights 3.",
   "02.002.03": "The gods have set him to work, as a steward 1 of Heaven and Earth, endowed with wonderful power, at the bottom of the air: Agni who is well known like a chariot 2, brightly shining, deserving of praise like Mitra (or, like a friend) in (human) dwellings.",
   "02.002.04": "They have established him who grows in the air, in his house, the serpent 1 with beautiful splendour like gold 2, the winged (son?) of Prisni 3 who lights up with his eyes both tribes (of gods and of men), like a guardian of the way (?) 4.",
   "02.002.05": "May he, the Hotri, encompass the whole sacrifice. Men strive towards him with offerings and prayer. (Agni) with golden jaws 1, hurrying around in the growing (plants) 2, lighted up the two worlds like the Sky with the stars.",
   "02.002.06": "Thus mayst thou, being brightly kindled for our welfare or being exhausted (?) 1, shine upon us with thy wealth. Carry hither to us the two worlds for the sake of happiness, Agni, O god, that they may eagerly partake 2 of the offering of the man (or, of Manus).",
   "02.002.07": "Give us, Agni, mighty, give us thousandfold (gifts). Open strength for us like a door 1 for the sake of glory. Make Heaven and Earth inclined towards us through (our) spell. Make the Dawns shine like the brilliant Sun.",
   "02.002.08": "Being kindled after dawns and nights may he shine with his red light like the sun, Agni, being a good sacrificer with the help of the offerings of man (or, of Manus) 1, the king of the clans, and the welcome guest of Âyu.",
   "02.002.09": "Thus, O Agni, ancient one, our human prayer has prospered among the immortals who dwell in the great heaven. May the cow 1 when milked, yield 2 freely to the singer in our settlements hundredfold (wealth) of all kinds.",
   "02.002.10": "May we, O Agni, (attain) bliss in valiant men by our racers, or may we shine over (all) people by our sacred spells. May our unconquerable lustre beam on high like the sun over the fivefold dwellings (of the five peoples).",
   "02.002.11": "Be thou, O mighty one, worthy of praise among us, (thou) from whom the well-born, liberal (lords) have sought nourishment 1, unto whom the strong ones, O Agni, go for sacrifice, who shinest in thy abode among (the worshipper's) own kith.",
   "02.002.12": "May we both, O Gâtavedas, the praisers and the liberal (lords), be in thy protection, O Agni. Help us to good, resplendent, abundant wealth which is accompanied by offspring, by good progeny.",
   "02.003.01": "Agni being kindled, set down on the earth, has stood up with his face towards all worlds. May the Hotri, the purifier, the ancient, wise one, may god Agni sacrifice to the gods, he who is worthy (of being the sacrificer).",
   "02.003.02": "Narâsamsa, anointing the abodes (of the sacrifice), equal by his greatness to the three heavens, endowed with beautiful light, moistening the offering, his mind being intent on scattering ghrita—may he anoint the gods on the summit of sacrifice.",
   "02.003.03": "Being magnified 1 in our mind, Agni, sacrifice for us to-day to the gods before the human (sacrificer) 2, thou who art worthy (of being the sacrificer). Conduct hither the unshakable host of the Maruts. Sacrifice, O men, to Indra who sits on the Barhis.",
   "02.003.04": "O divine Barhis! On this (Barhis) which is large, rich in valiant men, which has been spread on this Vedi (or sacrificial altar) rich in gain, ready for wealth, which is anointed with ghrita, sit down, O Vasus, O Visve devâs, O Âdityas 1 worthy of worship!",
   "02.003.05": "May the divine doors which are easily passable, open themselves wide when invoked with adoration. May they, the far-embracing, undecaying ones, open wide, purifying our glorious race 1 which is rich in valiant men.",
   "02.003.06": "May Dawn and Night, grown strong from of old, joyful like two birds (?) 1, (do) their work well for us—they who weave, turned towards each other, the stretched-out warp, the ornamented form of the sacrifice 2, (the two goddesses) flowing with plenty, rich in milk.",
   "02.003.07": "May the two divine Hotris, the first ones, very knowing, very marvellous, perform the sacrifice rightly with their (sacrificial) verse. Sacrificing to the gods they anoint (them) 1, observing the right time, on the navel of the Earth, over the three ridges (of the three worlds).",
   "02.003.08": "May Sarasvatî, the accomplisher of our prayer, may the goddess Ilâ, all-victorious Bhâratî—may the three goddesses, according to their wont, sit down on this Barhis and protect it, the faultless shelter.",
   "02.003.09": "Through (the god's) hearing (our prayer) a manly son is born (to us), tawny-coloured, rich in gain, bringing vigour, loving the gods. May Tvashtri deliver for us a son, the navel (i. e. the tie that binds generations together), and may he then go to the abode of the gods.",
   "02.003.10": "1 May the tree (i. e. the sacrificial post) stand by, letting loose (the offering which goes to the gods). May Agni make the offering ready in consequence of our prayers. May the prescient divine butcher carry the thrice-anointed offering to the gods.",
   "02.003.11": "He 1 is joined with ghrita 2. His womb (on the altar) is ghrita. He rests on ghrita. His abode is ghrita. Carry hither (the gods) according to thy wont! Rejoice 3! Carry, O bull, the offering, over which the Svâhâ has been spoken, (to the gods).",
   "02.004.01": "I call for you Agni, shining with beautiful shine, praised with beautiful praise 1, the guest of the clans, the receiver of fine offerings, who is desirable like Mitra (or, like an ally), Gâtavedas the god, among godly people.",
   "02.004.02": "The Bhrigus worshipping him in the abode of the waters 1 have verily 2 established him among the clans of Âyu. Let him surpass all worlds, Agni, the steward of the gods 3, the possessor of quick horses.",
   "02.004.03": "The gods have established beloved Agni among the human clans as (people) going to settle (establish) Mitra 1. May he illuminate the nights that are longing (for him), he who should be treated kindly by the liberal (worshipper) in his house.",
   "02.004.04": "His prosperity is delightful as good pasture (?) 1; delightful is his appearance when the burning one is driven forward, he who quickly shaking his tongue among the plants waves 2 his tail mightily like a chariot-horse.",
   "02.004.05": "When they praised 1 to me the monstrous might of the eater of the forests 2, he produced his (shining) colour as (he has done) for the Usigs 3. With shining splendour he has shone joyously, he who having grown old has suddenly become young (again).",
   "02.004.06": "He who shines on the forests 1 as if he were thirsty, who resounded like water on its path, like (the rattle of the wheels) of a chariot 2—he whose path is black, the hot, the joyous one has shone, laughing 3 like the sky with its clouds.",
   "02.004.07": "He who has spread himself burning over the wide (earth), moves about like an animal, free, without a keeper. The naming Agni, burning down the brushwood, with a black trail 1, has, as it were, tasted the earth.",
   "02.004.08": "Now in the remembrance of thy former blessings this prayer has been recited to thee at the third sacrifice 1. Give to us, Agni, mighty strength with a succession of valiant men, with plenty of food; (give us) wealth with good progeny 2.",
   "02.004.09": "Give, O Agni, such vigour to thy praiser together with his liberal (lords), that the Gritsamadas, rich in valiant men, victorious over hostile plots, attaining (their aim) in secret, may overcome through thee (their rivals) who get behind 1.",
   "02.005.01": "The brilliant Hotri 1 has been born 2, the father to protect the fathers 3, aspiring after noble wealth. May we be able to bridle the strong (horse) 4.",
   "02.005.02": "He the leader of the sacrifice towards whom the seven reins (or rays) are stretched, the Potri promotes, as (he has done) for Manu, the divine eighth (rein); all those (reins he promotes) 1.",
   "02.005.03": "Or when he has run along, and has recited the sacred words 1, and has pursued that (duty) 2, he has encompassed every kind of wisdom as the felly (encircles) the wheel.",
   "02.005.04": "For He has been born as the bright Prasâstri, with bright power of mind. (A man) who knows his firm laws, mounts up on them as on the branches (of a tree) 1.",
   "02.005.05": "The lively milch-cows were attached to his, the Neshtri's, (bright) colour 1. Was it according to the wish of the three sisters who have gone there 2?",
   "02.005.06": "When (coming) from the mother the sister has approached, bringing ghrita 1, the Adhvaryu rejoices at their 2 coming as corn (rejoices) at rain.",
   "02.005.07": "May He the Ritvig (priest) himself make the Ritvig (serve) for his own refreshment 1. And may we readily gain the praise and the sacrifice 2; we have offered it.",
   "02.005.08": "In order that He the knowing one (Agni) may readily serve all the worshipful (gods), this sacrifice, O Agni, which we have performed, rests in thee.",
   "02.006.01": "Accept, O Agni, this my piece of wood and this my sitting down (reverentially) 1, and hear these words of mine.",
   "02.006.02": "Let us worship thee, Agni, child of vigour, with this (piece of wood?) 1, O winner of horses 2, with this well-spoken (hymn), O well-born one.",
   "02.006.03": "May we thus as thy devoted servants pay devotion by our words to thee who acceptest words (of prayer), to thee who aspirest after wealth, O giver of wealth.",
   "02.006.04": "Thus be thou a liberal, bountiful lord, O lord of goods, O giver of goods. Drive hatred away from us.",
   "02.006.05": "Thus (give) us 1 rain from the sky; thus (give) us unattainable strength; thus (give) us thousandfold food.",
   "02.006.06": "To him who magnifies thee, who desires thy help, O youngest messenger, (invoked) by our word, best sacrificing Hotri, come near.",
   "02.006.07": "For thou, Agni, O sage, who knowest both races (of gods and of men), passest (to and fro) between them, like a messenger belonging to thy own people 1, belonging to thy allies.",
   "02.006.08": "Thus gladden (the gods) 1 as the knowing one; sacrifice, O intelligent one, in due order, and sit down on this Barhis.",
   "02.007.01": "Bring us, O youngest god, Bhârata 1, Agni, the best, resplendent, much-desired wealth, O Vasu 2!",
   "02.007.02": "May no malign power of a god or of a mortal overcome us. Help us across such hostile power.",
   "02.007.03": "And may we dive with thee across all hostile powers as across streams of water.",
   "02.007.04": "Bright, O purifier, worthy of adoration, Agni, thou shinest mightily; thou hast been worshipped by offerings of ghrita 1.",
   "02.007.05": "Thou, O Bhârata 1, Agni! hast been worshipped by us with offerings of heifers, of bulls, of eight-footed (cows) 2.",
   "02.007.06": "The old excellent Hotri who feeds on wood and drinks butter, he is the wonderful son of strength.",
   "02.008.01": "As one who runs a race 1 (praises) his chariots, praise thou the yoking of Agni (to the chariot of sacrifice), of the most glorious, bountiful (god)—",
   "02.008.02": "Who is the best leader for his worshipper, who undecaying makes the malign decay 1, the cheerful-faced who has been worshipped with offerings—",
   "02.008.03": "He who is praised in the houses on account of his beauty in the evening and at dawn, whose law is not set at nought,",
   "02.008.04": "The bright one who shines with his light as the Sun with his splendour, with his undecaying (flames) 1, he who is anointed (with ghrita).",
   "02.008.05": "The hymns have strengthened Agni the devourer 1 along (the extent of) his own royalty 2. He has assumed every beauty.",
   "02.008.06": "May we unharmed stand under the protection of Agni, Indra, Soma, of the gods; may we overcome our foes.",
   "02.009.01": "The Hotri who is found on the Hotri's seat has sat down (there), the fierce, the resplendent, the dexterous one, the protector of (his own) infallible laws 1, the highest Vasu, he who brings thousandfold (gain), the pure-tongued Agni.",
   "02.009.02": "Be thou our messenger, be our protector far and wide; be thou, O bull, a leader towards greater wealth. O Agni! for the continuation of our children and of ourselves be thou an unremitting, brilliant protector.",
   "02.009.03": "May we worship thee at thy highest birth (-place), O Agni; may we worship thee with praises in thy lower abode. I honour the womb from which thou hast sprung. When thou hast been kindled, they have offered offerings in thee.",
   "02.009.04": "Agni, being the best sacrificer perform thou the sacrifice with the oblation. With thy readiness to hear (us) hail our gift, the wealth (which we offer). For thou art the treasure-lord of treasures; thou art the deviser of brilliant speech.",
   "02.009.05": "Thy wealth of both kinds 1 never fails, when thou art born (kindled) day by day, \"O wonderful one. Make thy singer, O Agni, rich in food; make him the lord of wealth with excellent offspring.",
   "02.009.06": "With this face of thine, as a bounteous (lord), a sacrificer to the gods, the best performer of sacrifices with happiness, as an undeceivable guardian and far-reaching protector, shine among us, O Agni, with light and wealth.",
   "02.010.01": "Agni is to be invoked as the first like a father, when he has been inflamed by Manus 1 in the abode of Id 2. When he has invested himself with beauty, the wise immortal, he, the glorious strong (horse) is to be smoothed (by the worshippers as by grooms).",
   "02.010.02": "Agni with bright splendour, mayest thou hear my call with all my prayers, thou a wise immortal. The two tawny (horses) draw thy chariot or the two red (horses), or He the wide-ranging one has made the two ruddy (horses draw his chariot) 1.",
   "02.010.03": "They have generated the well-born (Agni) in her who lies on her back 1. Agni became a germ in the manifoldly-adorned (wives) 2. Even in the … 3 the wise one dwells by night uncovered in his powers 4.",
   "02.010.04": "I besprinkle with my offering, with Ghrita, Agni who abides turned towards all beings, who widely extends throughout, who is mighty in his vigour, who shows himself most capacious by the food (which he consumes), and robust 1.",
   "02.010.05": "I besprinkle Him who is turned towards (us) from all sides; may he gladly accept that with his benevolent mind. Agni, who is like a beautiful youth, who has the appearance of one eagerly striving, is not to be touched, when he hurries around with his body.",
   "02.010.06": "Mayst thou know the portion (belonging to thee), being strong through thy desire. With thee as our messenger may we speak like Manu. Gaining wealth 1 I invoke with my (sacrificial) ladle, with my eloquence, the faultless Agni who mixes the honey-drink.",
   "03.001.01": "Thou wilt have me, O Agni, as a strong (master) of Soma 1: therefore thou hast made me the carrier (of the gods?) to perform worship at the sacrifice 2. Sending my thoughts to the gods 3 I make the (press-) stone ready 4; I toil, O Agni: find thou pleasure in thy own body 5.",
   "03.001.02": "1 Eastward we have turned the sacrifice 2; may the prayer increase. They honoured Agni with fuel and adoration. They have taught (him) the sacrificial ordinances of the sages of Heaven 3. Though he (Agni) is clever and strong, they have sought a way for him.",
   "03.001.03": "He has conceived freshness 1, the wise one of pure 2 powers, he who is by his birth well allied with Heaven and Earth. The gods have found Agni the conspicuous one in the waters, in the work 3 of the sisters.",
   "03.001.04": "The seven young (wives) 1 made the blessed one grow who had been born white, ruddy in his growth. They ran up to him like mares 2 to a newborn foal. The gods wondered at Agni at his birth.",
   "03.001.05": "Spreading with his bright limbs to the aerial space, purifying his power 1 by wise purifications, clothing himself in light, the life of the waters 2, he creates mighty, perfect beauty.",
   "03.001.06": "He has gone to (the waters) who do not eat, the undeceived ones, the young (daughters) of Heaven who are not clothed and (yet) are not naked. Here the former young (women) having the same origin, the seven sounds 1 have conceived one germ.",
   "03.001.07": "His compact masses assuming every shape are spread in the womb of ghee, in the streaming of honey. There the swelling milch-cows have stationed themselves. Great are the parents of the wonderfully mighty (Agni) who are turned towards each other 1.",
   "03.001.08": "Having been carried (in the waters) thou hast shone forth, O son of strength, assuming wonderful shapes brilliant and fierce. The streams of honey and ghee drip, where the male has grown by wisdom.",
   "03.001.09": "By (his) nature he has found his father's udder 1; he has sent forth his streams and his showers 2. Walking 3 hidden to his dear friends he has not been hidden to the young (daughters) of Heaven 4.",
   "03.001.10": "He bore (in his womb) the germ of the sire, of the father who begat him 1. He, being one, sucked many (nurses) rich in milk 2. Observe for this manly, bright one the two wives bound in kinship, belonging to men 3.",
   "03.001.11": "The great one has grown up in the wide unbounded space 1. The Waters (have made) Agni (grow): for many glorious ones 2 (have come) together 3. He lay in the womb of Rita, the domestic (god) Agni, in the work 4 of the uterine sisters.",
   "03.001.12": "Like a horse that carries (the prize), in the assembly of the great (waters) 1, visible to his son 2, he whose … is light 3: he who as father begat the ruddy cows 4, he the son of the waters is the most manly, restless 5 Agni.",
   "03.001.13": "To him, the glorious son of the waters and of the plants, the blessed wood 1 has given birth, in his many shapes. Even the gods, for they agreed in their mind, honoured him who had been born the most wonderful and strong.",
   "03.001.14": "Mighty rays of light like brilliant lightnings, milking (the sap of) immortality in the boundless stable, accompanied Agni whose … is light 1, who had grown up in his own house, as it were in secret.",
   "03.001.15": "I magnify thee, worshipping thee with offerings; I magnify (thee) desirous of thy friendship, of thy favour. Together with the gods give help to him who praises thee, and protect us with thy domestic faces.",
   "03.001.16": "As thy followers, O Agni, best leader, winning all precious (treasures), pressing onward with fertile glory, may we overcome the godless who seek to combat us.",
   "03.001.17": "Thou hast been here as the banner of the gods, Agni, joy-giving, knowing all wisdom. As the domestic (god) thou hast harboured the mortals. As the charioteer thou goest along straightway after the gods.",
   "03.001.18": "The immortal, the king, has sat down in the dwelling of the mortals, performing the sacrifices 1. He the ghee-faced one has shone forth widely, Agni knowing all wisdom.",
   "03.001.19": "1 Come to us with thy gracious friendship, speeding, great, with thy great blessings. Bestow on us plentiful victorious wealth; make our share glorious and adorned with fine speech.",
   "03.001.20": "These old births of thine, O Agni, and the recent ones I have told forth to thee the ancient one. These great libations (of Soma) have been prepared for the manly one; generation by generation Gâtavedas has been placed (on the altar).",
   "03.001.21": "Gâtavedas, placed (on the altar) generation after generation, is kindled by the Visvâmitras, the indefatigable (or everlasting). May we dwell in the grace of him the worshipful, yea, in his blissful kindness.",
   "03.001.22": "Bring thou, O strong one, this sacrifice of ours to the gods, O wise one, as a liberal giver. Bestow on us, O Hotri, abundant food; Agni, obtain by sacrificing mighty wealth for us.",
   "03.001.23": "Procure, O Agni, for ever, to him who implores thee, (the gift of) nourishment 1, the wonderful acquiring of the cow. May a son be ours, offspring that continues our race. Agni, may this favour of thine abide with us!",
   "03.002.01": "For Vaisvânara, the increaser of Rita, for Agni we produce 1 a Dhishanâ 2 like purified ghee. And verily 3 by their prayer the invoking men (accomplish) him, the Hotri, as the axe accomplishes a chariot.",
   "03.002.02": "By his birth he has given splendour to both worlds (Heaven and Earth). He became the praiseworthy son of his parents, Agni, the carrier of oblations, never ageing, with satisfied mind, undeceivable, the guest of men, rich in light.",
   "03.002.03": "Through the power of their mind, within the sphere of their superior strength the gods have procreated Agni by their thoughts. Desirous of winning the prize 1 I address Him who shines with his splendour, who is great in his light, as (one who desires to win the prize addresses his) race-horse.",
   "03.002.04": "Desirous of winning the choice, glorious, and praiseworthy prize (which is the gift) of the joy-giver, we choose the boon of the Bhrigus 1, the Usig 2, who has the mind of a sage, Agni, who reigns with his heavenly light.",
   "03.002.05": "Men, having spread the sacrificial grass, holding the sacrificial ladle, have placed here in front (as Purohita), for the sake of (the divine) blessing, Agni renowned for strength, with great splendour, united with all the gods, the Rudra of sacrifices 1, who accomplishes the oblations of active (worshippers).",
   "03.002.06": "O (Agni) whose flame is purifying, around thy dwelling, O Hotri, the men who at the sacrifices have spread the sacrificial grass, O Agni, seeking (how to do) honour (to thee), and (desiring) thy friendship, surround thee (reverentially);—bestow thou wealth on them!",
   "03.002.07": "He has filled the two worlds (Heaven and Earth) and the great Sun, when the active ones (i. e. the priests) held him fast who had been born. He the sage is led round for the performance of worship, like a racer for the winning of the prize 1, with satisfied mind.",
   "03.002.08": "Adore ye him, the giver of offerings, the best performer of worship; honour ye him the domestic Gâtavedas. Agni, the charioteer of the mighty Rita, he who dwells among manifold tribes, has become the Purohita of the gods.",
   "03.002.09": "The immortal Usigs have purified three logs for the vigorous 1 Agni 2 who wanders round the earth 3: of these they have placed one among the mortals for their enjoyment; two have passed into the sister world 4.",
   "03.002.10": "The food offered by men has sharpened him, the sage of the tribes, the lord of the tribes, as an axe. Busily he goes to the heights and to the depths. He has held fast the germ in these worlds.",
   "03.002.11": "He the generator, the strong one, stirs in the resplendent bellies like a roaring lion, Vaisvânara with his broad stream of light, the immortal, distributing goods and treasures to his worshipper.",
   "03.002.12": "Vaisvânara has mounted the firmament, the back of heaven, as of old, glorified by those who are rich in good thoughts. He, creating wealth for the creatures as of old, goes watchful round the common course.",
   "03.002.13": "The righteous, worshipful priest deserving of praise, the dweller in heaven 1 whom Mâtarisvan has established (on earth): him we approach whose way is bright and hair golden, the resplendent Agni, for the sake of ever new welfare.",
   "03.002.14": "Like the flaming one (the sun?) on his way, the quick one, of sun-like aspect, the banner of heaven, who dwells in light, who wakes at dawn—Agni the head of heaven, the unrepressed, him we approach with adoration, the strong one mightily.",
   "03.002.15": "The joy-giving, bright Hotri, in whom is no falsehood, the domestic, praiseworthy dweller among all tribes, like a splendid chariot, wonderful to behold, established by Manus: him we constantly approach for the sake of wealth.",
   "03.003.01": "They have worshipped Vaisvânara with his broad stream of light with prayers 1 and treasures in order that he may walk on firm ground. For immortal Agni honours the gods, and from of old he has not violated the laws.",
   "03.003.02": "The wonderful messenger goes between the two worlds (heaven and earth), the Hotri who has sat down, the Purohita of Manus. He takes care of his wide dwelling day by day, Agni who, incited by the gods, gives wealth for our prayers.",
   "03.003.03": "The priests have exalted with their thoughts Agni, the banner of sacrifices, the achiever of sacrifice 1. From him in whom they have put together their (sacrificial) works and their prayers, the sacrificer desires blessings.",
   "03.003.04": "The father of sacrifices, the miraculous lord of those who know prayers (?) 1, Agni, is the measure and rule 2 of the sacrificers; he has entered the two manifold-shaped worlds; the sage beloved by many people is glorified in his foundations.",
   "03.003.05": "The gods have established here in great beauty Agni the bright with his bright chariot, whose every law is golden 1, Vaisvânara who dwells in the waters, who finds the sun, the diver, the swift one covered with strength, the quick one.",
   "03.003.06": "Agni, spreading out with his thought the manifold-adorned sacrifice, together with the gods and with the people of Manus, goes as a charioteer to and fro with (gods and men) who accomplish the sacrifice, the quick, domestic (god), the dispeller of curses.",
   "03.003.07": "Agni, be wakeful 1 in our life which may be blessed with offspring; swell with sap; shine upon us (plenty of) food. Stir up vigour and the great ones, O watchful (god). Thou art the Usig (or willing one) of the gods, the good-minded (lord) of prayers.",
   "03.003.08": "The lord of the tribe, the vigorous 1 guest, the guider of prayers, the Usig (or willing one) of those who invoke him, Gâtavedas, the light of worship—him men constantly praise with adoration, with solicitations for their welfare.",
   "03.003.09": "The resplendent, joyous god, Agni on his chariot, has with his might encompassed the dwellings. May we honour in our house with beautiful prayers 1 his commands who is rich in manifold prosperity.",
   "03.003.10": "O Vaisvânara, I love thy statutes by which thou hast found the sun, O far-seeing one. When born thou hast filled the worlds, heaven and earth; Agni, thou encompassest all these (beings) by thyself.",
   "03.003.11": "For Vaisvânara's wonderful deeds he the sage alone has by his great skill mightily 1 let loose (his powers?). Agni has been born exalting. both his parents, Heaven and Earth, rich in seed.",
   "03.004.01": "Log by log 1 be kind towards us. Flash by flash grant us thy, the Vasu's, favour 2. Bring hither, O god, the gods that we may sacrifice. Sacrifice, O Agni, as a kind friend to thy friends.",
   "03.004.02": "Thou whom the gods, Varuna, Mitra, Agni, thrice every day bring hither by sacrifice day by day, Tanûnapât, make this our sacrifice honey-sweet, having its abode in ghee 1, (this sacrifice) which worships (the gods).",
   "03.004.03": "(Our adoring) thought rich in all boons goes forward for worshipping as the first the Hotri of the sacred food (il), for saluting the strong bull with adoration and homage. May he, the best sacrificer, incited (by our prayers) sacrifice to the gods 1.",
   "03.004.04": "Upwards your 1 course has been directed at the worship; upwards (your) flames 2 are gone; ready (for receiving you) is the air 3. Or the Hotri has sat down at heaven's navel. We spread out the sacrificial grass which receives the gods.",
   "03.004.05": "Choosing in their mind the sevenfold work of the Hotris 2, enlivening everything (the gods) came hither in the right way. (The divine doors 3) with men as their ornaments 4, born at the sacrifices 5, have come hither and thither to this sacrifice, many of them.",
   "03.004.06": "Hither (shall come) the two Dawns 1, the neighbourly (goddesses) of glorious appearance 2. Of different forms, they both smile. (They shall come) that Mitra and Varuna may be satisfied with us, and Indra accompanied by the Maruts with their powers 3.",
   "03.004.07": "I catch hold of the two divine Hotris first. The seven strong ones 1 rejoice according to their wont. Teaching the right, they proclaim the right, the guardians of law, contemplating the law.",
   "03.004.08": "1 May Bhâratî, in concord with the Bhâratîs, Ilâ with the gods, Agni with men, Sarasvatî with all (beings) belonging to Sarasvatî (come) hither; may the three goddesses sit down on this sacrificial grass.",
   "03.004.09": "O divine Tvashtri, grant us and send forth this our seed which is to thrive: (the seed) from which a manly son is born able and skilful, who sets to work the press-stones, loving the gods.",
   "03.004.10": "O tree 1, send (the offering) forth to the gods. May Agni the slaughterer make the offering ready. May the same, the very true Hotri, sacrifice according as he knows the generations of the gods.",
   "03.004.11": "Agni, being kindled, come hither, on one chariot with Indra, with the quick gods. May Aditi, the mother of noble sons, sit down on our sacrificial grass. With Svâhâ may the immortal gods rejoice.",
   "03.005.01": "Shining Agni has awoke over against the Dawns, the priest who traces the footsteps of the sages 1. With his broad stream of light kindled by the pious, the carrier (of the gods) has opened the two doors of darkness.",
   "03.005.02": "Agni has grown strong by praises, by the speeches of the praisers, by hymns, the adorable one. Loving many aspects of Rita the messenger has shone up at the bursting forth of the Dawn.",
   "03.005.03": "Agni has been established among the tribes of men, the son of the waters, Mitra 1, acting in the right way. The delightful, worshipful one has reached the top; the priest has become one who should be invoked by prayers.",
   "03.005.04": "Agni becomes Mitra 1, when he has been kindled; he the Hotri (Agni becomes) Mitra; he, Gâtavedas, (becomes) Varuna. The quick Adhvaryu, the domestic (god, Agni, becomes) Mitra, the Mitra (i. e. friend or ally) of the rivers and of the mountains.",
   "03.005.05": "He observes the deceiver's dear summit 1, the footstep of the bird 1; the vigorous one 2 observes the course of the Sun. Agni observes at his (?) navel the seven-headed (song?) 3; tall (Agni) observes the enjoyment of the gods.",
   "03.005.06": "The Ribhu 1 has created for himself a good name worthy of being magnified, he, the god who knows all laws. The skin of the herbs 2, the bird's footstep 3 rich in ghee: Agni watches (all) that, never failing.",
   "03.005.07": "Agni has approached the place 1 rich in ghee (the altar), with broad passages, (the place) longing (for him), longing (himself). He the resplendent, bright, tall purifier has made his two parents 2 new again and again.",
   "03.005.08": "As soon as born he has grown by the grass 1, when the sprouting (grass-)blades strengthen him with ghee. Like waters beautiful on their precipitous path, Agni, being in the lap of his parents, has escaped into wide space.",
   "03.005.09": "Receiving praise the vigorous one 1 has shone forth with his fuel, on heaven's summit, on the earth's navel. May Agni worthy of being magnified, (being) Mitra and Mâtarisvan, the messenger, carry hither the gods that they may receive our sacrifice.",
   "03.005.10": "The tall one has, by (receiving) fuel, upheld the firmament, Agni, becoming the highest of lights, when Mâtarisvan for the sake of the Bhrigus 1 kindled the carrier of oblations, (Agni) who dwelt in secret.",
   "03.006.01": "Bring forward, ye pious singers, stirred in your thoughts 1, (the ladle) which is turned towards the gods. Carrying (the sacrificial butter) from left to right 2 it turns eastward, rich in strength, bringing the offering to Agni, full of ghee.",
   "03.006.02": "When born thou hast filled the two worlds, nay thou hast even exceeded them, O friend of sacrifices 1. May, O Agni, thy seven-tongued horses 2 move along, by the greatness of heaven and earth 3.",
   "03.006.03": "Heaven and Earth the worshipful 1 establish thee as Hotri for the house, whenever the pious human tribes offering food magnify the bright light.",
   "03.006.04": "(Thou art) seated, the great one, in a firm place 1, between the two mighty Heavens 2, thou who art longed for—(between) the two united 3 never-ageing, inviolable wives, the two juice-yielding milch-cows 4 of the far-reigning one 5.",
   "03.006.05": "Thy, the great (god's) laws, O Agni, are great. Through the power of thy mind thou hast spread out the two worlds. Thou hast become a messenger at thy birth, thou, O bull, the leader of the tribes.",
   "03.006.06": "Or bind to the pole by means of thy (art of) harnessing the two long-maned, red (horses) of Rita, that swim in ghee 1, and carry hither, O god, all gods; perform splendid worship, O Gâtavedas!",
   "03.006.07": "1 Even from heaven thy shining lights have shone; thy splendour follows many resplendent dawns, when the gods, O Agni, praised the cheerful Hotri's work 2 who eagerly burns in the forests 3.",
   "03.006.08": "Whether it be the gods who rejoice in the wide air, or those who dwell in the heavenly light, or those who are helpful 1, ready to hear our call, and worshipful; or whether the horses of thy chariot, O Agni, have turned themselves hither—",
   "03.006.09": "Come hither with them, O Agni, on one chariot or on many chariots, for thy horses are powerful. Bring hither, after thy nature, the thirty and the three gods with their wives, and rejoice (in the Soma).",
   "03.006.10": "He is the Hotri whose sacrifice even the two wide worlds salute over and over again for the sake of prosperity. Turned to the east 1, the two well-established 2 (goddesses, Heaven and Earth), the righteous, true ones stand as at the sacrifice 3 of (Agni) the right-born.",
   "03.006.11": "11 = III, 1, 23.",
   "03.007.01": "They who have risen out of the drink of the white-backed one, have entered the two parents, the seven sounds. The (all-)encompassing parents come together; they go forth to aspire after long life 1.",
   "03.007.02": "The milch-cows dwelling in heaven 1 are the mares of the manly one. He has bestridden the goddesses who carry the sweet (food) 2. Thee who livest in peace in the abode of Rita, the one cow 3 circumambulates, making her way.",
   "03.007.03": "He has mounted the (mares) 1 that became well-manageable, the wise lord, the finder of riches. He with the dark blue back, with many faces, has made them depart from the drink of the brush-wood 2.",
   "03.007.04": "Giving mighty vigour to the never-ageing son of Tvashtri 1, the streams 2 carry Him the firmly fixed one. Flashing in his abode with his limbs he has entered upon the two worlds as if they were one.",
   "03.007.05": "They know friendship towards the manly, the red one, and they delight in the command of ruddy (Agni), (the gods) shining from heaven, resplendent with bright shine, to whose host Ilâ belongs, the mighty praise.",
   "03.007.06": "And finding it out by following the noise they brought to the great one's great parents a song of praise, when the bull about nightfall (?) has grown strong according to the singer's own law 1.",
   "03.007.07": "With the five Adhvaryus the seven priests watch the beloved footstep which the bird has made 1. Turned forwards the never-ageing bulls 2 rejoice: for they, being gods, have followed the laws of the gods.",
   "03.007.08": "8 = III, 4, 7.",
   "03.007.09": "The many (mares) are full of desire for the mighty stallion. For the manly, bright one, the reins easily direct (the horses) 1. Divine Hotri! Thou who art a great joy-giver and wise, bring hither the great gods and the two worlds 2.",
   "03.007.10": "The dawns, O wealth-giver, the mighty sacrificers 1, well spoken and bright have shone with wealth. And by the earth's greatness 2, O Agni, forgive us even committed sin 3, that we may be great.",
   "03.007.11": "11 = III, 1, 23.",
   "03.008.01": "The worshippers of the gods anoint thee at the sacrifice, O lord of the forest 1, with heavenly honey 2. When standing upright bestow wealth (on us) here, or when abiding in this mother's lap 3.",
   "03.008.02": "Situated in front of the kindled (fire), accepting our sacred spell which protects from old age and gives valiant offspring, driving away far from us lack of thoughts 1, rise up 2 for the sake of great prosperity.",
   "03.008.03": "Rise up, O lord of the forest, on the summit of the earth. Erected by skilful erection bestow splendour on (the worshipper) who fits out the sacrifice as a vehicle 1.",
   "03.008.04": "A well-clothed youth dressed has come hither. He becomes more excellent when born 1. Wise sages full of pious thoughts, longing for the gods in their mind, bring him forth.",
   "03.008.05": "He who has been born is born 1 in the auspiciousness of days, growing up in the assembly and at the sacrifice 2. Wise, active men purify him by pious thoughts; the priest approaching the gods raises his voice 3.",
   "03.008.06": "You whom the worshippers of the gods have fastened down (in the earth), or whom the axe has fashioned, O lord of the forest: may those divine posts 1 standing (here) take care to bestow on us treasures with offspring.",
   "03.008.07": "(The posts) which have been hewn on the earth and fastened down, and to which the sacrificial ladles have been raised 1: may they, giving bliss to our fields 2, eagerly seek precious goods for us among the gods.",
   "03.008.08": "May the Âdityas, the Rudras, the Vasus, the good leaders, Heaven and Earth, the Earth 1 and the Air—may the gods unanimously bless this sacrifice; may they raise up the banner of the sacrifice (the Yûpa).",
   "03.008.09": "Like swans ranging themselves in rows, arraying themselves in brightness the sacrificial posts have come to us. Led up by the sages they go forward as gods to the abode of the gods.",
   "03.008.10": "Like horns of horned animals the sacrificial posts with their head-pieces 1 are seen on the earth. Hearing (us) in the emulating call of the invoking (priests) may they protect us in the racings of battles.",
   "03.008.11": "O lord of the forest, rise with a hundred branches; may we rise with a thousand branches (offspring)—thou whom this sharpened axe has led forward to great prosperity.",
   "03.009.01": "We, thy friends 1, have chosen thee for our protection, (we) the mortals (thee) the god, the offspring of the Waters, the blessed one with fine splendour 2, who gloriously advances, the unmenaced one.",
   "03.009.02": "When thou, finding pleasure in the wood, hast gone to thy mothers, the Waters, that return of thine, Agni, (to this world) should not be slighted, when dwelling afar thou hast come hither.",
   "03.009.03": "High above (all) pungent sharpness thou hast grown up 1, and verily thou art kind-hearted. Some go forward here and there; others sit around thee, in whose friendship thou abidest 2.",
   "03.009.04": "He who has passed beyond (all) failures, beyond all hindrances 1, the guileless, watchful ones 2 have found him as a lion (is found), when he had gone into the Waters;",
   "03.009.05": "He who had run as it were by his own might, Agni, who thus dwelt in concealment—Him Mâtarisvan brought hither from afar, from the gods, when he had been produced by attrition (of the woods).",
   "03.009.06": "(And thus) the mortals have taken thee up, O carrier of sacrificial food towards the gods 1, because thou, O (god) belonging to Manus, protectest all sacrifices by the power of thy mind, O youngest one!",
   "03.009.07": "1 This is something glorious; herein thy wonderful power shows itself even to the simple, that the cattle lie down round about thee when thou hast been kindled, O Agni, at the approach of darkness 2.",
   "03.009.08": "Make your offerings in (Agni), the best performer of worship, the sharp one who purifies with his flames 1. Serve ye, obediently the god, the quick messenger, the agile, the old, the adorable.",
   "03.009.09": "1 Three hundred and three thousand gods and thirty and nine did service to Agni. They sprinkled him with ghee and spread out for him the sacrificial grass: then they made him sit down as a Hotri.",
   "03.010.01": "1 Thee, O Agni, the highest king of human tribes, the god, thoughtful mortals kindle at their worship.",
   "03.010.02": "Thee, O Agni, the Ritvig, the Hotri, they magnify at the sacrifices. Shine as the guardian of Rita in thy own house 1.",
   "03.010.03": "He indeed who may worship thee, the Gâtavedas, with fuel, acquires abundance in valiant men, O Agni; he will prosper.",
   "03.010.04": "May He, the banner of the sacrifices, Agni, come hither with the gods, anointed by the seven Hotris 1 for the sake of the man who offers sacrificial food.",
   "03.010.05": "Bring ye forward an ancient, mighty speech to Agni, the Hotri, who is like a worshipper bearing the lights of prayers 1.",
   "03.010.06": "May our prayers increase Agni, since he is born deserving of praises, the conspicuous one, for the sake of great strength and wealth.",
   "03.010.07": "1 May Agni, as the best sacrificer at the worship (of men), perform the sacrifice to the gods for the man devoted to the gods. As a joyous Hotri thou reignest (passing) beyond (all) failures.",
   "03.010.08": "Thus, O purifier, shine on us glorious abundance in heroes. Be the nearest (friend) to those who praise thee, for their welfare.",
   "03.010.09": "Thus the priests full of admiring praise, having awoke, kindle thee, the immortal carrier of sacrificial food, the increaser of strength.",
   "03.011.01": "Agni is the Hotri, the Purohita of our worship, he who dwells among many tribes, He knows the sacrifice in due order.",
   "03.011.02": "He, the immortal carrier of oblations, the Usig 1, the messenger, with satisfied mind, Agni sets himself in motion 2 (incited) by the thought (of praying men?).",
   "03.011.03": "Agni takes heed 1 (of us) by the thought (the prayer?), the banner of the sacrifice, the ancient one; for his purpose triumphs 2.",
   "03.011.04": "The gods have made Agni, the old-renowned son of strength, the Gâtavedas, their carrier (towards the sacrifice) 1.",
   "03.011.05": "Agni the undeceivable one who goes before the human tribes, he is the quick chariot 1, ever new.",
   "03.011.06": "Overcoming all attacks, He, the uninjured mind (power) of the gods, Agni, is most mightily renowned.",
   "03.011.07": "Through the vehicle 1 (which carries the gods) towards the delights (of sacrifice), \"the worshipping mortal attains the dwelling-place 2 of (Agni) whose flames are purifying.",
   "03.011.08": "May we, the priests, by our prayers obtain all the blissful gifts of Agni Gâtavedas.",
   "03.011.09": "Agni! May we win all the best things in (the trials of) strength. In thee the gods have established them 1.",
   "03.012.01": "Indra-Agni, in consequence of our prayers come hither to the pressed (Soma), to the precious cloud 1. Drink of it incited by our thoughts (i. e. by our prayers).",
   "03.012.02": "Indra-Agni, the brilliant 1 sacrifice of him who praises you goes forward together (with the Soma libations, the praises, &c.). Thus drink this pressed (Soma)!",
   "03.012.03": "By this stirring sacrifice I choose Indra and Agni who show themselves as sages 1; may they here satiate themselves with Soma.",
   "03.012.04": "I call the bounteous 1, the killers of foes 2, the united conquerors, unconquered, Indra-Agni, the greatest winners of booty.",
   "03.012.05": "The praisers rich in hymns, knowing all the ways (of the sacrifice), laud you. Indra-Agni, I choose the food (which you give).",
   "03.012.06": "Indra-Agni, you have hurled down by one deed the ninety strongholds together of which the Dâsas were the lords.",
   "03.012.07": "Indra-Agni, the thoughts (of the worshippers) go forward towards (you) from the work (of sacrifice) along the paths of Rita.",
   "03.012.08": "Indra and Agni, yours are powerful abodes and delights. You cross the waters: this is the deed which belongs to you 1.",
   "03.012.09": "Indra and Agni, you display the lights of heaven in your deeds of strength; that mighty deed of yours has been known far and wide.",
   "03.013.01": "To this god Agni I sing 1 for you most powerfully. May he come to us with the gods; may he, the best sacrificer, sit down on the sacrificial grass.",
   "03.013.02": "The righteous one to whose skill the two worlds (Heaven and Earth) and (all) blessings cling—Him the men rich in offerings magnify, Him those who long for gain, that they may obtain his blessing.",
   "03.013.03": "He, the priest, is the guide of these (men) 1, and he indeed (is the guide) of sacrifices. Praise ye this Agni who is the giver, the winner of wealth.",
   "03.013.04": "May this Agni give us most blissful shelter for our (sacrificial) feast, whence he may shower wealth on us in heaven, the (human) dwellings 1, and in the waters.",
   "03.013.05": "The singers kindle Agni, the Hotri, the lord of the tribes, the brilliant, the wonderful, with his excellent thoughts 1.",
   "03.013.06": "And mayst thou, the best invoker of the gods, help us in our spell, in our hymns. Shine bliss on us, Agni whom the Maruts strengthen 1, the greatest winner of thousandfold (wealth).",
   "03.013.07": "Now bestow on us thousandfold wealth with offspring and prosperity, splendid, most powerful, and undecaying abundance in heroes, O Agni!",
   "03.014.01": "The joy-giving Hotri has taken his place at the sacrifices 1, He the true, the sacrificer, the highest sage, the worshipper. Agni whose chariot is lightning, the son of strength, whose hair is flame, has spread forth his light over the earth.",
   "03.014.02": "It 1 has been offered to thee—be pleased with the adoring speech 2—to thee who is observant of it, O righteous, strong one. Bring hither thou who art wise, the wise (gods). Sit down on the sacrificial grass in the middle (of it) for bliss, O worshipful one!",
   "03.014.03": "To thee, Agni, Night and Dawn who further thy strength 1, shall hasten on the paths of the wind. When (the mortals) anoint the ancient one 2 with offerings, they 3 stand in the house as on a chariot-seat 4.",
   "03.014.04": "Mitra and Varuna, O strong Agni, and all the Maruts shall sing to thee a pleasant song, when thou, O son of strength, standest with thy flames, a sun spreading out men 1 over the (terrestrial) dwellings.",
   "03.014.05": "We have given thee thy desire to-day, sitting down near thee adoringly with outstretched hands 1: sacrifice thou to the gods as a priest with thy mind most skilled in sacrifice, with unerring thoughts, O Agni!",
   "03.014.06": "From thee indeed, O son of strength, proceed manifold divine blessings and gains 1. Give us thousandfold true wealth according to thy guileless word, O Agni!",
   "03.014.07": "What we have done here for thee at this sacrifice, we mortals, O skilful and thoughtful god, take thou notice of all that, O (god) with the good chariot 1; make all this (sacrificial food) here savoury, immortal Agni!",
   "03.015.01": "Flaming with thy broad stream of light beat away fiends, sorcerers, plagues. May I dwell in the protection of the great, well-protecting (god), under the guidance of Agni who readily listens to our call.",
   "03.015.02": "Be thou our protector when this dawn shines forth, he thou (our protector) when the sun has risen. Cherish, O Agni, well-born in body, this praise of mine as (a man rejoices) in the birth (of a son), in his own offspring 1.",
   "03.015.03": "Beholding men, shine thou after many (dawns) 1, O bull, Agni, red in the dark (nights). O Vasu! Lead us and bring us across anguish. Help us, the Usigs 2, to wealth 3, thou youngest (of the gods)!",
   "03.015.04": "Shine, O Agni, thou the invincible bull, who hast conquered all strongholds and all delights, the leader of the first, the protecting 1, mighty sacrifice, O Gâtavedas, best guide.",
   "03.015.05": "O singer, thou who art wise, brightly shining towards the gods 1, bring to us thy many perfect shelters, and gain like a victorious car 2; Agni, (carry) thou (hither) towards us the two well-established 3 worlds (Heaven and Earth).",
   "03.015.06": "O bull, increase and rouse our gains. Agni! (Increase) for us the two worlds (Heaven and Earth) rich in milk, O god together with the gods, shining with beautiful shine! May a mortal's hatred never enclose us.",
   "03.015.07": "7 = III, 1, 23.",
   "03.016.01": "This Agni rules over abundance in valiant men, over great happiness. He rules over wealth consisting in offspring and cows; he rules over the killing of foes.",
   "03.016.02": "O Maruts 1, ye men, cling to this furtherer 2 who possesses joy-furthering boons—(the Maruts) who 3 in battles overcome ill-minded (foes), who have deceived the enemy 4 day by day.",
   "03.016.03": "As such, O bounteous Agni, prepare 1 us riches 2 and wealth in valiant men, which, O highly glorious one, may be most exalted, rich in offspring, free from plagues, and powerful.",
   "03.016.04": "The maker who victoriously (stands) over all beings, the maker who makes the praise arrive among the gods 1: he stands firm among the gods, among the host of heroes, firm also in the praise of men.",
   "03.016.05": "Give us not up, Agni, to want of thought 1 nor to want of heroes nor to want of cows, O son of strength, nor to the scoffer. Drive away hostile powers 2.",
   "03.016.06": "Help us at this sacrifice, O blessed one, with mighty gain which is accompanied by offspring, O Agni! Let us be united with greater, gladdening, glorious wealth, O thou of mighty splendour!",
   "03.017.01": "He who is inflamed after the primitive ordinances, is anointed with ointments 1, the giver of all treasures, he whose hair is flame, whose stately robe is ghee, the purifier, skilled in sacrifice, Agni—that he may sacrifice to the gods.",
   "03.017.02": "As thou hast performed, O Agni, the Hotri's duty for the Earth, as thou hast done it for Heaven, O Gâtavedas, full of intelligence, in the same way sacrifice with this offering to the gods. Prosper this sacrifice to-day as thou hast done for Manus.",
   "03.017.03": "Thou hast three lives, O Gâtavedas, and three births from the Dawn 1, O Agni! Being wise, sacrifice with these to the favour of the gods, and bring luck and welfare to the sacrificer.",
   "03.017.04": "Praising Agni full of splendour, full of beauty, we adore thee, O Gâtavedas, deserving to be magnified. Thee the gods have made their messenger, their steward 1, and carrier of offerings, the navel of immortality.",
   "03.017.05": "O Agni, the Hotri who before thee was an excellent sacrificer, who verily 1 sat down and brought luck by himself 2 sacrifice according to his rules, O intelligent one, and set down our sacrifice at the feast of the gods.",
   "03.018.01": "Be kind, O Agni, when we approach thee, as a friend a friend, as parents 1, a straight leader. For full of deceit are the tribes of men: burn thou against (all) malign powers so that they turn back.",
   "03.018.02": "Burn, O Agni, the nearer enemies, burn the curse of the distant evil-doer. Burn, O Vasu, seeing the unseen ones. May thy never-ageing, never-tiring flames 1 spread out.",
   "03.018.03": "Wishing for (thy blessings), O Agni, by fuel and ghee I offer this sacrificial food for (the attainment of) advancing power and of strength; worshipping thee with my spell as far as I have power (I offer) this divine prayer for the attainment of hundred(fold blessings).",
   "03.018.04": "(Shining) forth with thy flame, O son of strength, praised (by us), bestow mighty vigour on those who toil for thee, bright luck and welfare, O Agni, on the Visvâmitras! We have cleaned thy body many times.",
   "03.018.05": "Give us treasures, O best gainer of riches: such indeed art thou, Agni, when thou hast been kindled. In the blessed praiser's house thou hast placed, together with wealth, thy mighty(?) arms 1, thy marvellous shapes.",
   "03.019.01": "I choose Agni as Hotri at this sacrificial meal, the clever sage all-knowing and not foolish. May he, the excellent sacrificer, sacrifice for us amid the host of the gods; may he obtain liberal boons (for us) for the sake of wealth and strength.",
   "03.019.02": "To thee, O Agni, I stretch forth the (ladle) rich in sacrificial food, splendid, full of gifts, full of ghee. From left to right, choosing the host of the gods 1, he has established the sacrifice with gifts and goods 2.",
   "03.019.03": "Whoever is favoured by thee, is blessed with the sharpest spirit. Favour him with good offspring, O god rich in favours 1! Agni, may we, (dwelling) in the copiousness of manliest wealth, be rich in perfect praise of thee, the Vasu.",
   "03.019.04": "On thee indeed, O Agni, sacrificing men have put many faces of (thee) the god 1. Bring hither then the host of the gods, O youngest one, when thou wilt sacrifice to-day to the divine host 2.",
   "03.019.05": "When the gods will anoint thee as the Hotri at the sacrificial meal making thee sit down for the sacrifice, be thou here, O Agni, our furtherer, and bestow glory on our bodies.",
   "03.020.01": "The carrier (of the gods) 1 calls by his hymns Agni, Ushas (dawn), the two Asvins, Dadhikrâ 2 at daybreak. May the gods rich in light, unanimously longing for our sacrifice, hear us.",
   "03.020.02": "Agni, threefold is thy strength; three are thy abodes; three are thy many tongues, O thou who art born in Rita! And three, O Agni, are thy bodies beloved by the gods. With these protect our prayers unremittingly.",
   "03.020.03": "1 Agni! Many are the names, O Gâtavedas, of thee the immortal one, O self-dependent god! And whatever the secret powers of the powerful 2 are, thou all-enlivener, in thee they have placed together (those) many (powers), O (god) after whose relations men ask 3.",
   "03.020.04": "Agni is the divine leader of the divine tribes like Bhaga, the guardian of the seasons 1, the righteous. May He, the killer of Vritra 2, the ancient one, the possessor of all wealth, bring the singer across all troubles.",
   "03.020.05": "I invite hither 1 Dadhikrâ 2, Agni, and the goddess Ushas, Brihaspati and the god Savitri, the Asvins, Mitra and Varuna and Bhaga, the Vasus, Rudras, and Âdityas.",
   "03.021.01": "Take this our sacrifice to the immortals; accept graciously these offerings, O Gâtavedas. O Agni, partake of the drops of fat and ghee, O Hotri, having sat down as the first.",
   "03.021.02": "To thee, O purifier, the drops of fat mixed with ghee drip down. O (god) who followest thy own ordinances, give us the best boon for this feast to which the gods come eagerly.",
   "03.021.03": "To thee, the priest, O Agni, (belong) the drops dripping with ghee, O good one! Thou art kindled as the best Rishi. Be a furtherer of our sacrifice!",
   "03.021.04": "For thee, O liberal one 1, full of power, the drops of fat and ghee drip down, O Agni! Praised by the sages thou hast come hither with mighty light. Accept graciously the offerings, O wise one!",
   "03.021.05": "For thee the richest fat 1 has been taken out from the midst. We give it to thee. On thy skin, O Vasu, the drops drip down. Accept them eagerly for each of the gods.",
   "03.022.01": "This is that Agni with whom the desiring Indra took the pressed Soma into his body. Having obtained thousandfold strength like a horse, a racer 1, thou art praised, O Gâtavedas!",
   "03.022.02": "1 Thy splendour, O Agni, which dwells in heaven and on earth, in the plants, O worshipful one, and in the waters, wherewith thou hast spread through the wide air—that light of thine is fierce, waving 2, man-beholding.",
   "03.022.03": "Agni, thou goest to the floods of heaven. Thou hast spoken to the gods who are liberal (?) 1. (Thou goest) to the waters which (dwell) on high in the ether of the sun, and to those which approach below.",
   "03.022.04": "May the fires of the soil united with those on the hill-sides 1, without guile graciously accept our sacrifice and plentiful food free from all plague.",
   "03.022.05": "5 = III, 1, 23.",
   "03.023.01": "Produced by attrition, well preserved in his abode, the young sage, the leader of worship, Agni ever young in the forests 1 that grow old—Gâtavedas, has here assumed immortality 2.",
   "03.023.02": "The two Bharatas 1, Devasravas and Devavâta, in the midst of wealth have produced by attrition Agni the skilful (god). Agni, look forth with mighty wealth, and then be 2 for us a guide of food day by day.",
   "03.023.03": "1 The ten fingers have brought him to the birth, the ancient, beloved (Agni), well born in his mothers 2. Praise, O Devasravas, the Agni of Devavâta who 3 should be the lord of people.",
   "03.023.04": "I have laid 1 thee 2 down in the best (place) of the earth 3, in the place of Ilâ 3, in the auspiciousness of days. O Agni, as the god who has belonged to Manus 4, shine with wealth on the Drishadvatî, on the Âpayâ, on the Sarasvatî.",
   "03.023.05": "5 = III, 1, 23",
   "03.024.01": "Agni, be victorious in battles; thrust away the plotters. Difficult to overcome, overcoming malign powers, bestow splendour on (the worshipper) who fits out the sacrifice as a vehicle 1.",
   "03.024.02": "Agni, thou art kindled with nourishment 1, the immortal offerer of a feast (to the gods). Accept graciously our worship.",
   "03.024.03": "Agni, wakeful one, son of strength, into whom offerings are poured, sit down with thy splendour on this sacrificial grass of mine.",
   "03.024.04": "Agni, together with all Agnis, with the gods exalt our prayers and those who are respectful at the sacrifices.",
   "03.024.05": "Agni, give wealth to the worshipper, abundance in valiant men; further us 1 that we may be rich in sons.",
   "03.025.01": "Agni, thou art for ever the wise son of Heaven and of the Earth, the all-wealthy one. In thy peculiar way 1 sacrifice here to the gods, O intelligent one!",
   "03.025.02": "Agni, the knowing, obtains (for his worshipper) heroic powers; he obtains (for him) strength, being busy for the sake of immortality. Bring then the gods hither, O (Agni), rich in food.",
   "03.025.03": "Agni, the wise, shines on Heaven and Earth, the two immortal goddesses who encompass all people—he who rules through his strength, and who is full of light through adoration.",
   "03.025.04": "Agni and Indra, come hither to the sacrifice in the house of the worshipper rich in pressed (Soma), never failing, ye two gods, at the drink of Soma.",
   "03.025.05": "Agni, thou art kindled in the house of the waters, (our) own (god), O son of strength, Gâtavedas, who exaltest the abodes (in which thou dwellest) by thy blessing.",
   "03.026.01": "With our offerings revering in our mind Agni Vaisvânara, the follower of truth, the finder of the sun—we, the Kusikas 1, desirous of goods, call with our prayers the god who gives rain, the charioteer, the, cheerful.",
   "03.026.02": "We call that beautiful Agni to help us, Vaisvânara, Mâtarisvan the praiseworthy 1; we the men (call) Brihaspati 2 for (the worship) of the divine host, the priest who hears us, the. guest who swiftly glides along.",
   "03.026.03": "Vaisvânara, neighing like a horse, is kindled by the women 1, by the Kusikas, from age to age; may this Agni give us abundance in valiant men and in horses and treasures, he who wakes among the immortals.",
   "03.026.04": "May the Vâgas 1 come forward, the Agnis with their powers. United 2 they have harnessed the spotted deer for their triumphal procession 3. The Maruts, mightily growing, the all-wealthy, make the mountains tremble, the unbeguiled ones.",
   "03.026.05": "The Maruts who possess the beauty of Agni 1, belong to all races of men. We implore their fierce, strong help. They are tumultuous, the sons of Rudra, clothed in rain, hot-spirited like lions 2, givers of rain.",
   "03.026.06": "We implore with our best praises every host, every troop (of the Maruts) 1, the splendour of Agni, the power of the Maruts. With the spotted deer as horses 2, with gifts that cannot be taken away, they go to the sacrifice wise in the (sacrificial) ordinances 3.",
   "03.026.07": "Agni am I, by birth Gâtavedas. Ghee is my eye; (the drink of) immortality is in my mouth. The threefold song 1 traversing the aerial space, the imperishable Gharma 2, the sacrificial food am I by name.",
   "03.026.08": "With three purifying strainers he (Agni) purified the song, with his heart the thought, discovering the light. The mightiest treasure he produced by the powers of his own nature, and then he looked over heaven and earth.",
   "03.026.09": "Carry him who is the inexhaustible spring with a hundred rills, who has knowledge of prayers (?), the father of (every speech) that should be uttered, the roaring one 1, gladly excited in the lap of his parents—carry him the truth-speaking across (all dangers), O ye two worlds!",
   "03.027.01": "Forward (goes) your 1 strength tending heavenward, rich in offerings, with the (ladle) full of ghee. To the gods goes (the worshipper) desirous of their favour.",
   "03.027.02": "I magnify 1 with prayer Agni who has knowledge of prayers (?), the accomplisher of sacrifice, who hears us, and in whom (manifold wealth) has been laid down.",
   "03.027.03": "O Agni, may we be able to bridle thee the strong god 1; may we overcome (all) hostile powers.",
   "03.027.04": "Agni, inflamed at the sacrifice, the purifier who should be magnified, whose hair is flame—him we approach (with prayers).",
   "03.027.05": "With his broad stream of light the immortal Agni, clothed in ghee, well served with oblations, is the carrier of offerings at the sacrifice.",
   "03.027.06": "Holding the (sacrificial) ladles, performing the sacrifice they have with right thought pressingly brought Agni hither 1 for help.",
   "03.027.07": "The Hotri, the immortal god goes in front with his secret power 1, instigating the sacrifices 2.",
   "03.027.08": "The strong (horse, i. e. Agni) is set at the races. He is led forth at the sacrifices, the priest, the accomplisher of sacrifice.",
   "03.027.09": "He has been produced 1 by prayer, the excellent one. I have established 2 him, the germ of beings, for ever the father of Daksha 3.",
   "03.027.10": "I have laid thee down 1, the excellent one, with the nourishment 2 of Daksha, O thou who art produced by power, O Agni, thee the resplendent one, O Usig 3.",
   "03.027.11": "The priests, eager to set to work the Rita 1, kindle with quick strength Agni the governor 2, him who crosses the waters 3.",
   "03.027.12": "I magnify 1 the child of vigour at this sacrifice, who shines under the heaven, the thoughtful Agni.",
   "03.027.13": "He who should be magnified and adored, who is visible through the darkness, Agni, the manly, is kindled 1.",
   "03.027.14": "Agni, the manly, is kindled, he who draws hither the gods like a horse. The (worshippers) rich in offerings magnify him.",
   "03.027.15": "We the manly ones will kindle thee the manly (god), O manly Agni who shinest mightily.",
   "03.028.01": "O Agni Gâtavedas, accept graciously our offering, the sacrificial cake at the morning libation, O god who givest wealth for our prayers.",
   "03.028.02": "The sacrificial cake, O Agni, has been baked or made ready for thee: accept it graciously, O youngest (god).",
   "03.028.03": "Agni, accept eagerly the sacrificial cake which has been offered, which has stood overnight. Thou art the son of strength, established at the sacrifice.",
   "03.028.04": "At the midday libation, Gâtavedas, accept here graciously the sacrificial cake, O sage. Agni, the wise ones do not diminish at the sacrificial distributions 1 the portion which belongs to thee, the vigorous one 2.",
   "03.028.05": "Agni, at the third libation take joyfully the sacrificial cake, O son of strength, which has been offered. And in thy admirable way place our wakeful sacrifice, blessed with treasures, before the immortal gods.",
   "03.028.06": "Agni, grown strong, O Gâtavedas, accept graciously our offering, the sacrificial cake which has stood overnight.",
   "03.029.01": "1 This is the support on which the rubbing (for producing the fire) is performed 2; the creative organ 3 has been prepared. Bring hither the house-wife 4; let us produce Agni by rubbing in the old way.",
   "03.029.02": "In the two fire-sticks dwells Gâtavedas, as the germ (lies) safe in pregnant women—Agni who should be magnified 1 day by day by wakeful men who bring offerings.",
   "03.029.03": "Place it 1 skilfully into her who lies extended 2. Having conceived she has quickly given birth to the manly one. He whose summit is red—bright is his splendour—the son of Ilâ has been born in the (due) way 3.",
   "03.029.04": "In the place of Ilâ, on the navel of the earth we will lay thee down, Gâtavedas, that thou, O Agni, mayst carry the offerings (to the gods).",
   "03.029.05": "Rub, ye men, the truthful sage, the wise, the immortal, the fair-faced. Bring forth, ye men, Agni, the banner of sacrifice, the first in the front, the gracious one.",
   "03.029.06": "When they produce him by rubbing with their arms, he shines forth laming in the wood like a red race-horse. Like the bright one on the path of the Asvins 1 the unrestrained (Agni) spares the stones, burning the grass 2.",
   "03.029.07": "Agni, when born, shines forth resplendent, the racer, the priest, praised by the sages, the giver of rain, whom the gods placed in the sacrifices, to be magnified, as the omniscient carrier of the sacrificial offerings.",
   "03.029.08": "Sit down, O Hotri, in the space which is thine, as the knowing one. Place the sacrifice in the abode of good works (i. e. on the altar). Eagerly longing for the gods thou shalt worship the gods by offerings. Agni, bestow mighty vigour on the sacrificer.",
   "03.029.09": "Produce a mighty 1 smoke, ye friends. Without fail go forward towards strength. This Agni is the conqueror in battles, rich in valiant men, he by whom the gods have overpowered the Dasyus.",
   "03.029.10": "This is thy birth-place in due time whence born thou shonest forth; knowing it, O Agni, sit down on it, and make our prayers prosper.",
   "03.029.11": "He is called Tanûnapât as the Asura's germ. Narâsamsa he becomes when he is born, Mâtarisvan when he has been shaped in the mother 1. And he has become the rush of the wind in his swift course 2,",
   "03.029.12": "Rubbed forth by skilful rubbing, established by skilful establishing, as a sage, O Agni, perform excellent sacrifices. Sacrifice to the gods for him who is devoted to the gods 1.",
   "03.029.13": "The mortals have generated the immortal one, the … 1, advancing one with strong jaws. The ten unwedded sisters 2 united take care of the man (Agni) when he has been born.",
   "03.029.14": "He the god of the seven Hotris shone forth from of old, when he flamed up in his mother's lap, at her udder. Day by day the joyous one never closes his eyes, when he has been born from the Asura's (i. e. of the Heaven's?) belly 1.",
   "03.029.15": "The onsets of (Agni) when he attacks his enemies, are like those of the Maruts. (He is) the first-born (son) of the sacred spell. They know every (fire) 1. The Kusikas have raised their brilliant spell; they have kindled Agni, every one in his house.",
   "03.029.16": "After we had chosen thee here to-day, O wise Hotri, while this sacrifice was going on, thou hast firmly sacrificed and firmly laboured. Come to this Soma, expert and knowing!",
   "04.001.01": "Thee, O Agni, the gods concordantly have ever set to work as their divine steward; with this intention 1 they have set thee to work. They have generated 2 thee, O worshipful one 2, the immortal among the mortals, the wise, god-loving god; they have generated every wise, god-loving (Agni) 3.",
   "04.001.02": "Do thou, [O Agni 1,] turn to brother Varuna, towards the gods 2 with thy kindness 3, to (Varuna) who accepts the sacrifice, to the eldest (god) who accepts the sacrifice, the righteous Âditya who supports the (human) tribes, the king who supports the (human) tribes.",
   "04.001.03": "O friend, turn to thy friend (Varuna), as a wheel of a chariot 1 rapidly (follows) the swift (horse), for our sake, O wonderful one, rapidly. O Agni, find mercy (for us) with Varuna, with the all-brilliant Maruts. Bless (us), O flaming one, that we may propagate ourselves, that we may press onward; bless us, O wonderful one!",
   "04.001.04": "Mayst thou, O Agni, who knowest Varuna, deprecate for us the god's anger. Being the best sacrificer, the best carrier (of the gods), flaming, remove from us all hatred.",
   "04.001.05": "As such, O Agni, be for us the lowest  1 (god) with thy help, our nearest (friend) while this dawn shines forth. Being liberal (towards us), cause, by sacrificing, Varuna to go away from us. Love mercy; readily hear our call.",
   "04.001.06": "His, the fortunate god's, appearance is excellent, and most brilliant among mortals. Like the bright, heated butter of the cow (the appearance) of the god is lovely, like the bountifulness of a milch-cow.",
   "04.001.07": "Three 1 are those highest, true, and lovely births of this god Agni. Being enveloped in the infinite 2 he has come hither, the bright, brilliant, shining Aryan.",
   "04.001.08": "He, the messenger, longs for all seats, the Hotri with the golden chariot, with the lovely tongue, with the red horses, of marvellous appearance, brilliant, always lovely like an assembly abundant in food.",
   "04.001.09": "He, the kinsman of sacrifice, has enlightened men 1. They lead him forward by a great rope 2. He dwells in his (the mortal's) dwelling, accomplishing (his task). The god has obtained the companionship of the mortal.",
   "04.001.10": "May this Agni, the knowing one, lead us to the god-given treasure which belongs to him 1. That (treasure) which all the immortals have created by their thought, which Dyaus, the father, the begetter (has created): that real (treasure) they have besprinkled 2.",
   "04.001.11": "He has been born in the dwellings as the first, at the bottom of the great (air) 1, in the womb of this air 2, footless, headless, hiding both his ends, drawing towards himself (his limbs?), in the nest of the bull 3.",
   "04.001.12": "The host 1 came forth wonderfully at first, in the womb of Rita, in the nest of the bull 2, lovely and young, of marvellous appearance, and brilliant 3. Seven friends 4 were born for the bull.",
   "04.001.13": "Here our human fathers have sat down 1, aspiring after Rita 2. Invoking the dawns 3, they have driven out the milch-cows which dwelt in the rock-stable, in the prison.",
   "04.001.14": "Having rent the rock they cleaned themselves. Others around told forth that (deed) of theirs. Taking … as an instrument (?) 1, they sang triumphantly 2. They found the light; they chanted their prayers.",
   "04.001.15": "Longing for the cows in their mind, those men, the Usigs 1, have opened with godly words the fast-holding, closed rock, which enclosed and encompassed the cows, the firm stable full of cows.",
   "04.001.16": "They have devised the first name of the milch-cow; they have found the three times seven highest (names or essences) of the mother 1. The hosts 2, understanding this, acclaimed. The red one 3 became visible through the brilliant (milk?) 4 of the cow.",
   "04.001.17": "The confused 1 darkness disappeared; the sky appeared in splendour; the shine of the goddess Dawn rose up. The Sun ascended to the wide plains, beholding right and wrong deeds among the mortals.",
   "04.001.18": "Then, afterwards, being awoke they looked around; then they took that treasure given by Heaven, all the gods in all the houses. O Mitra, may true (fulfilment) belong to (our) prayer, O Varuna!",
   "04.001.19": "I will address flaming Agni, the Hotri, the supporter of everything 1, the best sacrificer. He has perforated, as it were, the pure udder of the cows, (and has made flow the milk) purified like the poured sap of the Soma shoots.",
   "04.001.20": "He, the Aditi (i. e. the freedom) of all the worshipful gods, the guest 1 of all men, Agni, choosing (for us) the protection of all gods—may he, Gâtavedas, be merciful.",
   "04.002.01": "He who has been established as the steward among the mortals, the immortal, righteous one, and among the gods, being a god himself, the Hotri, the best sacrificer shall mightily flame 1; Agni shall rise up 1 with the offerings of Manus.",
   "04.002.02": "Here, O Agni, son of strength, thou goest for us to-day as a messenger, thou who art born, between the two races (of men and gods), having harnessed, O tall one, thy puissant, manly, brilliant (stallions) 1.",
   "04.002.03": "Harnessing the two mighty, red steeds that swim in ghee—(the steeds) of Rita, I think, that are most swift with their mind 1, the ruddy ones, thou goest (as a messenger) between you, the gods, and the tribes of men 2.",
   "04.002.04": "O Agni, with thy good horses, and thy good chariot, rich in bounties, bring hither from among them (the gods) 1 Aryaman, Varuna, and Mitra, Indra and Vishnu, the Maruts and the Asvins, to him who offers good oblations.",
   "04.002.05": "This sacrifice, O Agni, is rich in cows 1, in sheep and horses, in manly friends; it is never to be despised; it is rich in nourishment, O wonderful lord 2, rich in offspring; it is long-lasting wealth, broad-based, with (brilliant) assemblies.",
   "04.002.06": "1 Be a self-strong protector, O Agni, of the man who in the sweat of his brow brings fuel to thee 2, or heats his head desirous to worship thee. Deliver him from every harmful man.",
   "04.002.07": "The man who brings food to thee who art desirous of food, he who stirs up 1 the cheerful guest and rouses him, the godly man who kindles thee in his dwelling: to him may belong lasting and generous wealth.",
   "04.002.08": "The sacrificer who praises thee in the evening and in the morning and gratifies thee; that liberal man thou shouldst bring across all distress, like a well-impelled horse 1, (dwelling) in his house.",
   "04.002.09": "The man who worships thee, the immortal one, O Agni, and who honours thee, holding the sacrificial ladle—may he, the toiling (sacrificer), not be deprived of wealth; may no distress that comes from a harmful (foe), surround him.",
   "04.002.10": "That mortal whose well-ordered sacrifice thou, as the god, acceptest, O Agni, as a liberal giver, may his worship 1 be welcome, O youngest god, (the Hotri's work performed) for a worshipper whose helpers we may be.",
   "04.002.11": "May he, the knowing one, distinguish wisdom and folly of mortals 1, like straight and crooked backs (of horses) 2. And for the sake of wealth and noble offspring, O god, grant us Diti and keep off Aditi 3.",
   "04.002.12": "The undeceived sages instructed the sage (Agni), setting him down in the dwellings of Âyu 1. Hence mayst thou behold, O Agni, with thy eyes 2 these beings visible and secret (that move) on the Arya's ways 3.",
   "04.002.13": "Bring thou, O Agni, youngest (god), who art a good guide, a plentiful, brilliant treasure to the worshipper who presses Soma, who serves thee and toils, to help him, O brisk one, who fillest the dwellings of peoples.",
   "04.002.14": "1 And whatsoever we have done, O Agni, out of devotion for thee, with our feet 2, with our hands, with our bodies: (in those deeds of ours) the wise have held up the Rita, aspiring after it, like those who manage a chariot by means of the two pole-arms (?) 3.",
   "04.002.15": "And may we be born from the Dawn, the mother, as the seven priests 1, as the first worshippers among men 2. May we be the Aṅgiras, the sons of Heaven. May we flaming break the rock which contains the prize of the contest 3.",
   "04.002.16": "And as our first, ancient fathers, O Agni, were aspiring after Rita 1—they attained to pure devotion 2, chanting their litanies. Cleaving the earth they disclosed the red (cows).",
   "04.002.17": "The pious men, well performing the acts (of worship), resplendent, melting 1 the generations of the gods 2 like ore 3, kindling Agni, strengthening Indra, went along 4, besieging the stall of cows.",
   "04.002.18": "He looked (on the gods) as on herds of cattle 1 in a rich (pasture) 2, when the generations of the gods (were) near him, O mighty one 3. After (the generations) of the mortals the Urvasîs 4 have pined, for the growing strong of the Arya 5, of the nearer Âyu 6.",
   "04.002.19": "We have done our work for thee; we have been good workers—the brilliant dawns have shone out Rita 1,—brightening 2 the perfect Agni who manifoldly shines with fine splendour, (brightening) the god's beautiful eye.",
   "04.002.20": "We have recited these hymns for thee, the sage, O Agni, worshipper (of the gods) 1; accept them! Blaze up; make us wealthier. Bestow great wealth on us, O bountiful one!",
   "04.003.01": "Draw Rudra hither for your protection 1, the king of sacrifice, the truly sacrificing Hotri of the two worlds 2, the golden-coloured Agni, before the unseen thunderbolt (strikes you).",
   "04.003.02": "This is the home which we have prepared for thee as a well-dressed, loving wife (prepares the marriage-bed) for her husband 1. Directed hitherward, dressed (in offerings and prayers?) 2 sit down. These (sacrificial ladles or prayers?) are turned towards thee, O most skilful one 3!",
   "04.003.03": "To him who hears us, who is not proud, who beholds men, to the merciful, immortal god recite a prayer, O worshipper, a hymn—(to Agni) whom the presser (of Soma), the Madhu-presser, magnifies like the pressing-stone 1.",
   "04.003.04": "Thou who art well-intentioned, give heed to this our toiling 1, to this Rita 2, O observer of Rita! When will our hymns share in thy rejoicings? When will our friendship dwell in thy house?",
   "04.003.05": "How wilt thou, O Agni, before Varuna, and how wilt thou, and which sin of ours wilt thou blame before Dyaus? How wilt thou speak to bountiful Mitra, to the Earth? What (wilt thou say) to Aryaman, to Bhaga?",
   "04.003.06": "What wilt thou say, O Agni, when thou hast grown strong on the Dhishnya altars 1? What to strong Vâta who goes forward in triumph 2? To the Nâsatya 3 who goes round the earth 4, to … 5? What, O Agni, to Rudra, the man-killer?",
   "04.003.07": "How (wilt thou speak) to great Pûshan who brings prosperity? What (wilt thou say) to martial Rudra, the giver of offerings 1? What sin 2 wilt thou announce to wide-ruling Vishnu, what, O Agni, to the mighty weapon (of the gods)?",
   "04.003.08": "How wilt thou answer, when thou art asked, to the righteous 1 host of the Maruts? How to the mighty Sun, to the quick Aditi 2? Accomplish thy work, O Gâtavedas, thou who knowest the Heaven!",
   "04.003.09": "I magnify 1 the Rita of the cow 2 ruled by Rita and also by the raw one 3, the honey-sweet, ripe (milk), O Agni. Though being black this (cow) swells of bright drink, of … 4 milk.",
   "04.003.10": "With Rita indeed, with the milk of the back 1, the bull has been anointed, Agni the man. Without trembling he moved on bestowing his vigour. The speckled bull has poured out his bright udder 2.",
   "04.003.11": "1 By the Rita the Aṅgiras have broken the rock and cleft it asunder; they have shouted together with the cows. Prosperously the men have surrounded 2 the Dawn. The Sun appeared when Agni (the fire) had been born 3.",
   "04.003.12": "By the Rita the immortal, uninjured 1 goddesses, the Waters, O Agni, with their honey-sweet waves have sped forward 2 for ever to flow (along their course), like a racer incited by shouting when (the race-horses) are let loose.",
   "04.003.13": "Go never on thy crooked way to the spirit (which avenges the guilt) of anybody 1, of a vassal who has trespassed, or of a friend. Require not (of us),a sinful brother's debt 2. May we not have to suffer under the spirit which avenges a friend's or a (hostile) deceiver's guilt 3.",
   "04.003.14": "Protect us, O Agni, with all thy protection, thou who art protected, O martial one 1, and art gladdened (by us). Sparkle forth, and destroy even strong evil! Slay the Rakshas even though it has grown large.",
   "04.003.15": "Be gracious, O Agni, through these our hymns. Touch, O hero, this wealth moved by our prayers. And accept, O Aṅgiras, our sacred words. May the praise, beloved by the gods, resound to thee 1.",
   "04.003.16": "I, the priest, have rehearsed to thee the omniscient one, O Agni, worshipper (of the gods), all these songs, these inmost words, these recitations and words of wisdom, to thee the wise one, with prayers and hymns.",
   "04.004.01": "Produce thy stream of flames like a broad onslaught. Go forth impetuous like a king with his elephant 1; …  2 after thy greedy onslaught, thou art an archer; shoot the sorcerers with thy hottest (arrows).",
   "04.004.02": "Thy whirls fly quickly. Fiercely flaming touch (them). O Agni, (send forth) with the ladle 1 thy heat, thy winged (flames); send forth unfettered thy firebrands all around.",
   "04.004.03": "Being the quickest, send forth thy spies against (all evildoers). Be an undeceivable guardian of this clan. He who attacks us with evil spells, far or near, may no such (foe) defy thy track.",
   "04.004.04": "Rise up, O Agni! Spread out against (all foes)! Burn down the foes, O (god) with the sharp weapon! When kindled, O Agni, burn down like dry brushwood, the man who exercises malice against us.",
   "04.004.05": "Stand upright, strike (the foes) away from us! Make manifest thy divine (powers), O Agni! Unbend the strong (bows) of those who incite demons (against us) 1. Crush all enemies, be they relations or strangers.",
   "04.004.06": "He knows thy favour, O youngest one, who makes a way for a sacred speech like this. Mayst thou beam forth to his doors all auspicious days and the wealth and the splendour of the niggard.",
   "04.004.07": "Let him, O Agni, be fortunate and blessed with good rain, who longs to gladden thee with constant offerings and hymns through his life in his house. May such longing ever bring auspicious days to him.",
   "04.004.08": "I praise thy favour; it resounded here. May this song (which is like) a favourite wife, awaken for thee 1. Let us brighten thee, being rich in horses and chariots. Mayst thou maintain our knightly power day by day.",
   "04.004.09": "May (the worshipper) here frequently of his own accord approach thee, O (god) who shinest in darkness 1, resplendent day by day. Let us worship thee sporting and joyous, surpassing the splendour of (other) people.",
   "04.004.10": "Whoever, rich in horses and rich in gold, approaches thee, O Agni, with his chariot full of wealth—thou art the protector and the friend of him who always delights in showing thee hospitality.",
   "04.004.11": "Through my kinship (with thee) I break down the great (foes) by my words 1. That (kinship) has come down to me from my father Gotama. Be thou attentive to this our word, O youngest, highly wise Hotri, as the friend of our house.",
   "04.004.12": "May those guardians of thine, infallible Agni, sitting down together protect us, the never sleeping, onward-pressing, kind, unwearied ones, who keep off the wolf, who never tire.",
   "04.004.13": "1 Thy guardians, O Agni, who seeing have saved the blind son of Mamatâ from distress—He the possessor of all wealth has saved them who have done good deeds. The impostors, though trying to deceive, could not deceive.",
   "04.004.14": "In thy companionship we dwell, protected by thee. Under thy guidance let us acquire gain. Accomplish both praises 1, O (thou who art the) truth! Do so by thy present power, O fearless one!",
   "04.004.15": "May we worship thee, O Agni, with this log of wood. Accept the hymn of praise which we recite. Burn down those who curse us, the sorcerers. Protect us, O (god) who art great like Mitra, from guile, from revilement, and from disgrace.",
   "04.005.01": "How may we unanimously offer mighty light 1 to bountiful Agni Vaisvânara? With his mighty perfect growth he supports the high bank 2 like a pillar.",
   "04.005.02": "Do not reproach Him, the self-dependent one, who has given this bounty to me, the god to the mortal, the clever one to the simple, the wise immortal, the most manly, restless1 Agni Vaisvânara.",
   "04.005.03": "Agni, the sharp-pointed, the mighty bull with thousandfold sperm, has proclaimed to me the great, doubly-powerful 1 Sâman, the prayer, having found, as it were, the hidden track of a cow 2.",
   "04.005.04": "May Agni, he who is rich in wealth, whose teeth are sharp, consume with his hottest flames those who violate the laws founded by Varuna, the beloved, firm (laws) of attentive Mitra.",
   "04.005.05": "1 They who roam about like brotherless girls 2, of evil conduct like women who deceive their husbands, being wicked, sinful, and untrue—they have created for themselves this deep place 3.",
   "04.005.06": "On me, however small, but innocent, thou, O purifying Agni, hast fiercely placed this mighty, deep, vigorous prayer, like a heavy burden, this Prishtha 1, consisting of seven elements 2.",
   "04.005.07": "Let our prayer which purifies Him, through the power of mind (inherent in it), reach Him who is the common (property of all men) alike, the good (name?) of Prisni on the skin of the herbs, on the summit of the … 1.",
   "04.005.08": "What should be openly uttered by me of this speech? They secretly speak of that which is hidden 1. When they have uncovered, as it were, the water of the cows 2, he guards the beloved summit of the … 3, the footstep of the bird 4.",
   "04.005.09": "He has found in secret that great face of the great ones which the bright cow accompanied 1, the ancient (face) shining in the abode of Rita, the quickly running, quickly moving.",
   "04.005.10": "And resplendent near his parents (Heaven and Earth), in their presence, he thought of the secret, good (name?) of Prisni. The tongue of the manly, forward-bent flame (seized) that which was near at hand in the highest abode of the mother, the cow 1.",
   "04.005.11": "I speak, when being asked, Rita (i. e. truth), out of reverence (for Agni, or for the gods), out of hope 1 placed in thee, O Gâtavedas, as I am here 2. Thou rulest over all this wealth whatever (dwells) in heaven and earth.",
   "04.005.12": "Which of this wealth is ours, what treasure? Mayst thou who knowest it declare to us (that treasure), O Gâtavedas! What is the highest (aim) of this our way, is hidden. We have not come scolding to an empty (?) 1 place.",
   "04.005.13": "1 What is the limit, what the objects? What pleasant (wealth) may we obtain as swift (horses gain) the prize? When will the Dawns, the divine consorts of the immortal, expand over us with the sun's splendour?",
   "04.005.14": "And what do those insatiable ones here say, O Agni, with their sapless, feeble, weak speech that has to be listened to? Let them unarmed fall into nothingness.",
   "04.005.15": "The face of this kindled, manly Vasu has shone gloriously in the house. Clothed in brilliancy, with his shape beautiful to behold, the bountiful has shone like a house 1 with its wealth.",
   "04.006.01": "Stand upright for us, O Agni, Hotri of the sacrifice, the best performer of sacrifices among the gods. For thou art the master of every thought; thou promotest the worshipper's prayer.",
   "04.006.02": "The unerring Hotri has sat down among the people, joy-giving Agni, the wise one at the sacrifices 1. Like Savitri he has sent his light upward. Like a builder he has reared his smoke up to the sky.",
   "04.006.03": "1 (The ladle) glowing, filled with gifts, with butter, is stretched forth. From left to right (does Agni move) choosing the divine people. Upright (stands) the (sacrificial) post like a new-born foal 2; well-placed, well-established it anoints the victims 3.",
   "04.006.04": "After the sacrificial grass has been spread and the fire kindled, the delighted Adhvaryu has stationed himself upright. Agni, the Hotri, chosen from of old, goes round thrice, like a shepherd.",
   "04.006.05": "As Hotri, measuredly running, Agni, the joy-giving, sweet-tongued, the righteous, goes around by his own might. His flames run forward like race-horses; all beings are afraid when he has shone forth.",
   "04.006.06": "Beautiful, O fair-faced Agni, is thy aspect, who art terrible and manifold; pleasant (it is). As they have not hindered thy light by darkness, no bespatterers have left stains on thy body.",
   "04.006.07": "He whose mother (?) 1 has not been hindered from giving birth, nor his father and mother whenever they were incited (?) 2: this Agni, the purifier, well-established like Mitra 3, has shone among the tribes of men,—",
   "04.006.08": "Agni, whom the twice-five sisters 1, dwelling together, have engendered among the human tribes, who awakes at dawn, who is bright like an elephant's (?) 2 tooth, whose mouth is beautiful, who is sharp like an axe.",
   "04.006.09": "1 Agni, those golden horses of thine swimming in ghee, the red ones which go straight forward, the fleet ones, the brilliant, manly, wonderful horses, puissant stallions, have called hither the divine people.",
   "04.006.10": "Those victorious, never-tiring 1, fierce flames of thine, O Agni, which move about, hasten 2 to their goal like hawks; they roar mightily like the host of the Maruts.",
   "04.006.11": "1 (This) hymn has been produced for thee, O Agni, when thou wert kindled. May (the priest) recite the litany; mayst thou distribute (treasures) to him who sacrifices. Men have set down Agni as the Hotri, the Usigs, adoring (Him), the praise of Âyu 2.",
   "04.007.01": "This (Agni) has been established here as the first by the establishers, the Hotri, the best sacrificer who should be magnified at the sacrifices, whom Apnavâna and the Bhrigus have made shine, brilliant in the woods, spreading to every house.",
   "04.007.02": "Agni! When will the splendour of thee, the god, appear in the right way? For verily the mortals have seized thee who shouldst be magnified in the houses.",
   "04.007.03": "Seeing the righteous, wise one, like the heaven with the stars, who produces joy at all sacrifices, from house to house—",
   "04.007.04": "The quick messenger of Vivasvat who rules over all human tribes: Him the Âyus have brought hither to every house, the light, him who belongs to the Bhrigus.",
   "04.007.05": "Him the knowing one they have set down in the right way as the Hotri, the gay one with his purifying flames, the best sacrificer with his seven (forms 1)—",
   "04.007.06": "Him who is enveloped in many mothers, in the wood 1, who does not rest thereon (?) 2, who is brilliant, though hidden in secret, easily to be found, and striving for all that is desired.",
   "04.007.07": "When the gods rejoiced in the … of the herbs 1, in that udder 2, in the foundation of Rita 3, the great -Agni, to whom offerings are made with adoration, the righteous one, always approached eagerly for the sake of sacrifice.",
   "04.007.08": "1 Thou, the knowing one, hast eagerly performed the messengership of the sacrifice, looking over both ends, over the two worlds. Thou goest as a messenger, chosen from of old, thou who knowest best the ascents to heaven.",
   "04.007.09": "Thy path is black. Light is before thee, the red one. Thy flame is speedy. This is one of the wonders: when the virgin conceives (thee as her) child 1, thou becomest a messenger, as soon as thou art born.",
   "04.007.10": "As soon as he is born, his strength shows itself, when the wind blows upon his flame. He turns his sharp tongue among the dry brushwood. Even solid food he tears to pieces with his teeth.",
   "04.007.11": "When he thirstily has grown strong by thirsty food 1, restless Agni appoints a thirsty messenger. Consuming (the wood) he follows the … 2 of the wind. He seems to drive forward a quick horse; the racer speeds along.",
   "04.008.01": "I press on for you with my prayer to the all-possessing messenger, the immortal bearer of offerings, the best sacrificer.",
   "04.008.02": "He, the great one, knows indeed the place of wealth 1, the ascent to heaven; may he, (therefore,) conduct the gods hither.",
   "04.008.03": "He, the god, knows how to direct the gods for the righteous (worshipper), in his house. He gives (us) wealth dear (to us).",
   "04.008.04": "He is the Hotri; he who knows the office of a messenger, goes to and fro (between men and gods), knowing the ascent to heaven.",
   "04.008.05": "May we be of those who have worshipped Agni with the gift of offerings, who cause him to thrive and kindle him.",
   "04.008.06": "The men who have brought worship to Agni, are renowned as successful by wealth and by powerful offspring.",
   "04.008.07": "May much-desired wealth come to us day by day; may gains arise among us.",
   "04.008.08": "He (Agni), the priest of the tribes, (the priest) of men, pierces (all hostile powers) by his might as with a tossing 1 (bow).",
   "04.009.01": "Agni, have mercy! Thou art great, who hast come to this pious man to sit down on the sacrificial grass.",
   "04.009.02": "He who cannot be deceived, the zealous, the immortal has among men become the messenger of all.",
   "04.009.03": "He, the joy-giving Hotri, is led around the sacred seat at the heaven-aspiring sacrifices. And he sits down as the Potri also.",
   "04.009.04": "Agni sits down also as (the sacrificer's) wife 1 at the sacrifice, and as the master of the house in the house, and as the Brahman 2.",
   "04.009.05": "Thou zealously approachest as the Upavaktri 1 of the people who perform the sacrificial service, and (thou approachest) the offerings of men.",
   "04.009.06": "And thou zealously performest the messenger-ship for the man in whose sacrifice thou takest pleasure, in order to bear the mortal's offering (to the gods).",
   "04.009.07": "Find pleasure 1 in our rites, in our sacrifice, O Aṅgiras. Hear our call!",
   "04.009.08": "May thy unerring chariot, by which thou protectest the worshippers, encompass us from every side.",
   "04.010.01": "1 O Agni! May we to-day successfully perform, with thy heedfulness 2, this praise 3 which touches thy heart, which is like a horse, like auspicious power of the mind.",
   "04.010.02": "For verily thou, O Agni, hast become the charioteer of auspicious power of the mind, of real ability, and of the mighty Rita.",
   "04.010.03": "Through these our hymns direct thyself hither-wards to us like the sun with its light 1, O Agni, gracious with all thy faces.",
   "04.010.04": "May we to-day worship thee, O Agni, praising thee with these songs. Thy roarings thunder like (the thunder) of Heaven.",
   "04.010.05": "Thy sweetest aspect, O Agni, shines near us for glory's sake, now by day, now by night, like gold.",
   "04.010.06": "Like purified ghrita is thy stainless body; (it is) brilliant gold: that (body) of thine has shone 1, O self-dependent one, like gold.",
   "04.010.07": "For even a malice which one has committed, thou verily drivest away entirely, O righteous Agni, from the sacrificing mortal 1.",
   "04.010.08": "May our friendship, O Agni, our brotherhood with you, the gods, be blessed. This is our navel (i. e. relation) in our seat, in this udder 1.",
   "04.011.01": "Thy auspicious face, O mighty Agni, shines in the neighbourhood of the sun 1. Brilliant to see, it is seen even by night. Soft to behold is the food in thy (beautiful) body 2.",
   "04.011.02": "O Agni, disclose (wise) thoughts for him who praises thee; (disclose) the opening, when thou, O strong-born, hast been praised with trembling. Grant unto us, O very great one, such a rich prayer as thou with all the gods wilt hold dear, O brilliant one.",
   "04.011.03": "From thee, O Agni, genius is born, from thee (wise) thoughts, from thee beneficent hymns. From thee comes wealth adorned with heroes 1 to the thus-minded mortal who worships thee.",
   "04.011.04": "Thee, O Agni, the pious mortals seek to win by their prayers as the first, thee the god with agreeable speech, O immortal, who drivest away malice, the household god, the lord of the house, the wise one.",
   "04.011.05": "(Drive) far from us senselessness and anguish; (drive) far all ill-will from him whom thou attendest 1. Be gracious at evening, Agni, son of strength, to him whom thou, the god, attendest with welfare.",
   "04.012.01": "May the man who holds the sacrificial ladle and kindles thee, O Agni, who thrice prepares food for thee on this day, victoriously overcome (his foes) through his lustre, wise through the power of thy mind, O Gâtavedas.",
   "04.012.02": "1 He who toiling brings fuel to thee, doing service to thy, the great (god's) face, O Agni, kindling thee at evening and at dawn—he prospers, obtains wealth, and destroys his enemies.",
   "04.012.03": "Agni is master of mighty royal power 1; Agni (is master) of gain, of the highest wealth. He, the youngest, self-dependent (god) in the right way distributes treasures to the mortal worshipper.",
   "04.012.04": "Whatever sin, O youngest (god), we have committed against thee in thoughtlessness, men as we are 1, make thou us sinless before Aditi; release us from (every) guilt on all sides, O Agni!",
   "04.012.05": "Even from great guilt, O Agni, from the prison of gods and of mortals—let us, thy friends, never be harmed; grant luck and weal to kith and kin.",
   "04.012.06": "1 As you formerly have released, O Vasus, the buffalo cow bound by the foot, O worshipful gods, thus take away from us this distress. May, O Agni, our life be further prolonged.",
   "04.013.01": "Benevolent Agni has looked on the breaking of the shining dawns, on the bestowal of treasures. Come to the dwelling of the virtuous (mortal), ye Asvins. The god Sûrya rises with his light.",
   "04.013.02": "The god Savitri has sent his light upward 1, shaking his banner 2 like a warrior who fights for cows 3. Varuna and Mitra follow the law, when they make the Sun rise on heaven.",
   "04.013.03": "Him whom (the gods) dwelling in firm peace, and never losing their object, have created for dispersing the darkness—Him, the Sun, the all-observer, the seven young fallow mares carry forward.",
   "04.013.04": "With (thy horses) most ready to run thou goest 1 forward, spreading out thy web (of light), removing (from the world) the black cloth (of darkness), O god. The rays of the Sun have shaken 2 the darkness, and have sunk it into the waters like a hide.",
   "04.013.05": "Unsupported, unattached, spread out downwards-turned—how is it that he 1 does not fall down? By what power of his does he move? Who has seen (that)? Erected as the pillar of Heaven he protects the firmament.",
   "04.014.01": "Agni Gâtavedas, the god, has looked on the dawns that shine with all their might 1. Come hither, O Nâsatyas 2, wide-ruling (gods), on your chariot to this our sacrifice.",
   "04.014.02": "The god Savitri has sent his shine upward, producing light for the whole world. The Sun, shining with his rays, has filled Heaven and Earth and the air.",
   "04.014.03": "The red one 1, carrying hither (bliss) 2, has come with her light, the great, brilliant one, shining with her rays. Ushas, the goddess, awakening (all beings) to welfare, goes along on her well-yoked chariot.",
   "04.014.04": "May those chariots and horses, most ready to drive, drive you 1 hither at the break of dawn. For these Somas are for you that you may drink the honey-drink 2. Rejoice, O manly ones, at this sacrifice.",
   "04.014.05": "5̅ = IV, 13, 5.",
   "04.015.01": "Agni, the Hotri, he who is a strong horse, is led around at our sacrifice, the god worshipful among the gods.",
   "04.015.02": "Agni goes thrice 1 around the sacrifice, like a charioteer, conveying the enjoyment 2 to the gods.",
   "04.015.03": "Agni, the lord of booty, the sage, has circumambulated the oblations, bestowing treasures on the worshipper.",
   "04.015.04": "This (is the Agni) who is kindled in the front for Devavâta's son, the Sriñgaya 1, the brilliant (god), the deceiver of foes.",
   "04.015.05": "May the strong mortal be the master of this (god), of an Agni like this, with sharp teeth and bountiful.",
   "04.015.06": "1 Him they clean day by day like a racer that wins (booty), like (Soma), the red young child of Heaven 2.",
   "04.015.07": "When Sahadeva's son, the prince, thought of me with two bay horses 1, I rose up like one who is called.",
   "04.015.08": "And immediately I accepted from Sahadeva's son, the prince, those adorable two bay horses which he offered me.",
   "04.015.09": "May this prince Somaka, Sahadeva's son, live long, for your sake, O divine Asvins!",
   "04.015.10": "Give long life, O divine Asvins, to this son of Sahadeva, the prince!",
   "05.001.01": "Agni has been wakened by the fuel of men, in face of the Dawn who approaches like a milch-cow. His flames stream forward to the sky like quick (birds) that fly up to a branch.",
   "05.001.02": "The Hotri has been wakened that there may be sacrifice for the gods. Gracious Agni has stood upright in the morning. When he has been kindled, his brilliant stream of flames has been seen. The great god has been released from darkness.",
   "05.001.03": "When he has wakened the string of the crowd (of worshippers) 1, the bright Agni anoints himself with bright cows 2. Then the Dakshinâ is yoked, striving for gain 3. He who stands upright has, by the sacrificial ladles, sucked her who lies extended 4.",
   "05.001.04": "Towards Agni the minds of the pious turn together as (all) eyes (turn) to the sun. When both Dawns of different colour 1 give birth to him, the white racer is born at the beginning of days.",
   "05.001.05": "For He, the noble one, has been born at the beginning of days, the red one has been laid down in the woods that have been laid down. Agni, the Hotri, the best sacrificer, has sat down, bestowing his seven treasures on every house.",
   "05.001.06": "Agni, the Hotri, the best sacrificer, sat down in the mother's lap, in the sweet-smelling place, the young sage growing up in many places, the righteous one, the supporter of tribes, and kindled in their midst.",
   "05.001.07": "They magnify with adorations that priest efficacious at sacrifices, Agni the Hotri, who has spread himself over heaven and earth according to Rita; they groom (Agni), the own racer (of men), with Ghrita.",
   "05.001.08": "He who likes to be groomed, is groomed in his own (abode), the house-friend 1, praised by sages, our auspicious guest, the bull with a thousand horns who has the strength of such a one. O Agni! By this power thou surpassest all other (beings).",
   "05.001.09": "O Agni! Thou overtakest all other (beings) in one moment (for the sake of him) to whom Thou hast become visible as the fairest one, thou who shouldst be magnified, the wonderful, brilliant one, the beloved guest of human clans.",
   "05.001.10": "To thee, O youngest (god), the tribes bring tribute, O Agni, from near and far. Behold 1 the grace of the most glorious (god)! Mighty, O Agni, is thy great and glorious shelter.",
   "05.001.11": "Mount to-day, O shining Agni, the shining car, in the neighbourhood of the worshipful (gods). Knowing the paths, the wide air 1, bring hither the gods that they may eat the oblation.",
   "05.001.12": "We have pronounced an adoring speech to the holy sage, to the manly bull. Gavishthira adoringly has sent his song of praise to Agni as the gold (i. e. the sun) far-reaching (is sent by the gods upward) to the sky.",
   "05.002.01": "The young mother carries in secret the boy confined 1; she does not yield him to the father. People do not see before them his fading 2 face laid down with the Arâti 3.",
   "05.002.02": "Who is that boy, O young woman, whom thou, the Peshî 1, carriest? It is the queen who has borne him. Through many autumns the fruit of the womb has increased. I saw him born when his mother gave birth to him.",
   "05.002.03": "I saw him the gold-toothed, brilliant-coloured preparing his weapons far from his dwelling-place 1. After I have offered to him the ambrosia cleared (from all impure mixture) 2—what may the Indra-less, the hymnless do to me?",
   "05.002.04": "I saw him, the highly shining (Agni), walking far from his dwelling-place, like (a bull) together with the herd 1. Those (women) have not held him, for he has been born. The young women become grey 2.",
   "05.002.05": "Who have separated my young bull from the cows that 1 had no cow-herd, not even a stranger? May those who have held him, let him loose. May he, the knowing one, lead the cattle towards us.",
   "05.002.06": "Him, the king of dwellings (?) 1, the dwelling-place of people, the Arâtis have laid down 2 among men. May the spells of Atri loose him. May the reproachers become reproachable (themselves).",
   "05.002.07": "Thou hast loosed the bound Sunahsepa from the thousand sacrificial posts; for he toiled (worshipping thee). Thus, O Agni, loose from us the fetters, O knowing Hotri, sitting down here.",
   "05.002.08": "1 For thou hast gone away 2 from me, because thou wert angry; (this) the protector of the laws of the gods 3 has told me. (But) Indra, the knowing one, has looked after thee. Instructed by him, O Agni, I have come hither.",
   "05.002.09": "Agni shines with mighty light; he makes all things visible by his greatness. He conquers godless, wicked wiles. He sharpens his two horns in order to pierce the Rakshas.",
   "05.002.10": "And may the roarings of Agni mount up to the sky, with sharp weapons in order to kill the Rakshas. In his rapture his flames break down (everything); the godless hindrances do not hold him back.",
   "05.002.11": "This song of praise, O strong-born (Agni), I, the priest, have fashioned for thee, as a skilful workman (builds) a chariot 1. If thou acceptest that (praise), O god Agni, may we conquer thereby waters together with the sun.",
   "05.002.12": "May the bull 1 with mighty neck, grown strong, with no foe to resist him, get together the niggard's wealth. Thus the immortal (gods) have spoken to this Agni: may he grant protection to the man who has spread the Barhis; may he grant protection to the man who brings offerings.",
   "05.003.01": "Thou, O Agni, art Varuna, when born; thou becomest Mitra when kindled. In thee, O son of strength, the Visvedevâs (dwell). Thou art Indra for the mortal worshipper.",
   "05.003.02": "Thou becomest Aryaman when thou bearest 1 the secret name of the maidens, O self-dependent one. They anoint (thee) with cows 2 like the well-established Mitra 3, when thou makest husband and wife one-minded.",
   "05.003.03": "For thy glory the Maruts have cleansed themselves 1, who are thy fair and brilliant offspring, O Rudra 2! The footprint of Vishnu which is put down in the highest place: therewith thou protectest the secret name of the cows.",
   "05.003.04": "By thy beauty, O god, the gods are beautiful to behold 1. Assuming many (powers or goods) they attached themselves to immortality. Men have set down Agni as the Hotri, the Usigs, honouring (him), the praise of Âyu 2.",
   "05.003.05": "There is no (other) Hotri before thee, a better sacrificer 1; no one surpasses thee, O self-dependent one, by wisdom. And that house of which thou art the guest, he 2, O god, will overcome the mortals by his sacrifice.",
   "05.003.06": "May we overcome the mortals, O Agni, protected by thee, striving for wealth, awaking (thee) with offerings; may we (overcome mortals) in the contest, in the distribution 1 of days; may we (overcome them) by wealth, O son of strength!",
   "05.003.07": "If a man should turn upon us sin or guilt, bring ye the evil on him who pronounces evil spells (against us). Destroy, O knowing one, such a curse, O Agni, (of a man) who injures us by falsehood.",
   "05.003.08": "Thee, O god, the ancient (mortals) have made their messenger at the break of this (dawn), and have sacrificed with their oblations, when thou goest along, O Agni, in the abode of wealth, a god kindled by the mortals and by the Vasus.",
   "05.003.09": "Protect the father—drive away (evil) as the knowing one—(the father) who is considered 1 as thy son, O son of strength 2. When, O sapient (Agni), wilt thou look upon us? When wilt thou, who knowest Rita, requite (human deeds)?",
   "05.003.10": "The father 1 adoring gives many names to thee, O Vasu, if thou shouldst take pleasure therein. Will not Agni, delighting in his divine power, grant us his favour, he who has grown strong?",
   "05.003.11": "Thou indeed, O Agni, youngest one, bringest thy praiser across all dangers. Thieves have been seen and deceitful men; dishonest people have come with unknown designs.",
   "05.003.12": "These our processions have been directed towards thee. Yes, to thee, the Vasu, this guilt has been confessed. Verily this Agni, grown strong, will never surrender us to the curse nor to him who does harm to us.",
   "05.004.01": "Thee, O Agni, the treasure-lord of treasures, I gladden at the sacrifices, O king! May we, striving for gain, conquer gain through thee; may we overcome the hostilities of mortals.",
   "05.004.02": "Agni, the bearer of oblations, our ever-young father, is mighty, brilliant, beautiful to behold among us. Shine (on us) food with a good household 1. Turn all glory towards us 2.",
   "05.004.03": "Establish Agni as the Hotri, the sage of the clans, the lord of human clans, the bright purifier, whose back is covered with ghee, the omniscient. May he obtain the best goods (for us) among the gods.",
   "05.004.04": "Enjoy thyself, O Agni, joined with Idâ, uniting thyself with the rays of the sun. Enjoy our fuel, O Gâtavedas, and bring the gods hither that they may eat our offerings.",
   "05.004.05": "Welcome, as our household-god and the guest in our dwelling, come to this our sacrifice as the knowing one. Dispelling, O Agni, all (hostile) attempts, bring to us the possessions of those who are at enmity with us.",
   "05.004.06": "Drive away the Dasyu with thy weapon, creating strength for thy own body. When thou bringest the gods across (to us), O son of strength, then, O manliest Agni, protect us in (our striving for) gain.",
   "05.004.07": "May we worship thee, O Agni, with hymns, with offerings, O purifier with glorious light. Stir for us wealth with all goods; bestow on us all riches!",
   "05.004.08": "Gâtavedas, as with a boat across a river. Agni, being praised with adoration as (thou hast been praised) by Atri, be a protector of our bodies.",
   "05.004.09": "Bring us across all difficulties and dangers,",
   "05.004.10": "When I, the mortal, call thee, the immortal, thinking of thee with humble mind 1, bestow glory on us, O Gâtavedas; may I attain immortality, O Agni, with my offspring.",
   "05.004.11": "The well-doer to whom thou, O Agni Gâtavedas, createst pleasant freedom, will happily attain wealth with horses and sons, with valiant men and cows.",
   "05.005.01": "Sacrifice sharp ghrita to the well-kindled light, to Agni Gâtavedas.",
   "05.005.02": "May the unbeguiled Narâsamsa make this sacrifice ready; for he is a sage with honey in his hand.",
   "05.005.03": "1 Agni, magnified by us, bring hither to our help the bright, beloved Indra, with easy-going chariots.",
   "05.005.04": "Soft like wool 1 spread thyself (O Barhis). The hymns have been sung to thee. Be to us for success, O beautiful (Barhis)!",
   "05.005.05": "O divine, easily passable doors, open yourselves for our protection. Fill the sacrifice (with bliss) further and further!",
   "05.005.06": "We approach (with prayers) Night and Morning, whose face is beautiful, the increasers of vital strength, the two young mothers of Rita.",
   "05.005.07": "On the wind's flight, magnified, ye two divine Hotris of man, come hither to this our sacrifice.",
   "05.005.08": "1 Ilâ, Sarasvatî, and Mahî, the three comfort-giving goddesses, they who do not fail, shall sit down on the sacrificial grass.",
   "05.005.09": "Come hither as a friend, Tvashtri and mighty in welfare, and also by thyself, protect us in every sacrifice.",
   "05.005.10": "Where thou knowest, O tree (i. e. sacrificial post), the secret names of the gods, to that place make the offerings go.",
   "05.005.11": "Svâhâ to Agni and Varuna! Svâhâ to Indra and the Maruts! Svâhâ to the gods for our offering!",
   "05.006.01": "I think of that Agni who is a Vasu, to whom the milch-cows go home, the swift horses (go) home, (our) own racers (go) home. Bring food to thy praisers!",
   "05.006.02": "He is Agni who is praised as the Vasu, he to whom the milch-cows come together, and the quickly running horses, and the well-born liberal patrons. Bring food to thy praisers!",
   "05.006.03": "For Agni, dwelling among all tribes, gives a racer to the clan. Agni (gives a racer) that is truly helpful for (winning) wealth 1: he (the racer) being well cherished, will attain precious gain. Bring food to thy praisers!",
   "05.006.04": "May we kindle thee 1, Agni, O god, the brilliant, never ageing, in order that yon highly miraculous fuel of thine 2 may shine in the sky. Bring food to thy praisers!",
   "05.006.05": "To thee 1, O Agni, our oblation is offered with a Rik, O lord of bright splendour, highly brilliant, wonderful lord of the clan, carrier of oblations! Bring food to thy praisers!",
   "05.006.06": "Those Agnis make everything precious prosper in the Agnis; they drive forward (precious wealth); they incite it; they speed it hither in the due way 1. Bring food to thy praisers!",
   "05.006.07": "Those flames of thine, O Agni, the racers, have boasted mightily—they who with the flight of their hoofs have made tremble 1 the stables of the cows. Bring food to thy praisers!",
   "05.006.08": "Bring fresh food with fine dwellings, O Agni, to us, thy praisers! May we be of those who have praised (thee), who have thee as their messenger, house by house. Bring food to thy praisers!",
   "05.006.09": "Thou warmest in thy mouth, O highly brilliant one, the two (sacrificial) ladles full of butter. And mayst thou fill us (with gifts) at our hymns, O lord of strength! Bring food to thy praisers!",
   "05.006.10": "Thus 1 they have driven, they have led 2, Agni in the due way by prayers and sacrifices. May he bestow on us plenty of valiant men, and that plenty of swift horses (wished for) 3. Bring food to thy praisers!",
   "05.007.01": "O friends, (bring) together your united food and praise to Agni, the strongest (god) of (human) dwellings, the offspring of Vigour, the mighty one—",
   "05.007.02": "At whose onslaught 1, wherever it be, men rejoice in the seat of men, whom the worthy ones kindle, whom (human) creatures produce.",
   "05.007.03": "When we get together the food and the offerings of men, he has grasped, with the strength of his splendour, the rein of Rita.",
   "05.007.04": "He indeed produces light even by night to him who is afar, when he, the ever-young purifier, destroys the lords of the forest.",
   "05.007.05": "He at whose officiating (men) pour down the offering of their sweat on the paths—to Him who is noble by his own nature, the worlds have risen as to ridges (of hills)—",
   "05.007.06": "He whom the mortal has acquired, the much-desired (god), for the refreshment of every one, the sweetener of nourishment, the homestead for the Âyu—",
   "05.007.07": "He indeed, the beast, mows off deserts and habitable land like a mower, the golden-bearded with brilliant teeth, the Ribhu of undecaying strength.",
   "05.007.08": "The bright one for whom (the ghrita) streams (quickly) like an axe 1, as at (the sacrifice of) Atri. Him the well-bearing mother has born, as soon as 2 she had enjoyed love 3.",
   "05.007.09": "He who satisfies thee for refreshment, O Agni who drinkest butter: mayst thou bestow splendour, renown, and (wise) mind on such mortals 1.",
   "05.007.10": "Thus I have seized upon the spirit of Adhrig(?) as upon a head of cattle given by thee 1. May then Atri, O Agni, overcome the Dasyus who do not give (to the Brahmans); may Isha overcome the men (who do not give).",
   "05.008.01": "Thee, O Agni, the men who love Rita have kindled, the ancient ones thee the ancient, for the sake of bliss, O (god) who art produced by strength; the highly-brilliant, worshipful, in whom all refreshment dwells, the household god, the lord of the house, the chosen.",
   "05.008.02": "Thee, O Agni, the clans have set down, the ancient guest, the flame-haired lord of the house, with mighty light, with many shapes, the winner of prizes, giving good shelter and good help, who is busy among the decayed (wood) 1.",
   "05.008.03": "Thee, O Agni, the human clans magnify, who knowest (the art of sacrificial) libations, who separatest (what was mixed) 1, the highest bestower of treasures, who, (though) dwelling in secret, O blessed one, (yet) art visible to all, mightily roaring, an excellent sacrificer, shining with ghee.",
   "05.008.04": "Thee, O Agni, the supporter, we always have praised with our songs and have sat down near thee with adoration. Thus being kindled, O Aṅgiras, be pleased with us, as a god through the mortal's brilliant (offering) 1, with thy glorious splendours.",
   "05.008.05": "Thou, O Agni, manifold-shaped, bestowest vigour on every house in thy ancient way, O much-praised one.! Thou rulest with might over much food. This impetuousness of thine, when thou rushest forward impetuously, is not to be defied.",
   "05.008.06": "Thee, O Agni, when kindled, O youngest one, the gods have made their messenger and bearer of oblations. Thee who extendest over wide spaces, who dwellest in ghee, into whom offerings are poured, they have made their eye, impetuous, stirring thoughts.",
   "05.008.07": "Thee, O Agni, on whom offerings of ghee are poured, (men) desirous of thy favour have kindled from of old with good fuel. Thus, grown strong, increased by the plants, thou spreadest thyself over the terrestrial spaces.",
   "05.009.01": "Thee, O Agni, the god, mortals bringing offerings magnify. I deem thee the Gâtavedas. Carry then the offerings (to the gods) in thy due way.",
   "05.009.02": "Agni is the Hotri of the dwelling where they offer gifts and spread the sacrificial grass, he with whom sacrifices, with whom glorious gains assemble.",
   "05.009.03": "And he whom the kindling-stick has born, the young one, like a young (calf), the supporter of human clans, Agni the best sacrificer—",
   "05.009.04": "And thou showest thyself hard to seize like a son of … 1, thou who art a burner of many woods, O Agni, like an animal (that consumes all grass) on a meadow 2.",
   "05.009.05": "1 And he whose smoky 2 flames come together, when Trita in heaven blows upon him like a smelter, sharpens (him) as in smelting (him) 3…",
   "05.009.06": "May I through thy protection, O Agni, and through the praises of Mitra—may we 1, like dispellers of malice, overcome the dangers of mortals.",
   "05.009.07": "Bring this wealth to us, O powerful Agni, to (these our) men. May he 1 give us dwelling; may he 1 give us prosperity; may he 1 help us in winning booty. And help us to grow strong in fights!",
   "05.010.01": "Agni, bring us the mightiest splendour, O liberal one 1! With wealth and plenty cleave a path for us to booty.",
   "05.010.02": "Thou, O wonderful Agni, (protect) us, through thy power of mind, through the bounteousness of thy strength. Upon thee mysterious power has entered. (Thou art) indeed 1 like worshipful Mitra.",
   "05.010.03": "Thou, O Agni, increase for our sake the dominion and the prosperity of those liberal givers, (of those) men who have accomplished liberalities (towards us) for our songs of praise.",
   "05.010.04": "They who adorn prayers for thee, O bright Agni, the givers of horses 1: those men are powerful in their power, whose glory awakes by itself (shining) more mightily than even the sky 2.",
   "05.010.05": "Those shining flames of thine, Agni, go fiercely along, like lightnings (flashing) around the earth, like a thundering chariot bent on victory.",
   "05.010.06": "Now then, Agni, (come) for our protection, and for the reward of the urgent (worshipper)! May our liberal patrons pass across 1 all regions 2!",
   "05.010.07": "Thou, O Agni, Aṅgiras, who hast been praised and who art being praised, bring us, O Hotri, wealth which overpowers (even) skilful men, to thy praisers, and thou shalt be praised by us. And help us to grow strong in fights 1.",
   "05.011.01": "The guardian of people, the watchful one, Agni, the highly dexterous, has been born, for the sake of new welfare. With ghrita on his face, with his mighty, heaven-touching (light) he, the bright one, brilliantly shines for the Bharatas.",
   "05.011.02": "Agni, the beacon of sacrifice, the first Purohita 1 men have kindled in the threefold abode 2. (Driving) on the same chariot with Indra and with the gods, he, the highly wise Hotri, has sat down on the Barhis for sacrificing.",
   "05.011.03": "Though not cleansed, thou art born bright from thy two mothers 1. Thou hast arisen as the joy-giving sage belonging to Vivasvant 2 They have strengthened thee by ghrita, O Agni, into whom oblations are poured. Smoke, reaching the sky, has become thy beacon.",
   "05.011.04": "May Agni straightway come to our sacrifice. Men carry Agni here and there, house by house. Agni has become the messenger, the carrier of oblations. Choosing Agni they choose a thoughtful (god).",
   "05.011.05": "For thee, O Agni, is this sweetest speech, for thee this prayer; may this one do thy heart good 1! The prayers fill thee with power and strengthen thee, like great rivers the Sindhu.",
   "05.011.06": "Thee, O Agni, who wert hidden, dwelling here and there in every wood, the Aṅgiras have discovered 1. Thus thou art born, produced by attrition, a mighty force. Thee, O Aṅgiras, they call the son of strength.",
   "05.012.01": "To the mighty, sacrificial Agni, to the bull of Rita 1, the Asura, I bring this prayer and this song, which is turned towards him, to (him) the bull, as well-clarified ghrita (is poured) into his mouth at the sacrifice.",
   "05.012.02": "O knower of Rita, know the Rita! Bore for many streams of Rita. I (do) not (serve) a Yâtu 1 by violence nor by falsehood; I serve the Rita of the red bull 2.",
   "05.012.03": "How, O Agni, performing the Rita through Rita, mayst thou become a witness of our newest 1 hymn? The god, the protector of the seasons, knows of my seasons 2. I (do) not (know another) lord but him who attains (for us) this wealth.",
   "05.012.04": "Who, O Agni, are thy fetterers to (fetter) the impostor 1? What brilliant guardians were successful? Who, O Agni, drink the drink of falsehood? Who are the protectors of untrue speech?",
   "05.012.05": "These friends of thine, O Agni, turning themselves from (thee) 1, they who had been kind, have become unkind. They have harmed themselves by their own speeches, uttering wrong words to the righteous.",
   "05.012.06": "He who magnifies thy sacrifice, O Agni, by adoration, and serves 1 the Rita of the red bull: may a large, good dwelling come to him, to the offspring of the advancing Nahusha.",
   "05.013.01": "Praising we call 1 thee; praising let us kindle 1 thee, Agni, praising, for thy help.",
   "05.013.02": "Desirous of riches, we devise to-day an effective song of praise, of Agni the heaven-touching god 1.",
   "05.013.03": "May Agni take pleasure in our prayers, he who is the Hotri among men. May he sacrifice 1 to the divine host.",
   "05.013.04": "Thou, O Agni, art widely extended, the gladly accepted, desirable Hotri; through thee they spread out the sacrifice.",
   "05.013.05": "The priests make thee grow, O Agni, the greatest acquirer of wealth, the highly praised one. Bestow thou on us abundance of heroes.",
   "05.013.06": "Agni! Thou encompassest the gods as the felly (encompasses) the spokes (of a wheel). Thou strivest 1 for brilliant wealth.",
   "05.014.01": "Awaken 1 Agni by thy song of praise, kindling (him) the immortal one. May he place our offerings among the gods.",
   "05.014.02": "Him, the immortal god, the mortals magnify at their sacrifices, the best sacrificer among the tribe of men.",
   "05.014.03": "Him indeed they all magnify, the god, with the (sacrificial) ladle that overflows with ghrita, Agni, in order that he may bear the oblation.",
   "05.014.04": "Agni when born has shone, killing the Dasyus, (killing) darkness by light. He has found the cows, the waters, the sun 1.",
   "05.014.05": "Worship Agni, the sage who should be magnified, whose back is covered with ghrita. May he come and hear my call 1.",
   "05.014.06": "They have made Agni grow by ghrita, him who dwells among all tribes, and by longing, eloquent praises.",
   "05.015.01": "I bring a prayer to the worshipper, the renowned sage, the glorious, ancient one. Agni is the highly gracious Asura, taking his seat in ghrita, the holder of wealth, supporting goods.",
   "05.015.02": "By Rita they have supported the supporting Rita, near the powerful (performer) 1 of sacrifice, in highest heaven, the men who sit 2 on the supporting support of the sky, and who with born (men) attained to the unborn.",
   "05.015.03": "Dispelling anguish 1 they spread out for the ancient one 2 his bodies 3, mighty vital power, difficult to overcome. May he, the new-born, traverse the spaces. They have stood round him as round an angry lion.",
   "05.015.04": "When thou carriest, spreading out, man after man like a mother, for their nourishment and for their sight, when thou growest old 1 assuming life after life, thou goest around by thyself in manifold shapes.",
   "05.015.05": "May gain protect now the boundaries of thy strength, the wide, firmly supporting milkstream 1 of wealth, O god! Putting down thy foot in secret like a thief 2, thou hast enlightened and freed Atri for the sake of wealth mightily 3.",
   "05.016.01": "Sing 1 (a song that gives) mighty vital power, to the light, to god Agni, whom the mortals have placed in front 2 like Mitra by their praises 3.",
   "05.016.02": "For he, Agni, the Hotri of men, day by day, in the arms of Daksha, discloses the offering in the due way, as Bhaga 1 (discloses) a treasure.",
   "05.016.03": "(We abide [?]) in his praise, the liberal (god's), in his friendship, the mightily brilliant one's, in whom, the loudly roaring Aryan, all (beings) have put together their strength.",
   "05.016.04": "For verily, O Agni, (thou belongest [?]) to them 1 through thy bounteousness 2 in (bestowing) abundance of heroes. Him indeed, the vigorous one, his glory the two worlds could not encompass 3.",
   "05.016.05": "Now then, Agni, come hither and, being praised, bring treasure 1 to us who, we ourselves and our liberal givers, may acquire welfare together. And help us to grow strong in fights.",
   "05.017.01": "May the mortal truly by sacrifices, O god, (magnify) the stronger one for help; may the Pûru, when good service has been performed, magnify Agni (and thereby draw him) hither for his aid.",
   "05.017.02": "For thou art manifestly considered as his (i. e. Agni's) disposer, highly brilliant by thyself 1: (magnify then Agni who is) a firmament of bright splendour, lovely beyond 2 thought 3.",
   "05.017.03": "(It is) yonder (sun?) who verily has been yoked by his (i. e. Agni's) light 1 through the impetuous speech 2—(by the light of Agni) whose flames mightily shine as if (they were made to shine) by the sperm of heaven 3.",
   "05.017.04": "Through his, the wise one's, insight there is wealth on his, the wonderful (Agni's), chariot. And Agni is praised, he who is to be invoked among all peoples.",
   "05.017.05": "Now indeed our liberal lords have manifestly attained 1 treasure. Offspring of vigour! Protect us for the sake of victory! Help us to welfare! And assist us to grow strong in fights i",
   "05.018.01": "May Agni, beloved of many, the guest of the house 1, be praised in the morning, the immortal who delights 2 in all offerings among the mortals.",
   "05.018.02": "1 To Dvita who by the liberal power of his dexterousness carries away injury 2, this praiser of thine, O immortal, prepares Soma in the due way.",
   "05.018.03": "I call for your sake Him who flames through long life, with the speech that belongs to the liberal patrons 1 whose chariot moves uninjured, O giver of horses 2;",
   "05.018.04": "And in whom (dwells) brilliant thought, who guard the hymns of praise in their mouth, (whose) sacrificial grass is spread in the realm of the sun: they have invested themselves with glory.",
   "05.018.05": "On the liberal patrons who have given me fifty horses for my song of praise 1, bestow brilliant, mighty, high glory, O Agni; on those men (bestow glory) with (valiant) men, O immortal!",
   "05.019.01": "They are born for retirement 1. Out of the cover he 2 has shone forth, being a cover himself. In the lap of the mother he looks about 3.",
   "05.019.02": "Causing him to discern (the pious and the impious?), they have sacrificed. With unwinking eyes they protect his manly power. They have penetrated into the firm stronghold 1.",
   "05.019.03": "The people of Svaitreya 1, his clans, have thriven brilliantly. Brihaduktha with a golden ornament at his neck, is eager for the race as if by this honey-drink 2.",
   "05.019.04": "Like the dear milk of love 1—(a thing) unrelated with two (things) related 2—like the gharma vessel with booty in its belly—undeceived, the deceiver of all 3.",
   "05.019.05": "Sporting, O beam of light, appear to us, joined with the ash, with the wind. May those well sharpened … of his, standing on …, be sharp like… 1.",
   "05.020.01": "1 Whatever good, O Agni, best acquirer of gain, thou thinkest (fit), praise thou 2 that (good), which is celebrated in songs, among the gods as our share.",
   "05.020.02": "They, Agni, who do not set into motion for thee (prayers or offerings), when grown full of mighty strength 1, turn away to encounter the hatred and the tricks of him who follows another (i. e. a wrong) law 2.",
   "05.020.03": "We choose thee as our Hotri, Agni, the giver of skill; offering delight (to thee) we call with our prayer (thee), the foremost at the sacrifices.",
   "05.020.04": "So that we, O strong one, (may be ready) for thy favour, for wealth and Rita, O highly wise one: thus may we day by day rejoice 1 with cows and rejoice with heroes.",
   "05.021.01": "Let us lay thee down, as Manus did. Let us kindle thee, as Manus did. O Agni Aṅgiras, sacrifice to the gods for the worshippers of the gods as (thou didst) for Manus.",
   "05.021.02": "For thou, O Agni, art kindled, highly pleased, among human people. To thee the (sacrificial) ladles proceed in due order, O well-born one who drinkest butter.",
   "05.021.03": "Thee all the gods unanimously have made their messenger. Serving thee, O sage, they magnify at the sacrifices (thee) the god.",
   "05.021.04": "Let the mortal magnify for your sake Agni, the god, with worship as is due to the gods. Being kindled, O brilliant one, shine! Sit down in the abode 1 of Rita; sit down in the abode of herbs 2.",
   "05.022.01": "Lo, Visvasâman! Like Atri sing to him who purifies with his flames, to the Hotri who should be magnified at the sacrifices, most delightful in the clan.",
   "05.022.02": "1 Lay down Agni Gâtavedas, the god, the priest. May the sacrifice which best encompasses the gods, proceed to-day in due order.",
   "05.022.03": "We, the mortals, approaching thee, the attentive-minded god, for thy help, have thought of thy desirable aid.",
   "05.022.04": "Agni, be intent on this—on this our word 1, O strong one. As such, O strong jawed 2 lord of the house, the Atris strengthen thee by their praises; the Atris beautify thee by their prayers.",
   "05.023.01": "Agni, bring hither, through the power of thy splendour, powerful wealth which may manifestly prevail over all tribes in the (contests for) booty.",
   "05.023.02": "O powerful Agni! Bring hither that wealth powerful in battles. For thou art the true, wonderful giver of booty rich in cows.",
   "05.023.03": "For all men who have spread out the sacrificial grass, unanimously ask thee, the beloved Hotri in the seats (of sacrifice), for many boons.",
   "05.023.04": "For he who dwells among all tribes, has invested himself with power against assault 1. Agni! In these dwelling-places shine to us richly, O bright one, shine brilliantly, O purifier!",
   "05.024.01": "Agni, be thou our nearest (friend) and our kind, protecting guardian.",
   "05.024.02": "Agni is Vasu, renowned as Vasu (or, renowned by goods). Obtain, (and) bestow (on us), most brilliant wealth 1.",
   "05.024.03": "Listen to us then; hear our call; deliver us from every harmful man.",
   "05.024.04": "We entreat thee now, O brightest, shining (Agni), for thy grace, for our friends.",
   "05.025.01": "Address thy song 1 for your sake to the god Agni, for his help. He is our Vasu. May the son of the dawns(?) 2 give us (wealth). May the righteous one help us across our enemies.",
   "05.025.02": "He is the true one, whom the men of old, whom the gods have kindled, the Hotri with the delightful tongue, rich in splendour with glorious shine.",
   "05.025.03": "As such, with thy widest thought and with thy best favour, shine wealth on us, excellent Agni, for our beautiful praises 1.",
   "05.025.04": "Agni reigns among the gods, Agni among mortals, entering among them. Agni is the carrier of our offerings. Serve ye Agni with prayers!",
   "05.025.05": "Agni gives to the worshipper a son most mightily renowned, a knower of mighty spells, most excellent, unconquered, who brings renown to his lord 1.",
   "05.025.06": "Agni gives a good lord who is victorious in battles with his men; Agni (gives) a steed, swiftly running, victorious (in races), unconquered.",
   "05.025.07": "Sing mightily to Agni the (song) which may best bring him (to us), O (god) rich in splendour 1! From thee (proceeds) wealth (mighty) like a buffalo-cow 2; from thee proceed gains.",
   "05.025.08": "Thy brilliant flames resound mightily like the pressing-stone (of the Soma) 1. And thy roaring arose like thunder by itself from heaven 2.",
   "05.025.09": "Thus we have paid homage, desirous of goods, to powerful Agni. May he, the highly wise one, help us, as with a ship, across all enemies.",
   "05.026.01": "Agni, purifier! With thy splendour, with thy delightful tongue, O god, bring hither the gods and perform the sacrifice.",
   "05.026.02": "Thee therefore we approach, who swimmest in ghrita 1, O (god) with brilliant light, thee of sun-like aspect. Bring hither the gods that they may feast.",
   "05.026.03": "Let us kindle thee, O sage, the brilliant offerer of feasts (to the gods), O Agni, the mighty (god) at the sacrifice.",
   "05.026.04": "Agni, come hither with all the gods to the gift of the offering. We choose thee as our Hotri.",
   "05.026.05": "Bring to the sacrificer who presses (Soma), Agni, abundance of heroes. Sit down on the sacrificial grass together with the gods.",
   "05.026.06": "Being kindled, Agni, conqueror of thousandfold (wealth), thou makest the ordinances (of the world) thrive, the praiseworthy messenger of the gods.",
   "05.026.07": "1 Lay down Agni Gâtavedas, the carrier of offerings, the youngest, the god, the priest.",
   "05.026.08": "May the sacrifice which best encompasses the gods, proceed to-day in due order. Spread the sacrificial grass that (the gods) may sit down on it.",
   "05.026.09": "May the Maruts, the Asvins, Mitra and Varuna sit down on this (sacrificial grass). the gods with all their folk.",
   "05.027.01": "The good lord has presented me with two oxen together with a car, the most brilliant Asura among the liberal givers 1. Tryaruna, the son of Trivrishan, O Agni Vaisvânara 2, has distinguished himself by (his gift of) ten thousand (cows?) 3.",
   "05.027.02": "To him who gives me one hundred 1 and twenty cows and two fallow steeds, harnessed and well-yoked, to Tryaruna grant thy protection, Agni Vaisvânara, who art highly praised and grown strong.",
   "05.027.03": "Thus, O Agni, desiring thy favour 1, Trasadasyu 2 (sings) for the ninth time 3 to thee the youngest (god)—Tryaruna who responds to my, the strong-born's, many hymns with (the gift of) a yoked (chariot) 4—",
   "05.027.04": "1 Who may thus announce me 2 to Asvamedha the liberal (prince): may he give to him who with his verse strives for gain; may he give to him who lives in the Rita for (acquiring) wisdom 3—",
   "05.027.05": "Asvamedha whose gifts, a hundred speckled bulls, delight me like Soma juices with threefold admixture 1.",
   "05.027.06": "Indra-Agni! Bestow on Asvamedha, the giver of a hundred (bulls), abundance of heroes and mighty royal power, like the never-ageing Sun in heaven.",
   "05.028.01": "Agni kindled has sent his light to the sky; turned towards the dawn he shines far and wide. (The sacrificial ladle) goes forward with adoration, rich in all treasures, magnifying the gods with sacrificial food.",
   "05.028.02": "Being kindled thou reignest over immortality; thou attendest for welfare the man who prepares the sacrificial food. He whom thou furtherest, acquires all wealth and puts in front hospitality (towards thee), O Agni 1.",
   "05.028.03": "Agni, show thy prowess for the sake of great bliss. May thy splendours be highest. Make our householdership easy to conduct 1. Set thy foot on the greatness of those who show enmity to us.",
   "05.028.04": "I adore thy beauty, Agni, who hast been kindled, who art highly exalted. A bull, brilliant art thou. Thou art kindled at the sacrifices.",
   "05.028.05": "Being kindled, Agni into whom offerings are poured, sacrifice to the gods, best sacrificer, for thou art the carrier of oblations.",
   "05.028.06": "Sacrifice into (Agni); exalt Agni, while the sacrifice is going on. Choose him for your carrier of oblations."
}